zephyrproject-rtos/hal_ambiq/dts/apollo510/ambiq-apollo510-pinmux.h
#define M2SDAWIR3_P26           APOLLO5_PINMUX(26,0)
#define M2MOSI_P26              APOLLO5_PINMUX(26,1)
#define RESERVED2_P26           APOLLO5_PINMUX(26,2)
#define GPIO_P26                APOLLO5_PINMUX(26,3)
#define HFRC_EXT_P26            APOLLO5_PINMUX(26,4)
#define UART1RX_P26             APOLLO5_PINMUX(26,5)
#define CT26_P26                APOLLO5_PINMUX(26,6)
#define NCE26_P26               APOLLO5_PINMUX(26,7)
#define OBSBUS10_P26            APOLLO5_PINMUX(26,8)
#define VCMPO_P26               APOLLO5_PINMUX(26,9)
#define RESERVED10_P26          APOLLO5_PINMUX(26,10)
#define FPIO_P26                APOLLO5_PINMUX(26,11)
#define RESERVED12_P26          APOLLO5_PINMUX(26,12)
#define RESERVED13_P26          APOLLO5_PINMUX(26,13)
#define RESERVED14_P26          APOLLO5_PINMUX(26,14)
#define SCANIN9_P26             APOLLO5_PINMUX(26,15)

#define M2MISO_P27              APOLLO5_PINMUX(27,0)
#define TRIG0_P27               APOLLO5_PINMUX(27,1)
#define MNCE3_0_P27             APOLLO5_PINMUX(27,2)
#define GPIO_P27                APOLLO5_PINMUX(27,3)
#define XT_EXT_P27              APOLLO5_PINMUX(27,4)
#define UART1CTS_P27            APOLLO5_PINMUX(27,5)
#define CT27_P27                APOLLO5_PINMUX(27,6)
#define NCE27_P27               APOLLO5_PINMUX(27,7)
#define OBSBUS11_P27            APOLLO5_PINMUX(27,8)
#define RESERVED9_P27           APOLLO5_PINMUX(27,9)
#define RESERVED10_P27          APOLLO5_PINMUX(27,10)
#define FPIO_P27                APOLLO5_PINMUX(27,11)
#define RESERVED12_P27          APOLLO5_PINMUX(27,12)
#define RESERVED13_P27          APOLLO5_PINMUX(27,13)
#define RESERVED14_P27          APOLLO5_PINMUX(27,14)
#define RESERVED15_P27          APOLLO5_PINMUX(27,15)

#define SWO_P28                 APOLLO5_PINMUX(28,0)
#define VCMPO_P28               APOLLO5_PINMUX(28,1)
#define RESERVED2_P28           APOLLO5_PINMUX(28,2)
#define GPIO_P28                APOLLO5_PINMUX(28,3)
#define UART2CTS_P28            APOLLO5_PINMUX(28,4)
#define RESERVED5_P28           APOLLO5_PINMUX(28,5)
#define CT28_P28                APOLLO5_PINMUX(28,6)
#define NCE28_P28               APOLLO5_PINMUX(28,7)
#define OBSBUS12_P28            APOLLO5_PINMUX(28,8)
#define RESERVED9_P28           APOLLO5_PINMUX(28,9)
#define RESERVED10_P28          APOLLO5_PINMUX(28,10)
#define FPIO_P28                APOLLO5_PINMUX(28,11)
#define RESERVED12_P28          APOLLO5_PINMUX(28,12)
#define RESERVED13_P28          APOLLO5_PINMUX(28,13)
#define RESERVED14_P28          APOLLO5_PINMUX(28,14)
#define CME_P28                 APOLLO5_PINMUX(28,15)

#define TRIG0_P29               APOLLO5_PINMUX(29,0)
#define VCMPO_P29               APOLLO5_PINMUX(29,1)
#define RESERVED2_P29           APOLLO5_PINMUX(29,2)
#define GPIO_P29                APOLLO5_PINMUX(29,3)
#define UART1CTS_P29            APOLLO5_PINMUX(29,4)
#define RESERVED5_P29           APOLLO5_PINMUX(29,5)
#define CT29_P29                APOLLO5_PINMUX(29,6)
#define NCE29_P29               APOLLO5_PINMUX(29,7)
#define OBSBUS13_P29            APOLLO5_PINMUX(29,8)
#define RESERVED9_P29           APOLLO5_PINMUX(29,9)
#define RESERVED10_P29          APOLLO5_PINMUX(29,10)
#define FPIO_P29                APOLLO5_PINMUX(29,11)
#define RESERVED12_P29          APOLLO5_PINMUX(29,12)
#define RESERVED13_P29          APOLLO5_PINMUX(29,13)
#define RESERVED14_P29          APOLLO5_PINMUX(29,14)
#define CMLE_P29                APOLLO5_PINMUX(29,15)

#define TRIG1_P30               APOLLO5_PINMUX(30,0)
#define VCMPO_P30               APOLLO5_PINMUX(30,1)
#define RESERVED2_P30           APOLLO5_PINMUX(30,2)
#define GPIO_P30                APOLLO5_PINMUX(30,3)
#define UART0TX_P30             APOLLO5_PINMUX(30,4)
#define RESERVED5_P30           APOLLO5_PINMUX(30,5)
#define CT30_P30                APOLLO5_PINMUX(30,6)
#define NCE30_P30               APOLLO5_PINMUX(30,7)
#define OBSBUS14_P30            APOLLO5_PINMUX(30,8)
#define RESERVED9_P30           APOLLO5_PINMUX(30,9)
#define RESERVED10_P30          APOLLO5_PINMUX(30,10)
#define FPIO_P30                APOLLO5_PINMUX(30,11)
#define RESERVED12_P30          APOLLO5_PINMUX(30,12)
#define RESERVED13_P30          APOLLO5_PINMUX(30,13)
#define RESERVED14_P30          APOLLO5_PINMUX(30,14)
#define RESERVED15_P30          APOLLO5_PINMUX(30,15)

#define M3SCL_P31               APOLLO5_PINMUX(31,0)
#define M3SCK_P31               APOLLO5_PINMUX(31,1)
#define I2S0_CLK_P31            APOLLO5_PINMUX(31,2)
#define GPIO_P31                APOLLO5_PINMUX(31,3)
#define UART2TX_P31             APOLLO5_PINMUX(31,4)
#define UART2CTS_P31            APOLLO5_PINMUX(31,5)
#define CT31_P31                APOLLO5_PINMUX(31,6)
#define NCE31_P31               APOLLO5_PINMUX(31,7)
#define OBSBUS15_P31            APOLLO5_PINMUX(31,8)
#define VCMPO_P31               APOLLO5_PINMUX(31,9)
#define RESERVED10_P31          APOLLO5_PINMUX(31,10)
#define FPIO_P31                APOLLO5_PINMUX(31,11)
#define RESERVED12_P31          APOLLO5_PINMUX(31,12)
#define RESERVED13_P31          APOLLO5_PINMUX(31,13)
#define RESERVED14_P31          APOLLO5_PINMUX(31,14)
#define SCANOUT9_P31            APOLLO5_PINMUX(31,15)

#define M3SDAWIR3_P32           APOLLO5_PINMUX(32,0)
#define M3MOSI_P32              APOLLO5_PINMUX(32,1)
#define I2S0_DATA_P32           APOLLO5_PINMUX(32,2)
#define GPIO_P32                APOLLO5_PINMUX(32,3)
#define UART0RX_P32             APOLLO5_PINMUX(32,4)
#define UART3CTS_P32            APOLLO5_PINMUX(32,5)
#define CT32_P32                APOLLO5_PINMUX(32,6)
#define NCE32_P32               APOLLO5_PINMUX(32,7)
#define OBSBUS0_P32             APOLLO5_PINMUX(32,8)
#define I2S0_SDOUT_P32          APOLLO5_PINMUX(32,9)
#define RESERVED10_P32          APOLLO5_PINMUX(32,10)
#define FPIO_P32                APOLLO5_PINMUX(32,11)
#define RESERVED12_P32          APOLLO5_PINMUX(32,12)
#define RESERVED13_P32          APOLLO5_PINMUX(32,13)
#define RESERVED14_P32          APOLLO5_PINMUX(32,14)
#define LPG_ENABLE_P32          APOLLO5_PINMUX(32,15)

#define M3MISO_P33              APOLLO5_PINMUX(33,0)
#define CLKOUT_P33              APOLLO5_PINMUX(33,1)
#define I2S0_WS_P33             APOLLO5_PINMUX(33,2)
#define GPIO_P33                APOLLO5_PINMUX(33,3)
#define UART2RX_P33             APOLLO5_PINMUX(33,4)
#define UART2RTS_P33            APOLLO5_PINMUX(33,5)
#define CT33_P33                APOLLO5_PINMUX(33,6)
#define NCE33_P33               APOLLO5_PINMUX(33,7)
#define OBSBUS1_P33             APOLLO5_PINMUX(33,8)
#define DISP_TE_P33             APOLLO5_PINMUX(33,9)
#define MNCE1_0_P33             APOLLO5_PINMUX(33,10)
#define FPIO_P33                APOLLO5_PINMUX(33,11)
#define RESERVED12_P33          APOLLO5_PINMUX(33,12)
#define RESERVED13_P33          APOLLO5_PINMUX(33,13)
#define RESERVED14_P33          APOLLO5_PINMUX(33,14)
#define LPG_LOAD_P33            APOLLO5_PINMUX(33,15)

#define M4SCL_P34               APOLLO5_PINMUX(34,0)
#define M4SCK_P34               APOLLO5_PINMUX(34,1)
#define SWO_P34                 APOLLO5_PINMUX(34,2)
#define GPIO_P34                APOLLO5_PINMUX(34,3)
#define UART0TX_P34             APOLLO5_PINMUX(34,4)
#define UART2RX_P34             APOLLO5_PINMUX(34,5)
#define CT34_P34                APOLLO5_PINMUX(34,6)
#define NCE34_P34               APOLLO5_PINMUX(34,7)
#define OBSBUS2_P34             APOLLO5_PINMUX(34,8)
#define VCMPO_P34               APOLLO5_PINMUX(34,9)
#define I2S1_CLK_P34            APOLLO5_PINMUX(34,10)
#define FPIO_P34                APOLLO5_PINMUX(34,11)
#define RESERVED12_P34          APOLLO5_PINMUX(34,12)
#define RESERVED13_P34          APOLLO5_PINMUX(34,13)
#define RESERVED14_P34          APOLLO5_PINMUX(34,14)
#define RESERVED15_P34          APOLLO5_PINMUX(34,15)

#define M4SDAWIR3_P35           APOLLO5_PINMUX(35,0)
#define M4MOSI_P35              APOLLO5_PINMUX(35,1)
#define SWO_P35                 APOLLO5_PINMUX(35,2)
#define GPIO_P35                APOLLO5_PINMUX(35,3)
#define UART2TX_P35             APOLLO5_PINMUX(35,4)
#define UART3TX_P35             APOLLO5_PINMUX(35,5)
#define CT35_P35                APOLLO5_PINMUX(35,6)
#define NCE35_P35               APOLLO5_PINMUX(35,7)
#define OBSBUS3_P35             APOLLO5_PINMUX(35,8)
#define I2S1_SDOUT_P35          APOLLO5_PINMUX(35,9)
#define I2S1_DATA_P35           APOLLO5_PINMUX(35,10)
#define FPIO_P35                APOLLO5_PINMUX(35,11)
#define RESERVED12_P35          APOLLO5_PINMUX(35,12)
#define RESERVED13_P35          APOLLO5_PINMUX(35,13)
#define RESERVED14_P35          APOLLO5_PINMUX(35,14)
#define SCANOUT8_P35            APOLLO5_PINMUX(35,15)

#define M4MISO_P36              APOLLO5_PINMUX(36,0)
#define TRIG0_P36               APOLLO5_PINMUX(36,1)
#define MNCE3_0_P36             APOLLO5_PINMUX(36,2)
#define GPIO_P36                APOLLO5_PINMUX(36,3)
#define UART0RX_P36             APOLLO5_PINMUX(36,4)
#define UART1RX_P36             APOLLO5_PINMUX(36,5)
#define CT36_P36                APOLLO5_PINMUX(36,6)
#define NCE36_P36               APOLLO5_PINMUX(36,7)
#define OBSBUS4_P36             APOLLO5_PINMUX(36,8)
#define MNCE1_0_P36             APOLLO5_PINMUX(36,9)
#define I2S1_WS_P36             APOLLO5_PINMUX(36,10)
#define FPIO_P36                APOLLO5_PINMUX(36,11)
#define RESERVED12_P36          APOLLO5_PINMUX(36,12)
#define RESERVED13_P36          APOLLO5_PINMUX(36,13)
#define RESERVED14_P36          APOLLO5_PINMUX(36,14)
#define RESERVED15_P36          APOLLO5_PINMUX(36,15)

#define MSPI0_10_P37            APOLLO5_PINMUX(37,0)
#define TRIG1_P37               APOLLO5_PINMUX(37,1)
#define XT32KHz_P37             APOLLO5_PINMUX(37,2)
#define GPIO_P37                APOLLO5_PINMUX(37,3)
#define UART2RX_P37             APOLLO5_PINMUX(37,4)
#define UART3RX_P37             APOLLO5_PINMUX(37,5)
#define CT37_P37                APOLLO5_PINMUX(37,6)
#define NCE37_P37               APOLLO5_PINMUX(37,7)
#define OBSBUS5_P37             APOLLO5_PINMUX(37,8)
#define RESERVED9_P37           APOLLO5_PINMUX(37,9)
#define RESERVED10_P37          APOLLO5_PINMUX(37,10)
#define FPIO_P37                APOLLO5_PINMUX(37,11)
#define RESERVED12_P37          APOLLO5_PINMUX(37,12)
#define RESERVED13_P37          APOLLO5_PINMUX(37,13)
#define RESERVED14_P37          APOLLO5_PINMUX(37,14)
#define RESERVED15_P37          APOLLO5_PINMUX(37,15)

#define MSPI0_11_P38            APOLLO5_PINMUX(38,0)
#define TRIG2_P38               APOLLO5_PINMUX(38,1)
#define SWTRACECLK_P38          APOLLO5_PINMUX(38,2)
#define GPIO_P38                APOLLO5_PINMUX(38,3)
#define UART0RTS_P38            APOLLO5_PINMUX(38,4)
#define UART2RTS_P38            APOLLO5_PINMUX(38,5)
#define CT38_P38                APOLLO5_PINMUX(38,6)
#define NCE38_P38               APOLLO5_PINMUX(38,7)
#define OBSBUS6_P38             APOLLO5_PINMUX(38,8)
#define RESERVED9_P38           APOLLO5_PINMUX(38,9)
#define RESERVED10_P38          APOLLO5_PINMUX(38,10)
#define FPIO_P38                APOLLO5_PINMUX(38,11)
#define RESERVED12_P38          APOLLO5_PINMUX(38,12)
#define RESERVED13_P38          APOLLO5_PINMUX(38,13)
#define RESERVED14_P38          APOLLO5_PINMUX(38,14)
#define RESERVED15_P38          APOLLO5_PINMUX(38,15)

