zephyrproject-rtos/hal_ambiq/dts/apollo510/ambiq-apollo510-pinmux.h
#define MSPI0_12_P39            APOLLO5_PINMUX(39,0)
#define TRIG3_P39               APOLLO5_PINMUX(39,1)
#define SWTRACE0_P39            APOLLO5_PINMUX(39,2)
#define GPIO_P39                APOLLO5_PINMUX(39,3)
#define UART2RTS_P39            APOLLO5_PINMUX(39,4)
#define UART3RTS_P39            APOLLO5_PINMUX(39,5)
#define CT39_P39                APOLLO5_PINMUX(39,6)
#define NCE39_P39               APOLLO5_PINMUX(39,7)
#define OBSBUS7_P39             APOLLO5_PINMUX(39,8)
#define RESERVED9_P39           APOLLO5_PINMUX(39,9)
#define RESERVED10_P39          APOLLO5_PINMUX(39,10)
#define FPIO_P39                APOLLO5_PINMUX(39,11)
#define RESERVED12_P39          APOLLO5_PINMUX(39,12)
#define RESERVED13_P39          APOLLO5_PINMUX(39,13)
#define RESERVED14_P39          APOLLO5_PINMUX(39,14)
#define RESERVED15_P39          APOLLO5_PINMUX(39,15)

#define MSPI0_13_P40            APOLLO5_PINMUX(40,0)
#define TRIG1_P40               APOLLO5_PINMUX(40,1)
#define SWTRACE1_P40            APOLLO5_PINMUX(40,2)
#define GPIO_P40                APOLLO5_PINMUX(40,3)
#define UART0CTS_P40            APOLLO5_PINMUX(40,4)
#define UART1CTS_P40            APOLLO5_PINMUX(40,5)
#define CT40_P40                APOLLO5_PINMUX(40,6)
#define NCE40_P40               APOLLO5_PINMUX(40,7)
#define OBSBUS8_P40             APOLLO5_PINMUX(40,8)
#define RESERVED9_P40           APOLLO5_PINMUX(40,9)
#define RESERVED10_P40          APOLLO5_PINMUX(40,10)
#define FPIO_P40                APOLLO5_PINMUX(40,11)
#define RESERVED12_P40          APOLLO5_PINMUX(40,12)
#define RESERVED13_P40          APOLLO5_PINMUX(40,13)
#define RESERVED14_P40          APOLLO5_PINMUX(40,14)
#define RESERVED15_P40          APOLLO5_PINMUX(40,15)

#define MSPI0_14_P41            APOLLO5_PINMUX(41,0)
#define TRIG0_P41               APOLLO5_PINMUX(41,1)
#define SWTRACE2_P41            APOLLO5_PINMUX(41,2)
#define GPIO_P41                APOLLO5_PINMUX(41,3)
#define UART0TX_P41             APOLLO5_PINMUX(41,4)
#define UART1TX_P41             APOLLO5_PINMUX(41,5)
#define CT41_P41                APOLLO5_PINMUX(41,6)
#define NCE41_P41               APOLLO5_PINMUX(41,7)
#define OBSBUS9_P41             APOLLO5_PINMUX(41,8)
#define SWO_P41                 APOLLO5_PINMUX(41,9)
#define RESERVED10_P41          APOLLO5_PINMUX(41,10)
#define FPIO_P41                APOLLO5_PINMUX(41,11)
#define RESERVED12_P41          APOLLO5_PINMUX(41,12)
#define RESERVED13_P41          APOLLO5_PINMUX(41,13)
#define RESERVED14_P41          APOLLO5_PINMUX(41,14)
#define RESERVED15_P41          APOLLO5_PINMUX(41,15)

#define MSPI0_15_P42            APOLLO5_PINMUX(42,0)
#define TRIG2_P42               APOLLO5_PINMUX(42,1)
#define SWTRACE3_P42            APOLLO5_PINMUX(42,2)
#define GPIO_P42                APOLLO5_PINMUX(42,3)
#define UART2TX_P42             APOLLO5_PINMUX(42,4)
#define UART3TX_P42             APOLLO5_PINMUX(42,5)
#define CT42_P42                APOLLO5_PINMUX(42,6)
#define NCE42_P42               APOLLO5_PINMUX(42,7)
#define OBSBUS10_P42            APOLLO5_PINMUX(42,8)
#define RESERVED9_P42           APOLLO5_PINMUX(42,9)
#define RESERVED10_P42          APOLLO5_PINMUX(42,10)
#define FPIO_P42                APOLLO5_PINMUX(42,11)
#define RESERVED12_P42          APOLLO5_PINMUX(42,12)
#define RESERVED13_P42          APOLLO5_PINMUX(42,13)
#define RESERVED14_P42          APOLLO5_PINMUX(42,14)
#define RESERVED15_P42          APOLLO5_PINMUX(42,15)

#define MSPI0_16_P43            APOLLO5_PINMUX(43,0)
#define TRIG3_P43               APOLLO5_PINMUX(43,1)
#define SWTRACECTL_P43          APOLLO5_PINMUX(43,2)
#define GPIO_P43                APOLLO5_PINMUX(43,3)
#define UART0RX_P43             APOLLO5_PINMUX(43,4)
#define UART1RX_P43             APOLLO5_PINMUX(43,5)
#define CT43_P43                APOLLO5_PINMUX(43,6)
#define NCE43_P43               APOLLO5_PINMUX(43,7)
#define OBSBUS11_P43            APOLLO5_PINMUX(43,8)
#define RESERVED9_P43           APOLLO5_PINMUX(43,9)
#define RESERVED10_P43          APOLLO5_PINMUX(43,10)
#define FPIO_P43                APOLLO5_PINMUX(43,11)
#define RESERVED12_P43          APOLLO5_PINMUX(43,12)
#define RESERVED13_P43          APOLLO5_PINMUX(43,13)
#define RESERVED14_P43          APOLLO5_PINMUX(43,14)
#define RESERVED15_P43          APOLLO5_PINMUX(43,15)

#define MSPI0_17_P44            APOLLO5_PINMUX(44,0)
#define TRIG1_P44               APOLLO5_PINMUX(44,1)
#define SWO_P44                 APOLLO5_PINMUX(44,2)
#define GPIO_P44                APOLLO5_PINMUX(44,3)
#define UART2RX_P44             APOLLO5_PINMUX(44,4)
#define UART3RX_P44             APOLLO5_PINMUX(44,5)
#define CT44_P44                APOLLO5_PINMUX(44,6)
#define NCE44_P44               APOLLO5_PINMUX(44,7)
#define OBSBUS12_P44            APOLLO5_PINMUX(44,8)
#define VCMPO_P44               APOLLO5_PINMUX(44,9)
#define RESERVED10_P44          APOLLO5_PINMUX(44,10)
#define FPIO_P44                APOLLO5_PINMUX(44,11)
#define RESERVED12_P44          APOLLO5_PINMUX(44,12)
#define RESERVED13_P44          APOLLO5_PINMUX(44,13)
#define RESERVED14_P44          APOLLO5_PINMUX(44,14)
#define RESERVED15_P44          APOLLO5_PINMUX(44,15)

#define MSPI0_18_P45            APOLLO5_PINMUX(45,0)
#define TRIG2_P45               APOLLO5_PINMUX(45,1)
#define XT32KHz_P45             APOLLO5_PINMUX(45,2)
#define GPIO_P45                APOLLO5_PINMUX(45,3)
#define UART0TX_P45             APOLLO5_PINMUX(45,4)
#define UART1TX_P45             APOLLO5_PINMUX(45,5)
#define CT45_P45                APOLLO5_PINMUX(45,6)
#define NCE45_P45               APOLLO5_PINMUX(45,7)
#define OBSBUS13_P45            APOLLO5_PINMUX(45,8)
#define RESERVED9_P45           APOLLO5_PINMUX(45,9)
#define RESERVED10_P45          APOLLO5_PINMUX(45,10)
#define FPIO_P45                APOLLO5_PINMUX(45,11)
#define RESERVED12_P45          APOLLO5_PINMUX(45,12)
#define RESERVED13_P45          APOLLO5_PINMUX(45,13)
#define RESERVED14_P45          APOLLO5_PINMUX(45,14)
#define RESERVED15_P45          APOLLO5_PINMUX(45,15)

#define RESERVED0_P46           APOLLO5_PINMUX(46,0)
#define TRIG3_P46               APOLLO5_PINMUX(46,1)
#define CLKOUT_32M_P46          APOLLO5_PINMUX(46,2)
#define GPIO_P46                APOLLO5_PINMUX(46,3)
#define UART2TX_P46             APOLLO5_PINMUX(46,4)
#define UART3TX_P46             APOLLO5_PINMUX(46,5)
#define CT46_P46                APOLLO5_PINMUX(46,6)
#define NCE46_P46               APOLLO5_PINMUX(46,7)
#define OBSBUS14_P46            APOLLO5_PINMUX(46,8)
#define RESERVED9_P46           APOLLO5_PINMUX(46,9)
#define RESERVED10_P46          APOLLO5_PINMUX(46,10)
#define FPIO_P46                APOLLO5_PINMUX(46,11)
#define RESERVED12_P46          APOLLO5_PINMUX(46,12)
#define RESERVED13_P46          APOLLO5_PINMUX(46,13)
#define RESERVED14_P46          APOLLO5_PINMUX(46,14)
#define RESERVED15_P46          APOLLO5_PINMUX(46,15)

#define M5SCL_P47               APOLLO5_PINMUX(47,0)
#define M5SCK_P47               APOLLO5_PINMUX(47,1)
#define RESERVED2_P47           APOLLO5_PINMUX(47,2)
#define GPIO_P47                APOLLO5_PINMUX(47,3)
#define UART0RX_P47             APOLLO5_PINMUX(47,4)
#define UART1RX_P47             APOLLO5_PINMUX(47,5)
#define CT47_P47                APOLLO5_PINMUX(47,6)
#define NCE47_P47               APOLLO5_PINMUX(47,7)
#define OBSBUS15_P47            APOLLO5_PINMUX(47,8)
#define RESERVED9_P47           APOLLO5_PINMUX(47,9)
#define I2S0_CLK_P47            APOLLO5_PINMUX(47,10)
#define FPIO_P47                APOLLO5_PINMUX(47,11)
#define RESERVED12_P47          APOLLO5_PINMUX(47,12)
#define RESERVED13_P47          APOLLO5_PINMUX(47,13)
#define RESERVED14_P47          APOLLO5_PINMUX(47,14)
#define RESERVED15_P47          APOLLO5_PINMUX(47,15)

#define M5SDAWIR3_P48           APOLLO5_PINMUX(48,0)
#define M5MOSI_P48              APOLLO5_PINMUX(48,1)
#define RESERVED2_P48           APOLLO5_PINMUX(48,2)
#define GPIO_P48                APOLLO5_PINMUX(48,3)
#define UART2RX_P48             APOLLO5_PINMUX(48,4)
#define UART3RX_P48             APOLLO5_PINMUX(48,5)
#define CT48_P48                APOLLO5_PINMUX(48,6)
#define NCE48_P48               APOLLO5_PINMUX(48,7)
#define OBSBUS0_P48             APOLLO5_PINMUX(48,8)
#define RESERVED9_P48           APOLLO5_PINMUX(48,9)
#define I2S0_WS_P48             APOLLO5_PINMUX(48,10)
#define FPIO_P48                APOLLO5_PINMUX(48,11)
#define RESERVED12_P48          APOLLO5_PINMUX(48,12)
#define RESERVED13_P48          APOLLO5_PINMUX(48,13)
#define RESERVED14_P48          APOLLO5_PINMUX(48,14)
#define RESERVED15_P48          APOLLO5_PINMUX(48,15)

