zephyrproject-rtos/hal_ambiq/dts/apollo510/ambiq-apollo510-pinmux.h
#define M5MISO_P49              APOLLO5_PINMUX(49,0)
#define TRIG0_P49               APOLLO5_PINMUX(49,1)
#define MNCE1_0_P49             APOLLO5_PINMUX(49,2)
#define GPIO_P49                APOLLO5_PINMUX(49,3)
#define UART0RTS_P49            APOLLO5_PINMUX(49,4)
#define UART1RTS_P49            APOLLO5_PINMUX(49,5)
#define CT49_P49                APOLLO5_PINMUX(49,6)
#define NCE49_P49               APOLLO5_PINMUX(49,7)
#define OBSBUS1_P49             APOLLO5_PINMUX(49,8)
#define I2S0_DATA_P49           APOLLO5_PINMUX(49,9)
#define I2S0_SDOUT_P49          APOLLO5_PINMUX(49,10)
#define FPIO_P49                APOLLO5_PINMUX(49,11)
#define MNCE1_1_P49             APOLLO5_PINMUX(49,12)
#define RESERVED13_P49          APOLLO5_PINMUX(49,13)
#define RESERVED14_P49          APOLLO5_PINMUX(49,14)
#define RESERVED15_P49          APOLLO5_PINMUX(49,15)

#define PDM0_CLK_P50            APOLLO5_PINMUX(50,0)
#define TRIG0_P50               APOLLO5_PINMUX(50,1)
#define SWTRACECLK_P50          APOLLO5_PINMUX(50,2)
#define GPIO_P50                APOLLO5_PINMUX(50,3)
#define UART2RTS_P50            APOLLO5_PINMUX(50,4)
#define UART3RTS_P50            APOLLO5_PINMUX(50,5)
#define CT50_P50                APOLLO5_PINMUX(50,6)
#define NCE50_P50               APOLLO5_PINMUX(50,7)
#define OBSBUS2_P50             APOLLO5_PINMUX(50,8)
#define DISP_TE_P50             APOLLO5_PINMUX(50,9)
#define RESERVED10_P50          APOLLO5_PINMUX(50,10)
#define FPIO_P50                APOLLO5_PINMUX(50,11)
#define RESERVED12_P50          APOLLO5_PINMUX(50,12)
#define RESERVED13_P50          APOLLO5_PINMUX(50,13)
#define RESERVED14_P50          APOLLO5_PINMUX(50,14)
#define EN96MHz_P50             APOLLO5_PINMUX(50,15)

#define PDM0_DATA_P51           APOLLO5_PINMUX(51,0)
#define TRIG1_P51               APOLLO5_PINMUX(51,1)
#define SWTRACE0_P51            APOLLO5_PINMUX(51,2)
#define GPIO_P51                APOLLO5_PINMUX(51,3)
#define UART0CTS_P51            APOLLO5_PINMUX(51,4)
#define UART1CTS_P51            APOLLO5_PINMUX(51,5)
#define CT51_P51                APOLLO5_PINMUX(51,6)
#define NCE51_P51               APOLLO5_PINMUX(51,7)
#define OBSBUS3_P51             APOLLO5_PINMUX(51,8)
#define RESERVED9_P51           APOLLO5_PINMUX(51,9)
#define RESERVED10_P51          APOLLO5_PINMUX(51,10)
#define FPIO_P51                APOLLO5_PINMUX(51,11)
#define RESERVED12_P51          APOLLO5_PINMUX(51,12)
#define RESERVED13_P51          APOLLO5_PINMUX(51,13)
#define RESERVED14_P51          APOLLO5_PINMUX(51,14)
#define CLK96MHz_P51            APOLLO5_PINMUX(51,15)

#define MNCE3_0_P52             APOLLO5_PINMUX(52,0)
#define TRIG2_P52               APOLLO5_PINMUX(52,1)
#define SWTRACE1_P52            APOLLO5_PINMUX(52,2)
#define GPIO_P52                APOLLO5_PINMUX(52,3)
#define UART2CTS_P52            APOLLO5_PINMUX(52,4)
#define UART3CTS_P52            APOLLO5_PINMUX(52,5)
#define CT52_P52                APOLLO5_PINMUX(52,6)
#define NCE52_P52               APOLLO5_PINMUX(52,7)
#define OBSBUS4_P52             APOLLO5_PINMUX(52,8)
#define VCMPO_P52               APOLLO5_PINMUX(52,9)
#define I2S0_CLK_P52            APOLLO5_PINMUX(52,10)
#define FPIO_P52                APOLLO5_PINMUX(52,11)
#define SLSDAWIR3_P52           APOLLO5_PINMUX(52,12)
#define SLMOSI_P52              APOLLO5_PINMUX(52,13)
#define RESERVED14_P52          APOLLO5_PINMUX(52,14)
#define RESERVED15_P52          APOLLO5_PINMUX(52,15)

#define MNCE1_0_P53             APOLLO5_PINMUX(53,0)
#define TRIG3_P53               APOLLO5_PINMUX(53,1)
#define SWTRACE2_P53            APOLLO5_PINMUX(53,2)
#define GPIO_P53                APOLLO5_PINMUX(53,3)
#define UART0TX_P53             APOLLO5_PINMUX(53,4)
#define UART1TX_P53             APOLLO5_PINMUX(53,5)
#define CT53_P53                APOLLO5_PINMUX(53,6)
#define NCE53_P53               APOLLO5_PINMUX(53,7)
#define OBSBUS5_P53             APOLLO5_PINMUX(53,8)
#define RESERVED9_P53           APOLLO5_PINMUX(53,9)
#define I2S0_WS_P53             APOLLO5_PINMUX(53,10)
#define FPIO_P53                APOLLO5_PINMUX(53,11)
#define RESERVED12_P53          APOLLO5_PINMUX(53,12)
#define RESERVED13_P53          APOLLO5_PINMUX(53,13)
#define RESERVED14_P53          APOLLO5_PINMUX(53,14)
#define RESERVED15_P53          APOLLO5_PINMUX(53,15)

#define MNCE1_1_P54             APOLLO5_PINMUX(54,0)
#define TRIG0_P54               APOLLO5_PINMUX(54,1)
#define SWTRACE3_P54            APOLLO5_PINMUX(54,2)
#define GPIO_P54                APOLLO5_PINMUX(54,3)
#define UART2TX_P54             APOLLO5_PINMUX(54,4)
#define UART3TX_P54             APOLLO5_PINMUX(54,5)
#define CT54_P54                APOLLO5_PINMUX(54,6)
#define NCE54_P54               APOLLO5_PINMUX(54,7)
#define OBSBUS6_P54             APOLLO5_PINMUX(54,8)
#define I2S0_DATA_P54           APOLLO5_PINMUX(54,9)
#define I2S0_SDOUT_P54          APOLLO5_PINMUX(54,10)
#define FPIO_P54                APOLLO5_PINMUX(54,11)
#define RESERVED12_P54          APOLLO5_PINMUX(54,12)
#define RESERVED13_P54          APOLLO5_PINMUX(54,13)
#define RESERVED14_P54          APOLLO5_PINMUX(54,14)
#define RESERVED15_P54          APOLLO5_PINMUX(54,15)

#define MNCE3_1_P55             APOLLO5_PINMUX(55,0)
#define TRIG1_P55               APOLLO5_PINMUX(55,1)
#define SWTRACECTL_P55          APOLLO5_PINMUX(55,2)
#define GPIO_P55                APOLLO5_PINMUX(55,3)
#define UART0RX_P55             APOLLO5_PINMUX(55,4)
#define UART1RX_P55             APOLLO5_PINMUX(55,5)
#define CT55_P55                APOLLO5_PINMUX(55,6)
#define NCE55_P55               APOLLO5_PINMUX(55,7)
#define OBSBUS7_P55             APOLLO5_PINMUX(55,8)
#define RESERVED9_P55           APOLLO5_PINMUX(55,9)
#define I2S1_CLK_P55            APOLLO5_PINMUX(55,10)
#define FPIO_P55                APOLLO5_PINMUX(55,11)
#define RESERVED12_P55          APOLLO5_PINMUX(55,12)
#define RESERVED13_P55          APOLLO5_PINMUX(55,13)
#define RESERVED14_P55          APOLLO5_PINMUX(55,14)
#define RESERVED15_P55          APOLLO5_PINMUX(55,15)

#define MNCE0_0_P56             APOLLO5_PINMUX(56,0)
#define TRIG2_P56               APOLLO5_PINMUX(56,1)
#define SWO_P56                 APOLLO5_PINMUX(56,2)
#define GPIO_P56                APOLLO5_PINMUX(56,3)
#define UART2RX_P56             APOLLO5_PINMUX(56,4)
#define UART3RX_P56             APOLLO5_PINMUX(56,5)
#define CT56_P56                APOLLO5_PINMUX(56,6)
#define NCE56_P56               APOLLO5_PINMUX(56,7)
#define OBSBUS8_P56             APOLLO5_PINMUX(56,8)
#define VCMPO_P56               APOLLO5_PINMUX(56,9)
#define I2S1_WS_P56             APOLLO5_PINMUX(56,10)
#define FPIO_P56                APOLLO5_PINMUX(56,11)
#define RESERVED12_P56          APOLLO5_PINMUX(56,12)
#define RESERVED13_P56          APOLLO5_PINMUX(56,13)
#define RESERVED14_P56          APOLLO5_PINMUX(56,14)
#define RESERVED15_P56          APOLLO5_PINMUX(56,15)

