zephyrproject-rtos/hal_ambiq/dts/apollo510/ambiq-apollo510-pinmux.h
#define MNCE0_1_P57             APOLLO5_PINMUX(57,0)
#define TRIG3_P57               APOLLO5_PINMUX(57,1)
#define SWO_P57                 APOLLO5_PINMUX(57,2)
#define GPIO_P57                APOLLO5_PINMUX(57,3)
#define UART0RTS_P57            APOLLO5_PINMUX(57,4)
#define UART1RTS_P57            APOLLO5_PINMUX(57,5)
#define CT57_P57                APOLLO5_PINMUX(57,6)
#define NCE57_P57               APOLLO5_PINMUX(57,7)
#define OBSBUS9_P57             APOLLO5_PINMUX(57,8)
#define I2S1_DATA_P57           APOLLO5_PINMUX(57,9)
#define I2S1_SDOUT_P57          APOLLO5_PINMUX(57,10)
#define FPIO_P57                APOLLO5_PINMUX(57,11)
#define RESERVED12_P57          APOLLO5_PINMUX(57,12)
#define RESERVED13_P57          APOLLO5_PINMUX(57,13)
#define RESERVED14_P57          APOLLO5_PINMUX(57,14)
#define RESERVED15_P57          APOLLO5_PINMUX(57,15)

#define RESERVED0_P58           APOLLO5_PINMUX(58,0)
#define RESERVED1_P58           APOLLO5_PINMUX(58,1)
#define RESERVED2_P58           APOLLO5_PINMUX(58,2)
#define GPIO_P58                APOLLO5_PINMUX(58,3)
#define UART0RTS_P58            APOLLO5_PINMUX(58,4)
#define UART3RTS_P58            APOLLO5_PINMUX(58,5)
#define CT58_P58                APOLLO5_PINMUX(58,6)
#define NCE58_P58               APOLLO5_PINMUX(58,7)
#define OBSBUS10_P58            APOLLO5_PINMUX(58,8)
#define RESERVED9_P58           APOLLO5_PINMUX(58,9)
#define RESERVED10_P58          APOLLO5_PINMUX(58,10)
#define FPIO_P58                APOLLO5_PINMUX(58,11)
#define RESERVED12_P58          APOLLO5_PINMUX(58,12)
#define RESERVED13_P58          APOLLO5_PINMUX(58,13)
#define RESERVED14_P58          APOLLO5_PINMUX(58,14)
#define RESERVED15_P58          APOLLO5_PINMUX(58,15)

#define RESERVED0_P59           APOLLO5_PINMUX(59,0)
#define TRIG0_P59               APOLLO5_PINMUX(59,1)
#define RESERVED2_P59           APOLLO5_PINMUX(59,2)
#define GPIO_P59                APOLLO5_PINMUX(59,3)
#define UART0CTS_P59            APOLLO5_PINMUX(59,4)
#define UART1CTS_P59            APOLLO5_PINMUX(59,5)
#define CT59_P59                APOLLO5_PINMUX(59,6)
#define NCE59_P59               APOLLO5_PINMUX(59,7)
#define OBSBUS11_P59            APOLLO5_PINMUX(59,8)
#define RESERVED9_P59           APOLLO5_PINMUX(59,9)
#define RESERVED10_P59          APOLLO5_PINMUX(59,10)
#define FPIO_P59                APOLLO5_PINMUX(59,11)
#define RESERVED12_P59          APOLLO5_PINMUX(59,12)
#define RESERVED13_P59          APOLLO5_PINMUX(59,13)
#define RESERVED14_P59          APOLLO5_PINMUX(59,14)
#define RESERVED15_P59          APOLLO5_PINMUX(59,15)

#define RESERVED0_P60           APOLLO5_PINMUX(60,0)
#define TRIG1_P60               APOLLO5_PINMUX(60,1)
#define RESERVED2_P60           APOLLO5_PINMUX(60,2)
#define GPIO_P60                APOLLO5_PINMUX(60,3)
#define UART0TX_P60             APOLLO5_PINMUX(60,4)
#define UART3CTS_P60            APOLLO5_PINMUX(60,5)
#define CT60_P60                APOLLO5_PINMUX(60,6)
#define NCE60_P60               APOLLO5_PINMUX(60,7)
#define OBSBUS12_P60            APOLLO5_PINMUX(60,8)
#define RESERVED9_P60           APOLLO5_PINMUX(60,9)
#define RESERVED10_P60          APOLLO5_PINMUX(60,10)
#define FPIO_P60                APOLLO5_PINMUX(60,11)
#define RESERVED12_P60          APOLLO5_PINMUX(60,12)
#define RESERVED13_P60          APOLLO5_PINMUX(60,13)
#define RESERVED14_P60          APOLLO5_PINMUX(60,14)
#define RESERVED15_P60          APOLLO5_PINMUX(60,15)

#define M6SCL_P61               APOLLO5_PINMUX(61,0)
#define M6SCK_P61               APOLLO5_PINMUX(61,1)
#define I2S1_CLK_P61            APOLLO5_PINMUX(61,2)
#define GPIO_P61                APOLLO5_PINMUX(61,3)
#define UART2TX_P61             APOLLO5_PINMUX(61,4)
#define UART3TX_P61             APOLLO5_PINMUX(61,5)
#define CT61_P61                APOLLO5_PINMUX(61,6)
#define NCE61_P61               APOLLO5_PINMUX(61,7)
#define OBSBUS13_P61            APOLLO5_PINMUX(61,8)
#define RESERVED9_P61           APOLLO5_PINMUX(61,9)
#define RESERVED10_P61          APOLLO5_PINMUX(61,10)
#define FPIO_P61                APOLLO5_PINMUX(61,11)
#define RESERVED12_P61          APOLLO5_PINMUX(61,12)
#define RESERVED13_P61          APOLLO5_PINMUX(61,13)
#define RESERVED14_P61          APOLLO5_PINMUX(61,14)
#define RESERVED15_P61          APOLLO5_PINMUX(61,15)

#define M6SDAWIR3_P62           APOLLO5_PINMUX(62,0)
#define M6MOSI_P62              APOLLO5_PINMUX(62,1)
#define I2S1_DATA_P62           APOLLO5_PINMUX(62,2)
#define GPIO_P62                APOLLO5_PINMUX(62,3)
#define UART0RX_P62             APOLLO5_PINMUX(62,4)
#define UART1RX_P62             APOLLO5_PINMUX(62,5)
#define CT62_P62                APOLLO5_PINMUX(62,6)
#define NCE62_P62               APOLLO5_PINMUX(62,7)
#define OBSBUS14_P62            APOLLO5_PINMUX(62,8)
#define I2S1_SDOUT_P62          APOLLO5_PINMUX(62,9)
#define RESERVED10_P62          APOLLO5_PINMUX(62,10)
#define FPIO_P62                APOLLO5_PINMUX(62,11)
#define RESERVED12_P62          APOLLO5_PINMUX(62,12)
#define RESERVED13_P62          APOLLO5_PINMUX(62,13)
#define RESERVED14_P62          APOLLO5_PINMUX(62,14)
#define RESERVED15_P62          APOLLO5_PINMUX(62,15)

#define M6MISO_P63              APOLLO5_PINMUX(63,0)
#define CLKOUT_P63              APOLLO5_PINMUX(63,1)
#define I2S1_WS_P63             APOLLO5_PINMUX(63,2)
#define GPIO_P63                APOLLO5_PINMUX(63,3)
#define UART2RX_P63             APOLLO5_PINMUX(63,4)
#define UART3RX_P63             APOLLO5_PINMUX(63,5)
#define CT63_P63                APOLLO5_PINMUX(63,6)
#define NCE63_P63               APOLLO5_PINMUX(63,7)
#define OBSBUS15_P63            APOLLO5_PINMUX(63,8)
#define DISP_TE_P63             APOLLO5_PINMUX(63,9)
#define MNCE2_0_P63             APOLLO5_PINMUX(63,10)
#define FPIO_P63                APOLLO5_PINMUX(63,11)
#define MNCE2_1_P63             APOLLO5_PINMUX(63,12)
#define RESERVED13_P63          APOLLO5_PINMUX(63,13)
#define RESERVED14_P63          APOLLO5_PINMUX(63,14)
#define RESERVED15_P63          APOLLO5_PINMUX(63,15)

#define MSPI0_0_P64             APOLLO5_PINMUX(64,0)
#define XT32KHz_P64             APOLLO5_PINMUX(64,1)
#define SWO_P64                 APOLLO5_PINMUX(64,2)
#define GPIO_P64                APOLLO5_PINMUX(64,3)
#define UART0RTS_P64            APOLLO5_PINMUX(64,4)
#define UART2CTS_P64            APOLLO5_PINMUX(64,5)
#define CT64_P64                APOLLO5_PINMUX(64,6)
#define NCE64_P64               APOLLO5_PINMUX(64,7)
#define OBSBUS0_P64             APOLLO5_PINMUX(64,8)
#define I2S1_SDIN_P64           APOLLO5_PINMUX(64,9)
#define RESERVED10_P64          APOLLO5_PINMUX(64,10)
#define FPIO_P64                APOLLO5_PINMUX(64,11)
#define RESERVED12_P64          APOLLO5_PINMUX(64,12)
#define RESERVED13_P64          APOLLO5_PINMUX(64,13)
#define RESERVED14_P64          APOLLO5_PINMUX(64,14)
#define RESERVED15_P64          APOLLO5_PINMUX(64,15)

#define MSPI0_1_P65             APOLLO5_PINMUX(65,0)
#define XT32KHz_P65             APOLLO5_PINMUX(65,1)
#define SWO_P65                 APOLLO5_PINMUX(65,2)
#define GPIO_P65                APOLLO5_PINMUX(65,3)
#define UART0CTS_P65            APOLLO5_PINMUX(65,4)
#define UART1CTS_P65            APOLLO5_PINMUX(65,5)
#define CT65_P65                APOLLO5_PINMUX(65,6)
#define NCE65_P65               APOLLO5_PINMUX(65,7)
#define OBSBUS1_P65             APOLLO5_PINMUX(65,8)
#define RESERVED9_P65           APOLLO5_PINMUX(65,9)
#define RESERVED10_P65          APOLLO5_PINMUX(65,10)
#define FPIO_P65                APOLLO5_PINMUX(65,11)
#define RESERVED12_P65          APOLLO5_PINMUX(65,12)
#define RESERVED13_P65          APOLLO5_PINMUX(65,13)
#define RESERVED14_P65          APOLLO5_PINMUX(65,14)
#define RESERVED15_P65          APOLLO5_PINMUX(65,15)

#define MSPI0_2_P66             APOLLO5_PINMUX(66,0)
#define CLKOUT_P66              APOLLO5_PINMUX(66,1)
#define SWO_P66                 APOLLO5_PINMUX(66,2)
#define GPIO_P66                APOLLO5_PINMUX(66,3)
#define UART0TX_P66             APOLLO5_PINMUX(66,4)
#define UART1TX_P66             APOLLO5_PINMUX(66,5)
#define CT66_P66                APOLLO5_PINMUX(66,6)
#define NCE66_P66               APOLLO5_PINMUX(66,7)
#define OBSBUS2_P66             APOLLO5_PINMUX(66,8)
#define RESERVED9_P66           APOLLO5_PINMUX(66,9)
#define RESERVED10_P66          APOLLO5_PINMUX(66,10)
#define FPIO_P66                APOLLO5_PINMUX(66,11)
#define RESERVED12_P66          APOLLO5_PINMUX(66,12)
#define RESERVED13_P66          APOLLO5_PINMUX(66,13)
#define RESERVED14_P66          APOLLO5_PINMUX(66,14)
#define RESERVED15_P66          APOLLO5_PINMUX(66,15)

