zephyrproject-rtos/hal_ambiq/dts/apollo510/ambiq-apollo510-pinmux.h
#define MSPI2_9_P83             APOLLO5_PINMUX(83,0)
#define XT32KHz_P83             APOLLO5_PINMUX(83,1)
#define DISP_QSPI_D3_P83        APOLLO5_PINMUX(83,2)
#define GPIO_P83                APOLLO5_PINMUX(83,3)
#define SWTRACE3_P83            APOLLO5_PINMUX(83,4)
#define UART3RTS_P83            APOLLO5_PINMUX(83,5)
#define CT83_P83                APOLLO5_PINMUX(83,6)
#define NCE83_P83               APOLLO5_PINMUX(83,7)
#define OBSBUS3_P83             APOLLO5_PINMUX(83,8)
#define DISP_SPI_RST_P83        APOLLO5_PINMUX(83,9)
#define SLMISO_P83              APOLLO5_PINMUX(83,10)
#define FPIO_P83                APOLLO5_PINMUX(83,11)
#define RESERVED12_P83          APOLLO5_PINMUX(83,12)
#define RESERVED13_P83          APOLLO5_PINMUX(83,13)
#define RESERVED14_P83          APOLLO5_PINMUX(83,14)
#define RESERVED15_P83          APOLLO5_PINMUX(83,15)

#define RESERVED0_P84           APOLLO5_PINMUX(84,0)
#define RESERVED1_P84           APOLLO5_PINMUX(84,1)
#define SDIF0_DAT0_P84          APOLLO5_PINMUX(84,2)
#define GPIO_P84                APOLLO5_PINMUX(84,3)
#define RESERVED4_P84           APOLLO5_PINMUX(84,4)
#define RESERVED5_P84           APOLLO5_PINMUX(84,5)
#define CT84_P84                APOLLO5_PINMUX(84,6)
#define NCE84_P84               APOLLO5_PINMUX(84,7)
#define OBSBUS4_P84             APOLLO5_PINMUX(84,8)
#define RESERVED9_P84           APOLLO5_PINMUX(84,9)
#define RESERVED10_P84          APOLLO5_PINMUX(84,10)
#define FPIO_P84                APOLLO5_PINMUX(84,11)
#define RESERVED12_P84          APOLLO5_PINMUX(84,12)
#define RESERVED13_P84          APOLLO5_PINMUX(84,13)
#define RESERVED14_P84          APOLLO5_PINMUX(84,14)
#define RESERVED15_P84          APOLLO5_PINMUX(84,15)

#define RESERVED0_P85           APOLLO5_PINMUX(85,0)
#define RESERVED1_P85           APOLLO5_PINMUX(85,1)
#define SDIF0_DAT1_P85          APOLLO5_PINMUX(85,2)
#define GPIO_P85                APOLLO5_PINMUX(85,3)
#define RESERVED4_P85           APOLLO5_PINMUX(85,4)
#define RESERVED5_P85           APOLLO5_PINMUX(85,5)
#define CT85_P85                APOLLO5_PINMUX(85,6)
#define NCE85_P85               APOLLO5_PINMUX(85,7)
#define OBSBUS5_P85             APOLLO5_PINMUX(85,8)
#define RESERVED9_P85           APOLLO5_PINMUX(85,9)
#define RESERVED10_P85          APOLLO5_PINMUX(85,10)
#define FPIO_P85                APOLLO5_PINMUX(85,11)
#define RESERVED12_P85          APOLLO5_PINMUX(85,12)
#define RESERVED13_P85          APOLLO5_PINMUX(85,13)
#define RESERVED14_P85          APOLLO5_PINMUX(85,14)
#define RESERVED15_P85          APOLLO5_PINMUX(85,15)

#define RESERVED0_P86           APOLLO5_PINMUX(86,0)
#define RESERVED1_P86           APOLLO5_PINMUX(86,1)
#define SDIF0_DAT2_P86          APOLLO5_PINMUX(86,2)
#define GPIO_P86                APOLLO5_PINMUX(86,3)
#define RESERVED4_P86           APOLLO5_PINMUX(86,4)
#define RESERVED5_P86           APOLLO5_PINMUX(86,5)
#define CT86_P86                APOLLO5_PINMUX(86,6)
#define NCE86_P86               APOLLO5_PINMUX(86,7)
#define OBSBUS6_P86             APOLLO5_PINMUX(86,8)
#define RESERVED9_P86           APOLLO5_PINMUX(86,9)
#define RESERVED10_P86          APOLLO5_PINMUX(86,10)
#define FPIO_P86                APOLLO5_PINMUX(86,11)
#define RESERVED12_P86          APOLLO5_PINMUX(86,12)
#define RESERVED13_P86          APOLLO5_PINMUX(86,13)
#define RESERVED14_P86          APOLLO5_PINMUX(86,14)
#define RESERVED15_P86          APOLLO5_PINMUX(86,15)

#define RESERVED0_P87           APOLLO5_PINMUX(87,0)
#define RESERVED1_P87           APOLLO5_PINMUX(87,1)
#define SDIF0_DAT3_P87          APOLLO5_PINMUX(87,2)
#define GPIO_P87                APOLLO5_PINMUX(87,3)
#define RESERVED4_P87           APOLLO5_PINMUX(87,4)
#define RESERVED5_P87           APOLLO5_PINMUX(87,5)
#define CT87_P87                APOLLO5_PINMUX(87,6)
#define NCE87_P87               APOLLO5_PINMUX(87,7)
#define OBSBUS7_P87             APOLLO5_PINMUX(87,8)
#define DISP_TE_P87             APOLLO5_PINMUX(87,9)
#define RESERVED10_P87          APOLLO5_PINMUX(87,10)
#define FPIO_P87                APOLLO5_PINMUX(87,11)
#define RESERVED12_P87          APOLLO5_PINMUX(87,12)
#define RESERVED13_P87          APOLLO5_PINMUX(87,13)
#define RESERVED14_P87          APOLLO5_PINMUX(87,14)
#define RESERVED15_P87          APOLLO5_PINMUX(87,15)

#define RESERVED0_P88           APOLLO5_PINMUX(88,0)
#define RESERVED1_P88           APOLLO5_PINMUX(88,1)
#define SDIF0_CLKOUT_P88        APOLLO5_PINMUX(88,2)
#define GPIO_P88                APOLLO5_PINMUX(88,3)
#define RESERVED4_P88           APOLLO5_PINMUX(88,4)
#define RESERVED5_P88           APOLLO5_PINMUX(88,5)
#define CT88_P88                APOLLO5_PINMUX(88,6)
#define NCE88_P88               APOLLO5_PINMUX(88,7)
#define OBSBUS8_P88             APOLLO5_PINMUX(88,8)
#define RESERVED9_P88           APOLLO5_PINMUX(88,9)
#define RESERVED10_P88          APOLLO5_PINMUX(88,10)
#define FPIO_P88                APOLLO5_PINMUX(88,11)
#define RESERVED12_P88          APOLLO5_PINMUX(88,12)
#define RESERVED13_P88          APOLLO5_PINMUX(88,13)
#define RESERVED14_P88          APOLLO5_PINMUX(88,14)
#define RESERVED15_P88          APOLLO5_PINMUX(88,15)

#define RESERVED0_P89           APOLLO5_PINMUX(89,0)
#define RESERVED1_P89           APOLLO5_PINMUX(89,1)
#define RESERVED2_P89           APOLLO5_PINMUX(89,2)
#define GPIO_P89                APOLLO5_PINMUX(89,3)
#define RESERVED4_P89           APOLLO5_PINMUX(89,4)
#define RESERVED5_P89           APOLLO5_PINMUX(89,5)
#define CT89_P89                APOLLO5_PINMUX(89,6)
#define NCE89_P89               APOLLO5_PINMUX(89,7)
#define OBSBUS9_P89             APOLLO5_PINMUX(89,8)
#define DISP_SPI_RST_P89        APOLLO5_PINMUX(89,9)
#define RESERVED10_P89          APOLLO5_PINMUX(89,10)
#define FPIO_P89                APOLLO5_PINMUX(89,11)
#define RESERVED12_P89          APOLLO5_PINMUX(89,12)
#define RESERVED13_P89          APOLLO5_PINMUX(89,13)
#define RESERVED14_P89          APOLLO5_PINMUX(89,14)
#define RESERVED15_P89          APOLLO5_PINMUX(89,15)

#define RESERVED0_P90           APOLLO5_PINMUX(90,0)
#define RESERVED1_P90           APOLLO5_PINMUX(90,1)
#define RESERVED2_P90           APOLLO5_PINMUX(90,2)
#define GPIO_P90                APOLLO5_PINMUX(90,3)
#define RESERVED4_P90           APOLLO5_PINMUX(90,4)
#define RESERVED5_P90           APOLLO5_PINMUX(90,5)
#define CT90_P90                APOLLO5_PINMUX(90,6)
#define NCE90_P90               APOLLO5_PINMUX(90,7)
#define OBSBUS10_P90            APOLLO5_PINMUX(90,8)
#define VCMPO_P90               APOLLO5_PINMUX(90,9)
#define RESERVED10_P90          APOLLO5_PINMUX(90,10)
#define FPIO_P90                APOLLO5_PINMUX(90,11)
#define RESERVED12_P90          APOLLO5_PINMUX(90,12)
#define RESERVED13_P90          APOLLO5_PINMUX(90,13)
#define RESERVED14_P90          APOLLO5_PINMUX(90,14)
#define RESERVED15_P90          APOLLO5_PINMUX(90,15)

#define RESERVED0_P91           APOLLO5_PINMUX(91,0)
#define RESERVED1_P91           APOLLO5_PINMUX(91,1)
#define RESERVED2_P91           APOLLO5_PINMUX(91,2)
#define GPIO_P91                APOLLO5_PINMUX(91,3)
#define RESERVED4_P91           APOLLO5_PINMUX(91,4)
#define RESERVED5_P91           APOLLO5_PINMUX(91,5)
#define CT91_P91                APOLLO5_PINMUX(91,6)
#define NCE91_P91               APOLLO5_PINMUX(91,7)
#define OBSBUS11_P91            APOLLO5_PINMUX(91,8)
#define VCMPO_P91               APOLLO5_PINMUX(91,9)
#define RESERVED10_P91          APOLLO5_PINMUX(91,10)
#define FPIO_P91                APOLLO5_PINMUX(91,11)
#define RESERVED12_P91          APOLLO5_PINMUX(91,12)
#define RESERVED13_P91          APOLLO5_PINMUX(91,13)
#define RESERVED14_P91          APOLLO5_PINMUX(91,14)
#define RESERVED15_P91          APOLLO5_PINMUX(91,15)

