zephyrproject-rtos/hal_ambiq/dts/apollo510/ambiq-apollo510-pinmux.h
#define RESERVED0_P92           APOLLO5_PINMUX(92,0)
#define RESERVED1_P92           APOLLO5_PINMUX(92,1)
#define RESERVED2_P92           APOLLO5_PINMUX(92,2)
#define GPIO_P92                APOLLO5_PINMUX(92,3)
#define RESERVED4_P92           APOLLO5_PINMUX(92,4)
#define RESERVED5_P92           APOLLO5_PINMUX(92,5)
#define CT92_P92                APOLLO5_PINMUX(92,6)
#define NCE92_P92               APOLLO5_PINMUX(92,7)
#define OBSBUS12_P92            APOLLO5_PINMUX(92,8)
#define VCMPO_P92               APOLLO5_PINMUX(92,9)
#define RESERVED10_P92          APOLLO5_PINMUX(92,10)
#define FPIO_P92                APOLLO5_PINMUX(92,11)
#define RESERVED12_P92          APOLLO5_PINMUX(92,12)
#define RESERVED13_P92          APOLLO5_PINMUX(92,13)
#define RESERVED14_P92          APOLLO5_PINMUX(92,14)
#define RESERVED15_P92          APOLLO5_PINMUX(92,15)

#define MNCE1_0_P93             APOLLO5_PINMUX(93,0)
#define RESERVED1_P93           APOLLO5_PINMUX(93,1)
#define RESERVED2_P93           APOLLO5_PINMUX(93,2)
#define GPIO_P93                APOLLO5_PINMUX(93,3)
#define RESERVED4_P93           APOLLO5_PINMUX(93,4)
#define RESERVED5_P93           APOLLO5_PINMUX(93,5)
#define CT93_P93                APOLLO5_PINMUX(93,6)
#define NCE93_P93               APOLLO5_PINMUX(93,7)
#define OBSBUS13_P93            APOLLO5_PINMUX(93,8)
#define VCMPO_P93               APOLLO5_PINMUX(93,9)
#define RESERVED10_P93          APOLLO5_PINMUX(93,10)
#define FPIO_P93                APOLLO5_PINMUX(93,11)
#define RESERVED12_P93          APOLLO5_PINMUX(93,12)
#define RESERVED13_P93          APOLLO5_PINMUX(93,13)
#define RESERVED14_P93          APOLLO5_PINMUX(93,14)
#define RESERVED15_P93          APOLLO5_PINMUX(93,15)

#define RESERVED0_P94           APOLLO5_PINMUX(94,0)
#define RESERVED1_P94           APOLLO5_PINMUX(94,1)
#define RESERVED2_P94           APOLLO5_PINMUX(94,2)
#define GPIO_P94                APOLLO5_PINMUX(94,3)
#define RESERVED4_P94           APOLLO5_PINMUX(94,4)
#define RESERVED5_P94           APOLLO5_PINMUX(94,5)
#define CT94_P94                APOLLO5_PINMUX(94,6)
#define NCE94_P94               APOLLO5_PINMUX(94,7)
#define OBSBUS14_P94            APOLLO5_PINMUX(94,8)
#define VCMPO_P94               APOLLO5_PINMUX(94,9)
#define RESERVED10_P94          APOLLO5_PINMUX(94,10)
#define FPIO_P94                APOLLO5_PINMUX(94,11)
#define RESERVED12_P94          APOLLO5_PINMUX(94,12)
#define RESERVED13_P94          APOLLO5_PINMUX(94,13)
#define RESERVED14_P94          APOLLO5_PINMUX(94,14)
#define RESERVED15_P94          APOLLO5_PINMUX(94,15)

#define MSPI1_0_P95             APOLLO5_PINMUX(95,0)
#define RESERVED1_P95           APOLLO5_PINMUX(95,1)
#define RESERVED2_P95           APOLLO5_PINMUX(95,2)
#define GPIO_P95                APOLLO5_PINMUX(95,3)
#define RESERVED4_P95           APOLLO5_PINMUX(95,4)
#define RESERVED5_P95           APOLLO5_PINMUX(95,5)
#define CT95_P95                APOLLO5_PINMUX(95,6)
#define NCE95_P95               APOLLO5_PINMUX(95,7)
#define OBSBUS15_P95            APOLLO5_PINMUX(95,8)
#define I2S0_SDIN_P95           APOLLO5_PINMUX(95,9)
#define RESERVED10_P95          APOLLO5_PINMUX(95,10)
#define FPIO_P95                APOLLO5_PINMUX(95,11)
#define RESERVED12_P95          APOLLO5_PINMUX(95,12)
#define RESERVED13_P95          APOLLO5_PINMUX(95,13)
#define RESERVED14_P95          APOLLO5_PINMUX(95,14)
#define RESERVED15_P95          APOLLO5_PINMUX(95,15)

#define MSPI1_1_P96             APOLLO5_PINMUX(96,0)
#define RESERVED1_P96           APOLLO5_PINMUX(96,1)
#define RESERVED2_P96           APOLLO5_PINMUX(96,2)
#define GPIO_P96                APOLLO5_PINMUX(96,3)
#define RESERVED4_P96           APOLLO5_PINMUX(96,4)
#define RESERVED5_P96           APOLLO5_PINMUX(96,5)
#define CT96_P96                APOLLO5_PINMUX(96,6)
#define NCE96_P96               APOLLO5_PINMUX(96,7)
#define OBSBUS0_P96             APOLLO5_PINMUX(96,8)
#define RESERVED9_P96           APOLLO5_PINMUX(96,9)
#define RESERVED10_P96          APOLLO5_PINMUX(96,10)
#define FPIO_P96                APOLLO5_PINMUX(96,11)
#define RESERVED12_P96          APOLLO5_PINMUX(96,12)
#define RESERVED13_P96          APOLLO5_PINMUX(96,13)
#define RESERVED14_P96          APOLLO5_PINMUX(96,14)
#define RESERVED15_P96          APOLLO5_PINMUX(96,15)

#define MSPI1_2_P97             APOLLO5_PINMUX(97,0)
#define RESERVED1_P97           APOLLO5_PINMUX(97,1)
#define RESERVED2_P97           APOLLO5_PINMUX(97,2)
#define GPIO_P97                APOLLO5_PINMUX(97,3)
#define RESERVED4_P97           APOLLO5_PINMUX(97,4)
#define RESERVED5_P97           APOLLO5_PINMUX(97,5)
#define CT97_P97                APOLLO5_PINMUX(97,6)
#define NCE97_P97               APOLLO5_PINMUX(97,7)
#define OBSBUS1_P97             APOLLO5_PINMUX(97,8)
#define RESERVED9_P97           APOLLO5_PINMUX(97,9)
#define RESERVED10_P97          APOLLO5_PINMUX(97,10)
#define FPIO_P97                APOLLO5_PINMUX(97,11)
#define RESERVED12_P97          APOLLO5_PINMUX(97,12)
#define RESERVED13_P97          APOLLO5_PINMUX(97,13)
#define RESERVED14_P97          APOLLO5_PINMUX(97,14)
#define RESERVED15_P97          APOLLO5_PINMUX(97,15)

#define MSPI1_3_P98             APOLLO5_PINMUX(98,0)
#define RESERVED1_P98           APOLLO5_PINMUX(98,1)
#define RESERVED2_P98           APOLLO5_PINMUX(98,2)
#define GPIO_P98                APOLLO5_PINMUX(98,3)
#define RESERVED4_P98           APOLLO5_PINMUX(98,4)
#define RESERVED5_P98           APOLLO5_PINMUX(98,5)
#define CT98_P98                APOLLO5_PINMUX(98,6)
#define NCE98_P98               APOLLO5_PINMUX(98,7)
#define OBSBUS2_P98             APOLLO5_PINMUX(98,8)
#define RESERVED9_P98           APOLLO5_PINMUX(98,9)
#define RESERVED10_P98          APOLLO5_PINMUX(98,10)
#define FPIO_P98                APOLLO5_PINMUX(98,11)
#define RESERVED12_P98          APOLLO5_PINMUX(98,12)
#define RESERVED13_P98          APOLLO5_PINMUX(98,13)
#define RESERVED14_P98          APOLLO5_PINMUX(98,14)
#define RESERVED15_P98          APOLLO5_PINMUX(98,15)

#define MSPI1_4_P99             APOLLO5_PINMUX(99,0)
#define RESERVED1_P99           APOLLO5_PINMUX(99,1)
#define RESERVED2_P99           APOLLO5_PINMUX(99,2)
#define GPIO_P99                APOLLO5_PINMUX(99,3)
#define RESERVED4_P99           APOLLO5_PINMUX(99,4)
#define RESERVED5_P99           APOLLO5_PINMUX(99,5)
#define CT99_P99                APOLLO5_PINMUX(99,6)
#define NCE99_P99               APOLLO5_PINMUX(99,7)
#define OBSBUS3_P99             APOLLO5_PINMUX(99,8)
#define RESERVED9_P99           APOLLO5_PINMUX(99,9)
#define RESERVED10_P99          APOLLO5_PINMUX(99,10)
#define FPIO_P99                APOLLO5_PINMUX(99,11)
#define RESERVED12_P99          APOLLO5_PINMUX(99,12)
#define RESERVED13_P99          APOLLO5_PINMUX(99,13)
#define RESERVED14_P99          APOLLO5_PINMUX(99,14)
#define RESERVED15_P99          APOLLO5_PINMUX(99,15)

#define MSPI1_5_P100            APOLLO5_PINMUX(100,0)
#define DISP_QSPI_D0_OUT_P100   APOLLO5_PINMUX(100,1)
#define DISP_QSPI_D0_P100       APOLLO5_PINMUX(100,2)
#define GPIO_P100               APOLLO5_PINMUX(100,3)
#define DISP_SPI_SD_P100        APOLLO5_PINMUX(100,4)
#define DISP_SPI_SDO_P100       APOLLO5_PINMUX(100,5)
#define CT100_P100              APOLLO5_PINMUX(100,6)
#define NCE100_P100             APOLLO5_PINMUX(100,7)
#define OBSBUS4_P100            APOLLO5_PINMUX(100,8)
#define I2S0_CLK_P100           APOLLO5_PINMUX(100,9)
#define RESERVED10_P100         APOLLO5_PINMUX(100,10)
#define FPIO_P100               APOLLO5_PINMUX(100,11)
#define RESERVED12_P100         APOLLO5_PINMUX(100,12)
#define RESERVED13_P100         APOLLO5_PINMUX(100,13)
#define RESERVED14_P100         APOLLO5_PINMUX(100,14)
#define RESERVED15_P100         APOLLO5_PINMUX(100,15)

#define MSPI1_6_P101            APOLLO5_PINMUX(101,0)
#define RESERVED1_P101          APOLLO5_PINMUX(101,1)
#define DISP_QSPI_D1_P101       APOLLO5_PINMUX(101,2)
#define GPIO_P101               APOLLO5_PINMUX(101,3)
#define DISP_SPI_DCX_P101       APOLLO5_PINMUX(101,4)
#define RESERVED5_P101          APOLLO5_PINMUX(101,5)
#define CT101_P101              APOLLO5_PINMUX(101,6)
#define NCE101_P101             APOLLO5_PINMUX(101,7)
#define OBSBUS5_P101            APOLLO5_PINMUX(101,8)
#define I2S0_DATA_P101          APOLLO5_PINMUX(101,9)
#define I2S0_SDOUT_P101         APOLLO5_PINMUX(101,10)
#define FPIO_P101               APOLLO5_PINMUX(101,11)
#define RESERVED12_P101         APOLLO5_PINMUX(101,12)
#define RESERVED13_P101         APOLLO5_PINMUX(101,13)
#define RESERVED14_P101         APOLLO5_PINMUX(101,14)
#define RESERVED15_P101         APOLLO5_PINMUX(101,15)

#define MSPI1_7_P102            APOLLO5_PINMUX(102,0)
#define RESERVED1_P102          APOLLO5_PINMUX(102,1)
#define DISP_QSPI_SCK_P102      APOLLO5_PINMUX(102,2)
#define GPIO_P102               APOLLO5_PINMUX(102,3)
#define DISP_SPI_SCK_P102       APOLLO5_PINMUX(102,4)
#define RESERVED5_P102          APOLLO5_PINMUX(102,5)
#define CT102_P102              APOLLO5_PINMUX(102,6)
#define NCE102_P102             APOLLO5_PINMUX(102,7)
#define OBSBUS6_P102            APOLLO5_PINMUX(102,8)
#define I2S0_WS_P102            APOLLO5_PINMUX(102,9)
#define RESERVED10_P102         APOLLO5_PINMUX(102,10)
#define FPIO_P102               APOLLO5_PINMUX(102,11)
#define RESERVED12_P102         APOLLO5_PINMUX(102,12)
#define RESERVED13_P102         APOLLO5_PINMUX(102,13)
#define RESERVED14_P102         APOLLO5_PINMUX(102,14)
#define RESERVED15_P102         APOLLO5_PINMUX(102,15)

