zephyrproject-rtos/hal_ambiq/dts/apollo510/ambiq-apollo510-pinmux.h
#define MSPI1_8_P103            APOLLO5_PINMUX(103,0)
#define RESERVED1_P103          APOLLO5_PINMUX(103,1)
#define DISP_QSPI_D2_P103       APOLLO5_PINMUX(103,2)
#define GPIO_P103               APOLLO5_PINMUX(103,3)
#define DISP_SPI_SDI_P103       APOLLO5_PINMUX(103,4)
#define RESERVED5_P103          APOLLO5_PINMUX(103,5)
#define CT103_P103              APOLLO5_PINMUX(103,6)
#define NCE103_P103             APOLLO5_PINMUX(103,7)
#define OBSBUS7_P103            APOLLO5_PINMUX(103,8)
#define RESERVED9_P103          APOLLO5_PINMUX(103,9)
#define RESERVED10_P103         APOLLO5_PINMUX(103,10)
#define FPIO_P103               APOLLO5_PINMUX(103,11)
#define RESERVED12_P103         APOLLO5_PINMUX(103,12)
#define RESERVED13_P103         APOLLO5_PINMUX(103,13)
#define RESERVED14_P103         APOLLO5_PINMUX(103,14)
#define RESERVED15_P103         APOLLO5_PINMUX(103,15)

#define MSPI1_9_P104            APOLLO5_PINMUX(104,0)
#define RESERVED1_P104          APOLLO5_PINMUX(104,1)
#define DISP_QSPI_D3_P104       APOLLO5_PINMUX(104,2)
#define GPIO_P104               APOLLO5_PINMUX(104,3)
#define DISP_SPI_RST_P104       APOLLO5_PINMUX(104,4)
#define RESERVED5_P104          APOLLO5_PINMUX(104,5)
#define CT104_P104              APOLLO5_PINMUX(104,6)
#define NCE104_P104             APOLLO5_PINMUX(104,7)
#define OBSBUS8_P104            APOLLO5_PINMUX(104,8)
#define RESERVED9_P104          APOLLO5_PINMUX(104,9)
#define RESERVED10_P104         APOLLO5_PINMUX(104,10)
#define FPIO_P104               APOLLO5_PINMUX(104,11)
#define RESERVED12_P104         APOLLO5_PINMUX(104,12)
#define RESERVED13_P104         APOLLO5_PINMUX(104,13)
#define RESERVED14_P104         APOLLO5_PINMUX(104,14)
#define RESERVED15_P104         APOLLO5_PINMUX(104,15)

#define MSPI3_10_P105           APOLLO5_PINMUX(105,0)
#define RESERVED1_P105          APOLLO5_PINMUX(105,1)
#define RESERVED2_P105          APOLLO5_PINMUX(105,2)
#define GPIO_P105               APOLLO5_PINMUX(105,3)
#define RESERVED4_P105          APOLLO5_PINMUX(105,4)
#define RESERVED5_P105          APOLLO5_PINMUX(105,5)
#define CT105_P105              APOLLO5_PINMUX(105,6)
#define NCE105_P105             APOLLO5_PINMUX(105,7)
#define RESERVED8_P105          APOLLO5_PINMUX(105,8)
#define RESERVED9_P105          APOLLO5_PINMUX(105,9)
#define RESERVED10_P105         APOLLO5_PINMUX(105,10)
#define FPIO_P105               APOLLO5_PINMUX(105,11)
#define RESERVED12_P105         APOLLO5_PINMUX(105,12)
#define RESERVED13_P105         APOLLO5_PINMUX(105,13)
#define RESERVED14_P105         APOLLO5_PINMUX(105,14)
#define RESERVED15_P105         APOLLO5_PINMUX(105,15)

#define MSPI3_11_P106           APOLLO5_PINMUX(106,0)
#define RESERVED1_P106          APOLLO5_PINMUX(106,1)
#define RESERVED2_P106          APOLLO5_PINMUX(106,2)
#define GPIO_P106               APOLLO5_PINMUX(106,3)
#define RESERVED4_P106          APOLLO5_PINMUX(106,4)
#define RESERVED5_P106          APOLLO5_PINMUX(106,5)
#define CT106_P106              APOLLO5_PINMUX(106,6)
#define NCE106_P106             APOLLO5_PINMUX(106,7)
#define RESERVED8_P106          APOLLO5_PINMUX(106,8)
#define RESERVED9_P106          APOLLO5_PINMUX(106,9)
#define RESERVED10_P106         APOLLO5_PINMUX(106,10)
#define FPIO_P106               APOLLO5_PINMUX(106,11)
#define RESERVED12_P106         APOLLO5_PINMUX(106,12)
#define RESERVED13_P106         APOLLO5_PINMUX(106,13)
#define RESERVED14_P106         APOLLO5_PINMUX(106,14)
#define RESERVED15_P106         APOLLO5_PINMUX(106,15)

#define MSPI3_12_P107           APOLLO5_PINMUX(107,0)
#define RESERVED1_P107          APOLLO5_PINMUX(107,1)
#define RESERVED2_P107          APOLLO5_PINMUX(107,2)
#define GPIO_P107               APOLLO5_PINMUX(107,3)
#define RESERVED4_P107          APOLLO5_PINMUX(107,4)
#define RESERVED5_P107          APOLLO5_PINMUX(107,5)
#define CT107_P107              APOLLO5_PINMUX(107,6)
#define NCE107_P107             APOLLO5_PINMUX(107,7)
#define RESERVED8_P107          APOLLO5_PINMUX(107,8)
#define RESERVED9_P107          APOLLO5_PINMUX(107,9)
#define RESERVED10_P107         APOLLO5_PINMUX(107,10)
#define FPIO_P107               APOLLO5_PINMUX(107,11)
#define RESERVED12_P107         APOLLO5_PINMUX(107,12)
#define RESERVED13_P107         APOLLO5_PINMUX(107,13)
#define RESERVED14_P107         APOLLO5_PINMUX(107,14)
#define RESERVED15_P107         APOLLO5_PINMUX(107,15)

#define MSPI3_13_P108           APOLLO5_PINMUX(108,0)
#define RESERVED1_P108          APOLLO5_PINMUX(108,1)
#define RESERVED2_P108          APOLLO5_PINMUX(108,2)
#define GPIO_P108               APOLLO5_PINMUX(108,3)
#define RESERVED4_P108          APOLLO5_PINMUX(108,4)
#define RESERVED5_P108          APOLLO5_PINMUX(108,5)
#define CT108_P108              APOLLO5_PINMUX(108,6)
#define NCE108_P108             APOLLO5_PINMUX(108,7)
#define RESERVED8_P108          APOLLO5_PINMUX(108,8)
#define RESERVED9_P108          APOLLO5_PINMUX(108,9)
#define RESERVED10_P108         APOLLO5_PINMUX(108,10)
#define FPIO_P108               APOLLO5_PINMUX(108,11)
#define RESERVED12_P108         APOLLO5_PINMUX(108,12)
#define RESERVED13_P108         APOLLO5_PINMUX(108,13)
#define RESERVED14_P108         APOLLO5_PINMUX(108,14)
#define RESERVED15_P108         APOLLO5_PINMUX(108,15)

#define MSPI3_14_P109           APOLLO5_PINMUX(109,0)
#define RESERVED1_P109          APOLLO5_PINMUX(109,1)
#define RESERVED2_P109          APOLLO5_PINMUX(109,2)
#define GPIO_P109               APOLLO5_PINMUX(109,3)
#define RESERVED4_P109          APOLLO5_PINMUX(109,4)
#define RESERVED5_P109          APOLLO5_PINMUX(109,5)
#define CT109_P109              APOLLO5_PINMUX(109,6)
#define NCE109_P109             APOLLO5_PINMUX(109,7)
#define RESERVED8_P109          APOLLO5_PINMUX(109,8)
#define RESERVED9_P109          APOLLO5_PINMUX(109,9)
#define RESERVED10_P109         APOLLO5_PINMUX(109,10)
#define FPIO_P109               APOLLO5_PINMUX(109,11)
#define RESERVED12_P109         APOLLO5_PINMUX(109,12)
#define RESERVED13_P109         APOLLO5_PINMUX(109,13)
#define RESERVED14_P109         APOLLO5_PINMUX(109,14)
#define RESERVED15_P109         APOLLO5_PINMUX(109,15)

#define MSPI3_15_P110           APOLLO5_PINMUX(110,0)
#define RESERVED1_P110          APOLLO5_PINMUX(110,1)
#define RESERVED2_P110          APOLLO5_PINMUX(110,2)
#define GPIO_P110               APOLLO5_PINMUX(110,3)
#define RESERVED4_P110          APOLLO5_PINMUX(110,4)
#define RESERVED5_P110          APOLLO5_PINMUX(110,5)
#define CT110_P110              APOLLO5_PINMUX(110,6)
#define NCE110_P110             APOLLO5_PINMUX(110,7)
#define RESERVED8_P110          APOLLO5_PINMUX(110,8)
#define RESERVED9_P110          APOLLO5_PINMUX(110,9)
#define RESERVED10_P110         APOLLO5_PINMUX(110,10)
#define FPIO_P110               APOLLO5_PINMUX(110,11)
#define RESERVED12_P110         APOLLO5_PINMUX(110,12)
#define RESERVED13_P110         APOLLO5_PINMUX(110,13)
#define RESERVED14_P110         APOLLO5_PINMUX(110,14)
#define RESERVED15_P110         APOLLO5_PINMUX(110,15)

