zephyrproject-rtos/hal_ambiq/dts/apollo510/ambiq-apollo510-pinmux.h
#define MSPI3_16_P111           APOLLO5_PINMUX(111,0)
#define RESERVED1_P111          APOLLO5_PINMUX(111,1)
#define RESERVED2_P111          APOLLO5_PINMUX(111,2)
#define GPIO_P111               APOLLO5_PINMUX(111,3)
#define RESERVED4_P111          APOLLO5_PINMUX(111,4)
#define RESERVED5_P111          APOLLO5_PINMUX(111,5)
#define CT111_P111              APOLLO5_PINMUX(111,6)
#define NCE111_P111             APOLLO5_PINMUX(111,7)
#define RESERVED8_P111          APOLLO5_PINMUX(111,8)
#define RESERVED9_P111          APOLLO5_PINMUX(111,9)
#define RESERVED10_P111         APOLLO5_PINMUX(111,10)
#define FPIO_P111               APOLLO5_PINMUX(111,11)
#define RESERVED12_P111         APOLLO5_PINMUX(111,12)
#define RESERVED13_P111         APOLLO5_PINMUX(111,13)
#define RESERVED14_P111         APOLLO5_PINMUX(111,14)
#define RESERVED15_P111         APOLLO5_PINMUX(111,15)

#define MSPI3_17_P112           APOLLO5_PINMUX(112,0)
#define RESERVED1_P112          APOLLO5_PINMUX(112,1)
#define RESERVED2_P112          APOLLO5_PINMUX(112,2)
#define GPIO_P112               APOLLO5_PINMUX(112,3)
#define RESERVED4_P112          APOLLO5_PINMUX(112,4)
#define RESERVED5_P112          APOLLO5_PINMUX(112,5)
#define CT112_P112              APOLLO5_PINMUX(112,6)
#define NCE112_P112             APOLLO5_PINMUX(112,7)
#define RESERVED8_P112          APOLLO5_PINMUX(112,8)
#define RESERVED9_P112          APOLLO5_PINMUX(112,9)
#define RESERVED10_P112         APOLLO5_PINMUX(112,10)
#define FPIO_P112               APOLLO5_PINMUX(112,11)
#define RESERVED12_P112         APOLLO5_PINMUX(112,12)
#define RESERVED13_P112         APOLLO5_PINMUX(112,13)
#define RESERVED14_P112         APOLLO5_PINMUX(112,14)
#define RESERVED15_P112         APOLLO5_PINMUX(112,15)

#define MSPI3_18_P113           APOLLO5_PINMUX(113,0)
#define RESERVED1_P113          APOLLO5_PINMUX(113,1)
#define RESERVED2_P113          APOLLO5_PINMUX(113,2)
#define GPIO_P113               APOLLO5_PINMUX(113,3)
#define RESERVED4_P113          APOLLO5_PINMUX(113,4)
#define RESERVED5_P113          APOLLO5_PINMUX(113,5)
#define CT113_P113              APOLLO5_PINMUX(113,6)
#define NCE113_P113             APOLLO5_PINMUX(113,7)
#define RESERVED8_P113          APOLLO5_PINMUX(113,8)
#define RESERVED9_P113          APOLLO5_PINMUX(113,9)
#define RESERVED10_P113         APOLLO5_PINMUX(113,10)
#define FPIO_P113               APOLLO5_PINMUX(113,11)
#define RESERVED12_P113         APOLLO5_PINMUX(113,12)
#define RESERVED13_P113         APOLLO5_PINMUX(113,13)
#define RESERVED14_P113         APOLLO5_PINMUX(113,14)
#define RESERVED15_P113         APOLLO5_PINMUX(113,15)

#define RESERVED0_P114          APOLLO5_PINMUX(114,0)
#define MNCE3_0_P114            APOLLO5_PINMUX(114,1)
#define RESERVED2_P114          APOLLO5_PINMUX(114,2)
#define GPIO_P114               APOLLO5_PINMUX(114,3)
#define RESERVED4_P114          APOLLO5_PINMUX(114,4)
#define RESERVED5_P114          APOLLO5_PINMUX(114,5)
#define CT114_P114              APOLLO5_PINMUX(114,6)
#define NCE114_P114             APOLLO5_PINMUX(114,7)
#define RESERVED8_P114          APOLLO5_PINMUX(114,8)
#define RESERVED9_P114          APOLLO5_PINMUX(114,9)
#define RESERVED10_P114         APOLLO5_PINMUX(114,10)
#define FPIO_P114               APOLLO5_PINMUX(114,11)
#define RESERVED12_P114         APOLLO5_PINMUX(114,12)
#define RESERVED13_P114         APOLLO5_PINMUX(114,13)
#define RESERVED14_P114         APOLLO5_PINMUX(114,14)
#define RESERVED15_P114         APOLLO5_PINMUX(114,15)

#define MSPI3_0_P115            APOLLO5_PINMUX(115,0)
#define RESERVED1_P115          APOLLO5_PINMUX(115,1)
#define RESERVED2_P115          APOLLO5_PINMUX(115,2)
#define GPIO_P115               APOLLO5_PINMUX(115,3)
#define RESERVED4_P115          APOLLO5_PINMUX(115,4)
#define RESERVED5_P115          APOLLO5_PINMUX(115,5)
#define CT115_P115              APOLLO5_PINMUX(115,6)
#define NCE115_P115             APOLLO5_PINMUX(115,7)
#define RESERVED8_P115          APOLLO5_PINMUX(115,8)
#define RESERVED9_P115          APOLLO5_PINMUX(115,9)
#define RESERVED10_P115         APOLLO5_PINMUX(115,10)
#define FPIO_P115               APOLLO5_PINMUX(115,11)
#define RESERVED12_P115         APOLLO5_PINMUX(115,12)
#define RESERVED13_P115         APOLLO5_PINMUX(115,13)
#define RESERVED14_P115         APOLLO5_PINMUX(115,14)
#define RESERVED15_P115         APOLLO5_PINMUX(115,15)

#define MSPI3_1_P116            APOLLO5_PINMUX(116,0)
#define RESERVED1_P116          APOLLO5_PINMUX(116,1)
#define RESERVED2_P116          APOLLO5_PINMUX(116,2)
#define GPIO_P116               APOLLO5_PINMUX(116,3)
#define RESERVED4_P116          APOLLO5_PINMUX(116,4)
#define RESERVED5_P116          APOLLO5_PINMUX(116,5)
#define CT116_P116              APOLLO5_PINMUX(116,6)
#define NCE116_P116             APOLLO5_PINMUX(116,7)
#define RESERVED8_P116          APOLLO5_PINMUX(116,8)
#define RESERVED9_P116          APOLLO5_PINMUX(116,9)
#define RESERVED10_P116         APOLLO5_PINMUX(116,10)
#define FPIO_P116               APOLLO5_PINMUX(116,11)
#define RESERVED12_P116         APOLLO5_PINMUX(116,12)
#define RESERVED13_P116         APOLLO5_PINMUX(116,13)
#define RESERVED14_P116         APOLLO5_PINMUX(116,14)
#define RESERVED15_P116         APOLLO5_PINMUX(116,15)

#define MSPI3_2_P117            APOLLO5_PINMUX(117,0)
#define RESERVED1_P117          APOLLO5_PINMUX(117,1)
#define RESERVED2_P117          APOLLO5_PINMUX(117,2)
#define GPIO_P117               APOLLO5_PINMUX(117,3)
#define RESERVED4_P117          APOLLO5_PINMUX(117,4)
#define RESERVED5_P117          APOLLO5_PINMUX(117,5)
#define CT117_P117              APOLLO5_PINMUX(117,6)
#define NCE117_P117             APOLLO5_PINMUX(117,7)
#define RESERVED8_P117          APOLLO5_PINMUX(117,8)
#define RESERVED9_P117          APOLLO5_PINMUX(117,9)
#define RESERVED10_P117         APOLLO5_PINMUX(117,10)
#define FPIO_P117               APOLLO5_PINMUX(117,11)
#define RESERVED12_P117         APOLLO5_PINMUX(117,12)
#define RESERVED13_P117         APOLLO5_PINMUX(117,13)
#define RESERVED14_P117         APOLLO5_PINMUX(117,14)
#define RESERVED15_P117         APOLLO5_PINMUX(117,15)

#define MSPI3_3_P118            APOLLO5_PINMUX(118,0)
#define RESERVED1_P118          APOLLO5_PINMUX(118,1)
#define RESERVED2_P118          APOLLO5_PINMUX(118,2)
#define GPIO_P118               APOLLO5_PINMUX(118,3)
#define RESERVED4_P118          APOLLO5_PINMUX(118,4)
#define RESERVED5_P118          APOLLO5_PINMUX(118,5)
#define CT118_P118              APOLLO5_PINMUX(118,6)
#define NCE118_P118             APOLLO5_PINMUX(118,7)
#define RESERVED8_P118          APOLLO5_PINMUX(118,8)
#define RESERVED9_P118          APOLLO5_PINMUX(118,9)
#define RESERVED10_P118         APOLLO5_PINMUX(118,10)
#define FPIO_P118               APOLLO5_PINMUX(118,11)
#define RESERVED12_P118         APOLLO5_PINMUX(118,12)
#define RESERVED13_P118         APOLLO5_PINMUX(118,13)
#define RESERVED14_P118         APOLLO5_PINMUX(118,14)
#define RESERVED15_P118         APOLLO5_PINMUX(118,15)

