zephyrproject-rtos/hal_ambiq/dts/apollo510/ambiq-apollo510-pinmux.h
#define MSPI3_4_P119            APOLLO5_PINMUX(119,0)
#define RESERVED1_P119          APOLLO5_PINMUX(119,1)
#define RESERVED2_P119          APOLLO5_PINMUX(119,2)
#define GPIO_P119               APOLLO5_PINMUX(119,3)
#define RESERVED4_P119          APOLLO5_PINMUX(119,4)
#define RESERVED5_P119          APOLLO5_PINMUX(119,5)
#define CT119_P119              APOLLO5_PINMUX(119,6)
#define NCE119_P119             APOLLO5_PINMUX(119,7)
#define RESERVED8_P119          APOLLO5_PINMUX(119,8)
#define RESERVED9_P119          APOLLO5_PINMUX(119,9)
#define RESERVED10_P119         APOLLO5_PINMUX(119,10)
#define FPIO_P119               APOLLO5_PINMUX(119,11)
#define RESERVED12_P119         APOLLO5_PINMUX(119,12)
#define RESERVED13_P119         APOLLO5_PINMUX(119,13)
#define RESERVED14_P119         APOLLO5_PINMUX(119,14)
#define RESERVED15_P119         APOLLO5_PINMUX(119,15)

#define MSPI3_5_P120            APOLLO5_PINMUX(120,0)
#define RESERVED1_P120          APOLLO5_PINMUX(120,1)
#define RESERVED2_P120          APOLLO5_PINMUX(120,2)
#define GPIO_P120               APOLLO5_PINMUX(120,3)
#define RESERVED4_P120          APOLLO5_PINMUX(120,4)
#define RESERVED5_P120          APOLLO5_PINMUX(120,5)
#define CT120_P120              APOLLO5_PINMUX(120,6)
#define NCE120_P120             APOLLO5_PINMUX(120,7)
#define RESERVED8_P120          APOLLO5_PINMUX(120,8)
#define RESERVED9_P120          APOLLO5_PINMUX(120,9)
#define RESERVED10_P120         APOLLO5_PINMUX(120,10)
#define FPIO_P120               APOLLO5_PINMUX(120,11)
#define RESERVED12_P120         APOLLO5_PINMUX(120,12)
#define RESERVED13_P120         APOLLO5_PINMUX(120,13)
#define RESERVED14_P120         APOLLO5_PINMUX(120,14)
#define RESERVED15_P120         APOLLO5_PINMUX(120,15)

#define MSPI3_6_P121            APOLLO5_PINMUX(121,0)
#define RESERVED1_P121          APOLLO5_PINMUX(121,1)
#define RESERVED2_P121          APOLLO5_PINMUX(121,2)
#define GPIO_P121               APOLLO5_PINMUX(121,3)
#define RESERVED4_P121          APOLLO5_PINMUX(121,4)
#define RESERVED5_P121          APOLLO5_PINMUX(121,5)
#define CT121_P121              APOLLO5_PINMUX(121,6)
#define NCE121_P121             APOLLO5_PINMUX(121,7)
#define RESERVED8_P121          APOLLO5_PINMUX(121,8)
#define RESERVED9_P121          APOLLO5_PINMUX(121,9)
#define RESERVED10_P121         APOLLO5_PINMUX(121,10)
#define FPIO_P121               APOLLO5_PINMUX(121,11)
#define RESERVED12_P121         APOLLO5_PINMUX(121,12)
#define RESERVED13_P121         APOLLO5_PINMUX(121,13)
#define RESERVED14_P121         APOLLO5_PINMUX(121,14)
#define RESERVED15_P121         APOLLO5_PINMUX(121,15)

#define MSPI3_7_P122            APOLLO5_PINMUX(122,0)
#define RESERVED1_P122          APOLLO5_PINMUX(122,1)
#define RESERVED2_P122          APOLLO5_PINMUX(122,2)
#define GPIO_P122               APOLLO5_PINMUX(122,3)
#define RESERVED4_P122          APOLLO5_PINMUX(122,4)
#define RESERVED5_P122          APOLLO5_PINMUX(122,5)
#define CT122_P122              APOLLO5_PINMUX(122,6)
#define NCE122_P122             APOLLO5_PINMUX(122,7)
#define RESERVED8_P122          APOLLO5_PINMUX(122,8)
#define RESERVED9_P122          APOLLO5_PINMUX(122,9)
#define RESERVED10_P122         APOLLO5_PINMUX(122,10)
#define FPIO_P122               APOLLO5_PINMUX(122,11)
#define RESERVED12_P122         APOLLO5_PINMUX(122,12)
#define RESERVED13_P122         APOLLO5_PINMUX(122,13)
#define RESERVED14_P122         APOLLO5_PINMUX(122,14)
#define RESERVED15_P122         APOLLO5_PINMUX(122,15)

#define MSPI3_8_P123            APOLLO5_PINMUX(123,0)
#define RESERVED1_P123          APOLLO5_PINMUX(123,1)
#define RESERVED2_P123          APOLLO5_PINMUX(123,2)
#define GPIO_P123               APOLLO5_PINMUX(123,3)
#define RESERVED4_P123          APOLLO5_PINMUX(123,4)
#define RESERVED5_P123          APOLLO5_PINMUX(123,5)
#define CT123_P123              APOLLO5_PINMUX(123,6)
#define NCE123_P123             APOLLO5_PINMUX(123,7)
#define RESERVED8_P123          APOLLO5_PINMUX(123,8)
#define RESERVED9_P123          APOLLO5_PINMUX(123,9)
#define RESERVED10_P123         APOLLO5_PINMUX(123,10)
#define FPIO_P123               APOLLO5_PINMUX(123,11)
#define RESERVED12_P123         APOLLO5_PINMUX(123,12)
#define RESERVED13_P123         APOLLO5_PINMUX(123,13)
#define RESERVED14_P123         APOLLO5_PINMUX(123,14)
#define RESERVED15_P123         APOLLO5_PINMUX(123,15)

#define MSPI3_9_P124            APOLLO5_PINMUX(124,0)
#define RESERVED1_P124          APOLLO5_PINMUX(124,1)
#define RESERVED2_P124          APOLLO5_PINMUX(124,2)
#define GPIO_P124               APOLLO5_PINMUX(124,3)
#define RESERVED4_P124          APOLLO5_PINMUX(124,4)
#define RESERVED5_P124          APOLLO5_PINMUX(124,5)
#define CT124_P124              APOLLO5_PINMUX(124,6)
#define NCE124_P124             APOLLO5_PINMUX(124,7)
#define RESERVED8_P124          APOLLO5_PINMUX(124,8)
#define RESERVED9_P124          APOLLO5_PINMUX(124,9)
#define RESERVED10_P124         APOLLO5_PINMUX(124,10)
#define FPIO_P124               APOLLO5_PINMUX(124,11)
#define RESERVED12_P124         APOLLO5_PINMUX(124,12)
#define RESERVED13_P124         APOLLO5_PINMUX(124,13)
#define RESERVED14_P124         APOLLO5_PINMUX(124,14)
#define RESERVED15_P124         APOLLO5_PINMUX(124,15)

#define SDIF1_DAT0_P125         APOLLO5_PINMUX(125,0)
#define RESERVED1_P125          APOLLO5_PINMUX(125,1)
#define RESERVED2_P125          APOLLO5_PINMUX(125,2)
#define GPIO_P125               APOLLO5_PINMUX(125,3)
#define RESERVED4_P125          APOLLO5_PINMUX(125,4)
#define RESERVED5_P125          APOLLO5_PINMUX(125,5)
#define CT125_P125              APOLLO5_PINMUX(125,6)
#define NCE125_P125             APOLLO5_PINMUX(125,7)
#define RESERVED8_P125          APOLLO5_PINMUX(125,8)
#define RESERVED9_P125          APOLLO5_PINMUX(125,9)
#define RESERVED10_P125         APOLLO5_PINMUX(125,10)
#define FPIO_P125               APOLLO5_PINMUX(125,11)
#define RESERVED12_P125         APOLLO5_PINMUX(125,12)
#define RESERVED13_P125         APOLLO5_PINMUX(125,13)
#define RESERVED14_P125         APOLLO5_PINMUX(125,14)
#define RESERVED15_P125         APOLLO5_PINMUX(125,15)

#define SDIF1_DAT1_P126         APOLLO5_PINMUX(126,0)
#define RESERVED1_P126          APOLLO5_PINMUX(126,1)
#define RESERVED2_P126          APOLLO5_PINMUX(126,2)
#define GPIO_P126               APOLLO5_PINMUX(126,3)
#define RESERVED4_P126          APOLLO5_PINMUX(126,4)
#define RESERVED5_P126          APOLLO5_PINMUX(126,5)
#define CT126_P126              APOLLO5_PINMUX(126,6)
#define NCE126_P126             APOLLO5_PINMUX(126,7)
#define RESERVED8_P126          APOLLO5_PINMUX(126,8)
#define RESERVED9_P126          APOLLO5_PINMUX(126,9)
#define RESERVED10_P126         APOLLO5_PINMUX(126,10)
#define FPIO_P126               APOLLO5_PINMUX(126,11)
#define RESERVED12_P126         APOLLO5_PINMUX(126,12)
#define RESERVED13_P126         APOLLO5_PINMUX(126,13)
#define RESERVED14_P126         APOLLO5_PINMUX(126,14)
#define RESERVED15_P126         APOLLO5_PINMUX(126,15)

#define SDIF1_DAT2_P127         APOLLO5_PINMUX(127,0)
#define RESERVED1_P127          APOLLO5_PINMUX(127,1)
#define RESERVED2_P127          APOLLO5_PINMUX(127,2)
#define GPIO_P127               APOLLO5_PINMUX(127,3)
#define RESERVED4_P127          APOLLO5_PINMUX(127,4)
#define RESERVED5_P127          APOLLO5_PINMUX(127,5)
#define CT127_P127              APOLLO5_PINMUX(127,6)
#define NCE127_P127             APOLLO5_PINMUX(127,7)
#define RESERVED8_P127          APOLLO5_PINMUX(127,8)
#define RESERVED9_P127          APOLLO5_PINMUX(127,9)
#define RESERVED10_P127         APOLLO5_PINMUX(127,10)
#define FPIO_P127               APOLLO5_PINMUX(127,11)
#define RESERVED12_P127         APOLLO5_PINMUX(127,12)
#define RESERVED13_P127         APOLLO5_PINMUX(127,13)
#define RESERVED14_P127         APOLLO5_PINMUX(127,14)
#define RESERVED15_P127         APOLLO5_PINMUX(127,15)

#define SDIF1_DAT3_P128         APOLLO5_PINMUX(128,0)
#define RESERVED1_P128          APOLLO5_PINMUX(128,1)
#define RESERVED2_P128          APOLLO5_PINMUX(128,2)
#define GPIO_P128               APOLLO5_PINMUX(128,3)
#define RESERVED4_P128          APOLLO5_PINMUX(128,4)
#define RESERVED5_P128          APOLLO5_PINMUX(128,5)
#define CT128_P128              APOLLO5_PINMUX(128,6)
#define NCE128_P128             APOLLO5_PINMUX(128,7)
#define RESERVED8_P128          APOLLO5_PINMUX(128,8)
#define RESERVED9_P128          APOLLO5_PINMUX(128,9)
#define RESERVED10_P128         APOLLO5_PINMUX(128,10)
#define FPIO_P128               APOLLO5_PINMUX(128,11)
#define RESERVED12_P128         APOLLO5_PINMUX(128,12)
#define RESERVED13_P128         APOLLO5_PINMUX(128,13)
#define RESERVED14_P128         APOLLO5_PINMUX(128,14)
#define RESERVED15_P128         APOLLO5_PINMUX(128,15)

#define SDIF1_CLKOUT_P129       APOLLO5_PINMUX(129,0)
#define RESERVED1_P129          APOLLO5_PINMUX(129,1)
#define RESERVED2_P129          APOLLO5_PINMUX(129,2)
#define GPIO_P129               APOLLO5_PINMUX(129,3)
#define RESERVED4_P129          APOLLO5_PINMUX(129,4)
#define RESERVED5_P129          APOLLO5_PINMUX(129,5)
#define CT129_P129              APOLLO5_PINMUX(129,6)
#define NCE129_P129             APOLLO5_PINMUX(129,7)
#define RESERVED8_P129          APOLLO5_PINMUX(129,8)
#define RESERVED9_P129          APOLLO5_PINMUX(129,9)
#define RESERVED10_P129         APOLLO5_PINMUX(129,10)
#define FPIO_P129               APOLLO5_PINMUX(129,11)
#define RESERVED12_P129         APOLLO5_PINMUX(129,12)
#define RESERVED13_P129         APOLLO5_PINMUX(129,13)
#define RESERVED14_P129         APOLLO5_PINMUX(129,14)
#define RESERVED15_P129         APOLLO5_PINMUX(129,15)

#define SDIF1_DAT4_P130         APOLLO5_PINMUX(130,0)
#define MNCE0_0_P130            APOLLO5_PINMUX(130,1)
#define RESERVED2_P130          APOLLO5_PINMUX(130,2)
#define GPIO_P130               APOLLO5_PINMUX(130,3)
#define RESERVED4_P130          APOLLO5_PINMUX(130,4)
#define RESERVED5_P130          APOLLO5_PINMUX(130,5)
#define CT130_P130              APOLLO5_PINMUX(130,6)
#define NCE130_P130             APOLLO5_PINMUX(130,7)
#define RESERVED8_P130          APOLLO5_PINMUX(130,8)
#define RESERVED9_P130          APOLLO5_PINMUX(130,9)
#define I2S1_CLK_P130           APOLLO5_PINMUX(130,10)
#define FPIO_P130               APOLLO5_PINMUX(130,11)
#define RESERVED12_P130         APOLLO5_PINMUX(130,12)
#define RESERVED13_P130         APOLLO5_PINMUX(130,13)
#define RESERVED14_P130         APOLLO5_PINMUX(130,14)
#define RESERVED15_P130         APOLLO5_PINMUX(130,15)

#define SDIF1_DAT5_P131         APOLLO5_PINMUX(131,0)
#define MNCE3_0_P131            APOLLO5_PINMUX(131,1)
#define RESERVED2_P131          APOLLO5_PINMUX(131,2)
#define GPIO_P131               APOLLO5_PINMUX(131,3)
#define RESERVED4_P131          APOLLO5_PINMUX(131,4)
#define RESERVED5_P131          APOLLO5_PINMUX(131,5)
#define CT131_P131              APOLLO5_PINMUX(131,6)
#define NCE131_P131             APOLLO5_PINMUX(131,7)
#define RESERVED8_P131          APOLLO5_PINMUX(131,8)
#define I2S1_DATA_P131          APOLLO5_PINMUX(131,9)
#define I2S1_SDOUT_P131         APOLLO5_PINMUX(131,10)
#define FPIO_P131               APOLLO5_PINMUX(131,11)
#define RESERVED12_P131         APOLLO5_PINMUX(131,12)
#define RESERVED13_P131         APOLLO5_PINMUX(131,13)
#define RESERVED14_P131         APOLLO5_PINMUX(131,14)
#define RESERVED15_P131         APOLLO5_PINMUX(131,15)

#define SDIF1_DAT6_P132         APOLLO5_PINMUX(132,0)
#define RESERVED1_P132          APOLLO5_PINMUX(132,1)
#define RESERVED2_P132          APOLLO5_PINMUX(132,2)
#define GPIO_P132               APOLLO5_PINMUX(132,3)
#define RESERVED4_P132          APOLLO5_PINMUX(132,4)
#define RESERVED5_P132          APOLLO5_PINMUX(132,5)
#define CT132_P132              APOLLO5_PINMUX(132,6)
#define NCE132_P132             APOLLO5_PINMUX(132,7)
#define RESERVED8_P132          APOLLO5_PINMUX(132,8)
#define RESERVED9_P132          APOLLO5_PINMUX(132,9)
#define I2S1_WS_P132            APOLLO5_PINMUX(132,10)
#define FPIO_P132               APOLLO5_PINMUX(132,11)
#define RESERVED12_P132         APOLLO5_PINMUX(132,12)
#define RESERVED13_P132         APOLLO5_PINMUX(132,13)
#define RESERVED14_P132         APOLLO5_PINMUX(132,14)
#define RESERVED15_P132         APOLLO5_PINMUX(132,15)

