zephyrproject-rtos/hal_ambiq/dts/apollo510/ambiq-apollo510-pinmux.h
#define SDIF1_DAT7_P133         APOLLO5_PINMUX(133,0)
#define RESERVED1_P133          APOLLO5_PINMUX(133,1)
#define RESERVED2_P133          APOLLO5_PINMUX(133,2)
#define GPIO_P133               APOLLO5_PINMUX(133,3)
#define RESERVED4_P133          APOLLO5_PINMUX(133,4)
#define RESERVED5_P133          APOLLO5_PINMUX(133,5)
#define CT133_P133              APOLLO5_PINMUX(133,6)
#define NCE133_P133             APOLLO5_PINMUX(133,7)
#define RESERVED8_P133          APOLLO5_PINMUX(133,8)
#define RESERVED9_P133          APOLLO5_PINMUX(133,9)
#define I2S1_SDIN_P133          APOLLO5_PINMUX(133,10)
#define FPIO_P133               APOLLO5_PINMUX(133,11)
#define RESERVED12_P133         APOLLO5_PINMUX(133,12)
#define RESERVED13_P133         APOLLO5_PINMUX(133,13)
#define RESERVED14_P133         APOLLO5_PINMUX(133,14)
#define RESERVED15_P133         APOLLO5_PINMUX(133,15)

#define SDIF1_CMD_P134          APOLLO5_PINMUX(134,0)
#define RESERVED1_P134          APOLLO5_PINMUX(134,1)
#define RESERVED2_P134          APOLLO5_PINMUX(134,2)
#define GPIO_P134               APOLLO5_PINMUX(134,3)
#define RESERVED4_P134          APOLLO5_PINMUX(134,4)
#define RESERVED5_P134          APOLLO5_PINMUX(134,5)
#define CT134_P134              APOLLO5_PINMUX(134,6)
#define NCE134_P134             APOLLO5_PINMUX(134,7)
#define RESERVED8_P134          APOLLO5_PINMUX(134,8)
#define RESERVED9_P134          APOLLO5_PINMUX(134,9)
#define RESERVED10_P134         APOLLO5_PINMUX(134,10)
#define FPIO_P134               APOLLO5_PINMUX(134,11)
#define RESERVED12_P134         APOLLO5_PINMUX(134,12)
#define RESERVED13_P134         APOLLO5_PINMUX(134,13)
#define RESERVED14_P134         APOLLO5_PINMUX(134,14)
#define RESERVED15_P134         APOLLO5_PINMUX(134,15)

#define RESERVED0_P135          APOLLO5_PINMUX(135,0)
#define RESERVED1_P135          APOLLO5_PINMUX(135,1)
#define RESERVED2_P135          APOLLO5_PINMUX(135,2)
#define RESERVED3_P135          APOLLO5_PINMUX(135,3)
#define RESERVED4_P135          APOLLO5_PINMUX(135,4)
#define RESERVED5_P135          APOLLO5_PINMUX(135,5)
#define RESERVED6_P135          APOLLO5_PINMUX(135,6)
#define RESERVED7_P135          APOLLO5_PINMUX(135,7)
#define RESERVED8_P135          APOLLO5_PINMUX(135,8)
#define RESERVED9_P135          APOLLO5_PINMUX(135,9)
#define RESERVED10_P135         APOLLO5_PINMUX(135,10)
#define RESERVED11_P135         APOLLO5_PINMUX(135,11)
#define RESERVED12_P135         APOLLO5_PINMUX(135,12)
#define RESERVED13_P135         APOLLO5_PINMUX(135,13)
#define RESERVED14_P135         APOLLO5_PINMUX(135,14)
#define RESERVED15_P135         APOLLO5_PINMUX(135,15)

#define RESERVED0_P136          APOLLO5_PINMUX(136,0)
#define DISP_D15_P136           APOLLO5_PINMUX(136,1)
#define RESERVED2_P136          APOLLO5_PINMUX(136,2)
#define GPIO_P136               APOLLO5_PINMUX(136,3)
#define RESERVED4_P136          APOLLO5_PINMUX(136,4)
#define RESERVED5_P136          APOLLO5_PINMUX(136,5)
#define CT136_P136              APOLLO5_PINMUX(136,6)
#define NCE136_P136             APOLLO5_PINMUX(136,7)
#define RESERVED8_P136          APOLLO5_PINMUX(136,8)
#define RESERVED9_P136          APOLLO5_PINMUX(136,9)
#define RESERVED10_P136         APOLLO5_PINMUX(136,10)
#define FPIO_P136               APOLLO5_PINMUX(136,11)
#define RESERVED12_P136         APOLLO5_PINMUX(136,12)
#define RESERVED13_P136         APOLLO5_PINMUX(136,13)
#define RESERVED14_P136         APOLLO5_PINMUX(136,14)
#define RESERVED15_P136         APOLLO5_PINMUX(136,15)

#define RESERVED0_P137          APOLLO5_PINMUX(137,0)
#define RESERVED1_P137          APOLLO5_PINMUX(137,1)
#define RESERVED2_P137          APOLLO5_PINMUX(137,2)
#define RESERVED3_P137          APOLLO5_PINMUX(137,3)
#define RESERVED4_P137          APOLLO5_PINMUX(137,4)
#define RESERVED5_P137          APOLLO5_PINMUX(137,5)
#define RESERVED6_P137          APOLLO5_PINMUX(137,6)
#define RESERVED7_P137          APOLLO5_PINMUX(137,7)
#define RESERVED8_P137          APOLLO5_PINMUX(137,8)
#define RESERVED9_P137          APOLLO5_PINMUX(137,9)
#define RESERVED10_P137         APOLLO5_PINMUX(137,10)
#define RESERVED11_P137         APOLLO5_PINMUX(137,11)
#define RESERVED12_P137         APOLLO5_PINMUX(137,12)
#define RESERVED13_P137         APOLLO5_PINMUX(137,13)
#define RESERVED14_P137         APOLLO5_PINMUX(137,14)
#define RESERVED15_P137         APOLLO5_PINMUX(137,15)

#define MNCE1_1_P138            APOLLO5_PINMUX(138,0)
#define XT32KHz_P138            APOLLO5_PINMUX(138,1)
#define RESERVED2_P138          APOLLO5_PINMUX(138,2)
#define GPIO_P138               APOLLO5_PINMUX(138,3)
#define RESERVED4_P138          APOLLO5_PINMUX(138,4)
#define RESERVED5_P138          APOLLO5_PINMUX(138,5)
#define CT138_P138              APOLLO5_PINMUX(138,6)
#define NCE138_P138             APOLLO5_PINMUX(138,7)
#define RESERVED8_P138          APOLLO5_PINMUX(138,8)
#define I2S0_SDIN_P138          APOLLO5_PINMUX(138,9)
#define RESERVED10_P138         APOLLO5_PINMUX(138,10)
#define FPIO_P138               APOLLO5_PINMUX(138,11)
#define RESERVED12_P138         APOLLO5_PINMUX(138,12)
#define RESERVED13_P138         APOLLO5_PINMUX(138,13)
#define RESERVED14_P138         APOLLO5_PINMUX(138,14)
#define RESERVED15_P138         APOLLO5_PINMUX(138,15)

#define RESERVED0_P139          APOLLO5_PINMUX(139,0)
#define RESERVED1_P139          APOLLO5_PINMUX(139,1)
#define RESERVED2_P139          APOLLO5_PINMUX(139,2)
#define GPIO_P139               APOLLO5_PINMUX(139,3)
#define RESERVED4_P139          APOLLO5_PINMUX(139,4)
#define RESERVED5_P139          APOLLO5_PINMUX(139,5)
#define CT139_P139              APOLLO5_PINMUX(139,6)
#define NCE139_P139             APOLLO5_PINMUX(139,7)
#define RESERVED8_P139          APOLLO5_PINMUX(139,8)
#define RESERVED9_P139          APOLLO5_PINMUX(139,9)
#define I2S0_SDIN_P139          APOLLO5_PINMUX(139,10)
#define FPIO_P139               APOLLO5_PINMUX(139,11)
#define RESERVED12_P139         APOLLO5_PINMUX(139,12)
#define RESERVED13_P139         APOLLO5_PINMUX(139,13)
#define RESERVED14_P139         APOLLO5_PINMUX(139,14)
#define RESERVED15_P139         APOLLO5_PINMUX(139,15)

#define RESERVED0_P140          APOLLO5_PINMUX(140,0)
#define DISP_D16_P140           APOLLO5_PINMUX(140,1)
#define RESERVED2_P140          APOLLO5_PINMUX(140,2)
#define GPIO_P140               APOLLO5_PINMUX(140,3)
#define RESERVED4_P140          APOLLO5_PINMUX(140,4)
#define RESERVED5_P140          APOLLO5_PINMUX(140,5)
#define CT140_P140              APOLLO5_PINMUX(140,6)
#define NCE140_P140             APOLLO5_PINMUX(140,7)
#define RESERVED8_P140          APOLLO5_PINMUX(140,8)
#define RESERVED9_P140          APOLLO5_PINMUX(140,9)
#define RESERVED10_P140         APOLLO5_PINMUX(140,10)
#define FPIO_P140               APOLLO5_PINMUX(140,11)
#define RESERVED12_P140         APOLLO5_PINMUX(140,12)
#define RESERVED13_P140         APOLLO5_PINMUX(140,13)
#define RESERVED14_P140         APOLLO5_PINMUX(140,14)
#define RESERVED15_P140         APOLLO5_PINMUX(140,15)

