zephyrproject-rtos/hal_ambiq/dts/apollo510/ambiq-apollo510-pinmux.h
#define RESERVED0_P141          APOLLO5_PINMUX(141,0)
#define DISP_D17_P141           APOLLO5_PINMUX(141,1)
#define RESERVED2_P141          APOLLO5_PINMUX(141,2)
#define GPIO_P141               APOLLO5_PINMUX(141,3)
#define RESERVED4_P141          APOLLO5_PINMUX(141,4)
#define RESERVED5_P141          APOLLO5_PINMUX(141,5)
#define CT141_P141              APOLLO5_PINMUX(141,6)
#define NCE141_P141             APOLLO5_PINMUX(141,7)
#define RESERVED8_P141          APOLLO5_PINMUX(141,8)
#define RESERVED9_P141          APOLLO5_PINMUX(141,9)
#define RESERVED10_P141         APOLLO5_PINMUX(141,10)
#define FPIO_P141               APOLLO5_PINMUX(141,11)
#define RESERVED12_P141         APOLLO5_PINMUX(141,12)
#define RESERVED13_P141         APOLLO5_PINMUX(141,13)
#define RESERVED14_P141         APOLLO5_PINMUX(141,14)
#define RESERVED15_P141         APOLLO5_PINMUX(141,15)

#define SWTRACECLK_P142         APOLLO5_PINMUX(142,0)
#define RESERVED1_P142          APOLLO5_PINMUX(142,1)
#define RESERVED2_P142          APOLLO5_PINMUX(142,2)
#define GPIO_P142               APOLLO5_PINMUX(142,3)
#define RESERVED4_P142          APOLLO5_PINMUX(142,4)
#define RESERVED5_P142          APOLLO5_PINMUX(142,5)
#define CT142_P142              APOLLO5_PINMUX(142,6)
#define NCE142_P142             APOLLO5_PINMUX(142,7)
#define RESERVED8_P142          APOLLO5_PINMUX(142,8)
#define RESERVED9_P142          APOLLO5_PINMUX(142,9)
#define RESERVED10_P142         APOLLO5_PINMUX(142,10)
#define FPIO_P142               APOLLO5_PINMUX(142,11)
#define RESERVED12_P142         APOLLO5_PINMUX(142,12)
#define RESERVED13_P142         APOLLO5_PINMUX(142,13)
#define RESERVED14_P142         APOLLO5_PINMUX(142,14)
#define RESERVED15_P142         APOLLO5_PINMUX(142,15)

#define SWTRACE0_P143           APOLLO5_PINMUX(143,0)
#define RESERVED1_P143          APOLLO5_PINMUX(143,1)
#define RESERVED2_P143          APOLLO5_PINMUX(143,2)
#define GPIO_P143               APOLLO5_PINMUX(143,3)
#define RESERVED4_P143          APOLLO5_PINMUX(143,4)
#define RESERVED5_P143          APOLLO5_PINMUX(143,5)
#define CT143_P143              APOLLO5_PINMUX(143,6)
#define NCE143_P143             APOLLO5_PINMUX(143,7)
#define RESERVED8_P143          APOLLO5_PINMUX(143,8)
#define RESERVED9_P143          APOLLO5_PINMUX(143,9)
#define RESERVED10_P143         APOLLO5_PINMUX(143,10)
#define FPIO_P143               APOLLO5_PINMUX(143,11)
#define RESERVED12_P143         APOLLO5_PINMUX(143,12)
#define RESERVED13_P143         APOLLO5_PINMUX(143,13)
#define RESERVED14_P143         APOLLO5_PINMUX(143,14)
#define RESERVED15_P143         APOLLO5_PINMUX(143,15)

#define SWTRACE1_P144           APOLLO5_PINMUX(144,0)
#define RESERVED1_P144          APOLLO5_PINMUX(144,1)
#define RESERVED2_P144          APOLLO5_PINMUX(144,2)
#define GPIO_P144               APOLLO5_PINMUX(144,3)
#define RESERVED4_P144          APOLLO5_PINMUX(144,4)
#define RESERVED5_P144          APOLLO5_PINMUX(144,5)
#define CT144_P144              APOLLO5_PINMUX(144,6)
#define NCE144_P144             APOLLO5_PINMUX(144,7)
#define RESERVED8_P144          APOLLO5_PINMUX(144,8)
#define RESERVED9_P144          APOLLO5_PINMUX(144,9)
#define RESERVED10_P144         APOLLO5_PINMUX(144,10)
#define FPIO_P144               APOLLO5_PINMUX(144,11)
#define RESERVED12_P144         APOLLO5_PINMUX(144,12)
#define RESERVED13_P144         APOLLO5_PINMUX(144,13)
#define RESERVED14_P144         APOLLO5_PINMUX(144,14)
#define RESERVED15_P144         APOLLO5_PINMUX(144,15)

#define SWTRACE2_P145           APOLLO5_PINMUX(145,0)
#define RESERVED1_P145          APOLLO5_PINMUX(145,1)
#define RESERVED2_P145          APOLLO5_PINMUX(145,2)
#define GPIO_P145               APOLLO5_PINMUX(145,3)
#define RESERVED4_P145          APOLLO5_PINMUX(145,4)
#define RESERVED5_P145          APOLLO5_PINMUX(145,5)
#define CT145_P145              APOLLO5_PINMUX(145,6)
#define NCE145_P145             APOLLO5_PINMUX(145,7)
#define RESERVED8_P145          APOLLO5_PINMUX(145,8)
#define RESERVED9_P145          APOLLO5_PINMUX(145,9)
#define RESERVED10_P145         APOLLO5_PINMUX(145,10)
#define FPIO_P145               APOLLO5_PINMUX(145,11)
#define RESERVED12_P145         APOLLO5_PINMUX(145,12)
#define RESERVED13_P145         APOLLO5_PINMUX(145,13)
#define RESERVED14_P145         APOLLO5_PINMUX(145,14)
#define RESERVED15_P145         APOLLO5_PINMUX(145,15)

#define SWTRACE3_P146           APOLLO5_PINMUX(146,0)
#define RESERVED1_P146          APOLLO5_PINMUX(146,1)
#define RESERVED2_P146          APOLLO5_PINMUX(146,2)
#define GPIO_P146               APOLLO5_PINMUX(146,3)
#define RESERVED4_P146          APOLLO5_PINMUX(146,4)
#define RESERVED5_P146          APOLLO5_PINMUX(146,5)
#define CT146_P146              APOLLO5_PINMUX(146,6)
#define NCE146_P146             APOLLO5_PINMUX(146,7)
#define RESERVED8_P146          APOLLO5_PINMUX(146,8)
#define RESERVED9_P146          APOLLO5_PINMUX(146,9)
#define RESERVED10_P146         APOLLO5_PINMUX(146,10)
#define FPIO_P146               APOLLO5_PINMUX(146,11)
#define RESERVED12_P146         APOLLO5_PINMUX(146,12)
#define RESERVED13_P146         APOLLO5_PINMUX(146,13)
#define RESERVED14_P146         APOLLO5_PINMUX(146,14)
#define RESERVED15_P146         APOLLO5_PINMUX(146,15)

#define SWTRACECTL_P147         APOLLO5_PINMUX(147,0)
#define RESERVED1_P147          APOLLO5_PINMUX(147,1)
#define RESERVED2_P147          APOLLO5_PINMUX(147,2)
#define GPIO_P147               APOLLO5_PINMUX(147,3)
#define RESERVED4_P147          APOLLO5_PINMUX(147,4)
#define RESERVED5_P147          APOLLO5_PINMUX(147,5)
#define CT147_P147              APOLLO5_PINMUX(147,6)
#define NCE147_P147             APOLLO5_PINMUX(147,7)
#define RESERVED8_P147          APOLLO5_PINMUX(147,8)
#define MNCE0_0_P147            APOLLO5_PINMUX(147,9)
#define MNCE3_0_P147            APOLLO5_PINMUX(147,10)
#define FPIO_P147               APOLLO5_PINMUX(147,11)
#define RESERVED12_P147         APOLLO5_PINMUX(147,12)
#define RESERVED13_P147         APOLLO5_PINMUX(147,13)
#define RESERVED14_P147         APOLLO5_PINMUX(147,14)
#define RESERVED15_P147         APOLLO5_PINMUX(147,15)

