zephyrproject-rtos/hal_ambiq/dts/apollo510/ambiq-apollo510-pinmux.h
#define RESERVED0_P148          APOLLO5_PINMUX(148,0)
#define DISP_D5_P148            APOLLO5_PINMUX(148,1)
#define DBIB_D8_P148            APOLLO5_PINMUX(148,2)
#define GPIO_P148               APOLLO5_PINMUX(148,3)
#define RESERVED4_P148          APOLLO5_PINMUX(148,4)
#define RESERVED5_P148          APOLLO5_PINMUX(148,5)
#define CT148_P148              APOLLO5_PINMUX(148,6)
#define NCE148_P148             APOLLO5_PINMUX(148,7)
#define RESERVED8_P148          APOLLO5_PINMUX(148,8)
#define RESERVED9_P148          APOLLO5_PINMUX(148,9)
#define RESERVED10_P148         APOLLO5_PINMUX(148,10)
#define FPIO_P148               APOLLO5_PINMUX(148,11)
#define RESERVED12_P148         APOLLO5_PINMUX(148,12)
#define RESERVED13_P148         APOLLO5_PINMUX(148,13)
#define RESERVED14_P148         APOLLO5_PINMUX(148,14)
#define RESERVED15_P148         APOLLO5_PINMUX(148,15)

#define RESERVED0_P149          APOLLO5_PINMUX(149,0)
#define DISP_D6_P149            APOLLO5_PINMUX(149,1)
#define DBIB_D9_P149            APOLLO5_PINMUX(149,2)
#define GPIO_P149               APOLLO5_PINMUX(149,3)
#define RESERVED4_P149          APOLLO5_PINMUX(149,4)
#define RESERVED5_P149          APOLLO5_PINMUX(149,5)
#define CT149_P149              APOLLO5_PINMUX(149,6)
#define NCE149_P149             APOLLO5_PINMUX(149,7)
#define RESERVED8_P149          APOLLO5_PINMUX(149,8)
#define RESERVED9_P149          APOLLO5_PINMUX(149,9)
#define RESERVED10_P149         APOLLO5_PINMUX(149,10)
#define FPIO_P149               APOLLO5_PINMUX(149,11)
#define RESERVED12_P149         APOLLO5_PINMUX(149,12)
#define RESERVED13_P149         APOLLO5_PINMUX(149,13)
#define RESERVED14_P149         APOLLO5_PINMUX(149,14)
#define RESERVED15_P149         APOLLO5_PINMUX(149,15)

#define RESERVED0_P150          APOLLO5_PINMUX(150,0)
#define DISP_D7_P150            APOLLO5_PINMUX(150,1)
#define DBIB_D10_P150           APOLLO5_PINMUX(150,2)
#define GPIO_P150               APOLLO5_PINMUX(150,3)
#define RESERVED4_P150          APOLLO5_PINMUX(150,4)
#define RESERVED5_P150          APOLLO5_PINMUX(150,5)
#define CT150_P150              APOLLO5_PINMUX(150,6)
#define NCE150_P150             APOLLO5_PINMUX(150,7)
#define RESERVED8_P150          APOLLO5_PINMUX(150,8)
#define RESERVED9_P150          APOLLO5_PINMUX(150,9)
#define RESERVED10_P150         APOLLO5_PINMUX(150,10)
#define FPIO_P150               APOLLO5_PINMUX(150,11)
#define RESERVED12_P150         APOLLO5_PINMUX(150,12)
#define RESERVED13_P150         APOLLO5_PINMUX(150,13)
#define RESERVED14_P150         APOLLO5_PINMUX(150,14)
#define RESERVED15_P150         APOLLO5_PINMUX(150,15)

#define RESERVED0_P151          APOLLO5_PINMUX(151,0)
#define DISP_D8_P151            APOLLO5_PINMUX(151,1)
#define DBIB_D11_P151           APOLLO5_PINMUX(151,2)
#define GPIO_P151               APOLLO5_PINMUX(151,3)
#define RESERVED4_P151          APOLLO5_PINMUX(151,4)
#define RESERVED5_P151          APOLLO5_PINMUX(151,5)
#define CT151_P151              APOLLO5_PINMUX(151,6)
#define NCE151_P151             APOLLO5_PINMUX(151,7)
#define RESERVED8_P151          APOLLO5_PINMUX(151,8)
#define RESERVED9_P151          APOLLO5_PINMUX(151,9)
#define RESERVED10_P151         APOLLO5_PINMUX(151,10)
#define FPIO_P151               APOLLO5_PINMUX(151,11)
#define RESERVED12_P151         APOLLO5_PINMUX(151,12)
#define RESERVED13_P151         APOLLO5_PINMUX(151,13)
#define RESERVED14_P151         APOLLO5_PINMUX(151,14)
#define RESERVED15_P151         APOLLO5_PINMUX(151,15)

#define RESERVED0_P152          APOLLO5_PINMUX(152,0)
#define DISP_D9_P152            APOLLO5_PINMUX(152,1)
#define DBIB_D12_P152           APOLLO5_PINMUX(152,2)
#define GPIO_P152               APOLLO5_PINMUX(152,3)
#define RESERVED4_P152          APOLLO5_PINMUX(152,4)
#define RESERVED5_P152          APOLLO5_PINMUX(152,5)
#define CT152_P152              APOLLO5_PINMUX(152,6)
#define NCE152_P152             APOLLO5_PINMUX(152,7)
#define RESERVED8_P152          APOLLO5_PINMUX(152,8)
#define RESERVED9_P152          APOLLO5_PINMUX(152,9)
#define RESERVED10_P152         APOLLO5_PINMUX(152,10)
#define FPIO_P152               APOLLO5_PINMUX(152,11)
#define RESERVED12_P152         APOLLO5_PINMUX(152,12)
#define RESERVED13_P152         APOLLO5_PINMUX(152,13)
#define RESERVED14_P152         APOLLO5_PINMUX(152,14)
#define RESERVED15_P152         APOLLO5_PINMUX(152,15)

#define RESERVED0_P153          APOLLO5_PINMUX(153,0)
#define DISP_D10_P153           APOLLO5_PINMUX(153,1)
#define DBIB_D13_P153           APOLLO5_PINMUX(153,2)
#define GPIO_P153               APOLLO5_PINMUX(153,3)
#define RESERVED4_P153          APOLLO5_PINMUX(153,4)
#define RESERVED5_P153          APOLLO5_PINMUX(153,5)
#define CT153_P153              APOLLO5_PINMUX(153,6)
#define NCE153_P153             APOLLO5_PINMUX(153,7)
#define RESERVED8_P153          APOLLO5_PINMUX(153,8)
#define RESERVED9_P153          APOLLO5_PINMUX(153,9)
#define RESERVED10_P153         APOLLO5_PINMUX(153,10)
#define FPIO_P153               APOLLO5_PINMUX(153,11)
#define RESERVED12_P153         APOLLO5_PINMUX(153,12)
#define RESERVED13_P153         APOLLO5_PINMUX(153,13)
#define RESERVED14_P153         APOLLO5_PINMUX(153,14)
#define RESERVED15_P153         APOLLO5_PINMUX(153,15)

#define RESERVED0_P154          APOLLO5_PINMUX(154,0)
#define DISP_D11_P154           APOLLO5_PINMUX(154,1)
#define DBIB_D14_P154           APOLLO5_PINMUX(154,2)
#define GPIO_P154               APOLLO5_PINMUX(154,3)
#define RESERVED4_P154          APOLLO5_PINMUX(154,4)
#define RESERVED5_P154          APOLLO5_PINMUX(154,5)
#define CT154_P154              APOLLO5_PINMUX(154,6)
#define NCE154_P154             APOLLO5_PINMUX(154,7)
#define RESERVED8_P154          APOLLO5_PINMUX(154,8)
#define RESERVED9_P154          APOLLO5_PINMUX(154,9)
#define RESERVED10_P154         APOLLO5_PINMUX(154,10)
#define FPIO_P154               APOLLO5_PINMUX(154,11)
#define RESERVED12_P154         APOLLO5_PINMUX(154,12)
#define RESERVED13_P154         APOLLO5_PINMUX(154,13)
#define RESERVED14_P154         APOLLO5_PINMUX(154,14)
#define RESERVED15_P154         APOLLO5_PINMUX(154,15)

#define RESERVED0_P155          APOLLO5_PINMUX(155,0)
#define DISP_D12_P155           APOLLO5_PINMUX(155,1)
#define DBIB_D15_P155           APOLLO5_PINMUX(155,2)
#define GPIO_P155               APOLLO5_PINMUX(155,3)
#define RESERVED4_P155          APOLLO5_PINMUX(155,4)
#define RESERVED5_P155          APOLLO5_PINMUX(155,5)
#define CT155_P155              APOLLO5_PINMUX(155,6)
#define NCE155_P155             APOLLO5_PINMUX(155,7)
#define RESERVED8_P155          APOLLO5_PINMUX(155,8)
#define RESERVED9_P155          APOLLO5_PINMUX(155,9)
#define RESERVED10_P155         APOLLO5_PINMUX(155,10)
#define FPIO_P155               APOLLO5_PINMUX(155,11)
#define RESERVED12_P155         APOLLO5_PINMUX(155,12)
#define RESERVED13_P155         APOLLO5_PINMUX(155,13)
#define RESERVED14_P155         APOLLO5_PINMUX(155,14)
#define RESERVED15_P155         APOLLO5_PINMUX(155,15)

#define SDIF0_DAT4_P156         APOLLO5_PINMUX(156,0)
#define MNCE2_1_P156            APOLLO5_PINMUX(156,1)
#define RESERVED2_P156          APOLLO5_PINMUX(156,2)
#define GPIO_P156               APOLLO5_PINMUX(156,3)
#define RESERVED4_P156          APOLLO5_PINMUX(156,4)
#define RESERVED5_P156          APOLLO5_PINMUX(156,5)
#define CT156_P156              APOLLO5_PINMUX(156,6)
#define NCE156_P156             APOLLO5_PINMUX(156,7)
#define RESERVED8_P156          APOLLO5_PINMUX(156,8)
#define RESERVED9_P156          APOLLO5_PINMUX(156,9)
#define RESERVED10_P156         APOLLO5_PINMUX(156,10)
#define FPIO_P156               APOLLO5_PINMUX(156,11)
#define RESERVED12_P156         APOLLO5_PINMUX(156,12)
#define RESERVED13_P156         APOLLO5_PINMUX(156,13)
#define RESERVED14_P156         APOLLO5_PINMUX(156,14)
#define RESERVED15_P156         APOLLO5_PINMUX(156,15)

#define SDIF0_DAT5_P157         APOLLO5_PINMUX(157,0)
#define MNCE2_0_P157            APOLLO5_PINMUX(157,1)
#define RESERVED2_P157          APOLLO5_PINMUX(157,2)
#define GPIO_P157               APOLLO5_PINMUX(157,3)
#define RESERVED4_P157          APOLLO5_PINMUX(157,4)
#define RESERVED5_P157          APOLLO5_PINMUX(157,5)
#define CT157_P157              APOLLO5_PINMUX(157,6)
#define NCE157_P157             APOLLO5_PINMUX(157,7)
#define RESERVED8_P157          APOLLO5_PINMUX(157,8)
#define RESERVED9_P157          APOLLO5_PINMUX(157,9)
#define RESERVED10_P157         APOLLO5_PINMUX(157,10)
#define FPIO_P157               APOLLO5_PINMUX(157,11)
#define RESERVED12_P157         APOLLO5_PINMUX(157,12)
#define RESERVED13_P157         APOLLO5_PINMUX(157,13)
#define RESERVED14_P157         APOLLO5_PINMUX(157,14)
#define RESERVED15_P157         APOLLO5_PINMUX(157,15)

#define SDIF0_DAT6_P158         APOLLO5_PINMUX(158,0)
#define RESERVED1_P158          APOLLO5_PINMUX(158,1)
#define RESERVED2_P158          APOLLO5_PINMUX(158,2)
#define GPIO_P158               APOLLO5_PINMUX(158,3)
#define RESERVED4_P158          APOLLO5_PINMUX(158,4)
#define RESERVED5_P158          APOLLO5_PINMUX(158,5)
#define CT158_P158              APOLLO5_PINMUX(158,6)
#define NCE158_P158             APOLLO5_PINMUX(158,7)
#define RESERVED8_P158          APOLLO5_PINMUX(158,8)
#define RESERVED9_P158          APOLLO5_PINMUX(158,9)
#define RESERVED10_P158         APOLLO5_PINMUX(158,10)
#define FPIO_P158               APOLLO5_PINMUX(158,11)
#define RESERVED12_P158         APOLLO5_PINMUX(158,12)
#define RESERVED13_P158         APOLLO5_PINMUX(158,13)
#define RESERVED14_P158         APOLLO5_PINMUX(158,14)
#define RESERVED15_P158         APOLLO5_PINMUX(158,15)

