zephyrproject-rtos/hal_ambiq/dts/apollo510/ambiq-apollo510-pinmux.h
#define SDIF0_DAT7_P159         APOLLO5_PINMUX(159,0)
#define RESERVED1_P159          APOLLO5_PINMUX(159,1)
#define RESERVED2_P159          APOLLO5_PINMUX(159,2)
#define GPIO_P159               APOLLO5_PINMUX(159,3)
#define RESERVED4_P159          APOLLO5_PINMUX(159,4)
#define RESERVED5_P159          APOLLO5_PINMUX(159,5)
#define CT159_P159              APOLLO5_PINMUX(159,6)
#define NCE159_P159             APOLLO5_PINMUX(159,7)
#define RESERVED8_P159          APOLLO5_PINMUX(159,8)
#define RESERVED9_P159          APOLLO5_PINMUX(159,9)
#define RESERVED10_P159         APOLLO5_PINMUX(159,10)
#define FPIO_P159               APOLLO5_PINMUX(159,11)
#define RESERVED12_P159         APOLLO5_PINMUX(159,12)
#define RESERVED13_P159         APOLLO5_PINMUX(159,13)
#define RESERVED14_P159         APOLLO5_PINMUX(159,14)
#define RESERVED15_P159         APOLLO5_PINMUX(159,15)

#define SDIF0_CMD_P160          APOLLO5_PINMUX(160,0)
#define RESERVED1_P160          APOLLO5_PINMUX(160,1)
#define RESERVED2_P160          APOLLO5_PINMUX(160,2)
#define GPIO_P160               APOLLO5_PINMUX(160,3)
#define RESERVED4_P160          APOLLO5_PINMUX(160,4)
#define RESERVED5_P160          APOLLO5_PINMUX(160,5)
#define CT160_P160              APOLLO5_PINMUX(160,6)
#define NCE160_P160             APOLLO5_PINMUX(160,7)
#define RESERVED8_P160          APOLLO5_PINMUX(160,8)
#define RESERVED9_P160          APOLLO5_PINMUX(160,9)
#define RESERVED10_P160         APOLLO5_PINMUX(160,10)
#define FPIO_P160               APOLLO5_PINMUX(160,11)
#define RESERVED12_P160         APOLLO5_PINMUX(160,12)
#define RESERVED13_P160         APOLLO5_PINMUX(160,13)
#define RESERVED14_P160         APOLLO5_PINMUX(160,14)
#define RESERVED15_P160         APOLLO5_PINMUX(160,15)

#define RESERVED0_P161          APOLLO5_PINMUX(161,0)
#define RESERVED1_P161          APOLLO5_PINMUX(161,1)
#define RESERVED2_P161          APOLLO5_PINMUX(161,2)
#define GPIO_P161               APOLLO5_PINMUX(161,3)
#define RESERVED4_P161          APOLLO5_PINMUX(161,4)
#define RESERVED5_P161          APOLLO5_PINMUX(161,5)
#define CT161_P161              APOLLO5_PINMUX(161,6)
#define NCE161_P161             APOLLO5_PINMUX(161,7)
#define RESERVED8_P161          APOLLO5_PINMUX(161,8)
#define I2S1_SDIN_P161          APOLLO5_PINMUX(161,9)
#define RESERVED10_P161         APOLLO5_PINMUX(161,10)
#define FPIO_P161               APOLLO5_PINMUX(161,11)
#define RESERVED12_P161         APOLLO5_PINMUX(161,12)
#define RESERVED13_P161         APOLLO5_PINMUX(161,13)
#define RESERVED14_P161         APOLLO5_PINMUX(161,14)
#define RESERVED15_P161         APOLLO5_PINMUX(161,15)

#define SLINT_P162              APOLLO5_PINMUX(162,0)
#define RESERVED1_P162          APOLLO5_PINMUX(162,1)
#define RESERVED2_P162          APOLLO5_PINMUX(162,2)
#define GPIO_P162               APOLLO5_PINMUX(162,3)
#define RESERVED4_P162          APOLLO5_PINMUX(162,4)
#define RESERVED5_P162          APOLLO5_PINMUX(162,5)
#define CT162_P162              APOLLO5_PINMUX(162,6)
#define NCE162_P162             APOLLO5_PINMUX(162,7)
#define RESERVED8_P162          APOLLO5_PINMUX(162,8)
#define RESERVED9_P162          APOLLO5_PINMUX(162,9)
#define RESERVED10_P162         APOLLO5_PINMUX(162,10)
#define FPIO_P162               APOLLO5_PINMUX(162,11)
#define RESERVED12_P162         APOLLO5_PINMUX(162,12)
#define RESERVED13_P162         APOLLO5_PINMUX(162,13)
#define RESERVED14_P162         APOLLO5_PINMUX(162,14)
#define RESERVED15_P162         APOLLO5_PINMUX(162,15)

#define RESERVED0_P163          APOLLO5_PINMUX(163,0)
#define RESERVED1_P163          APOLLO5_PINMUX(163,1)
#define RESERVED2_P163          APOLLO5_PINMUX(163,2)
#define RESERVED3_P163          APOLLO5_PINMUX(163,3)
#define RESERVED4_P163          APOLLO5_PINMUX(163,4)
#define RESERVED5_P163          APOLLO5_PINMUX(163,5)
#define RESERVED6_P163          APOLLO5_PINMUX(163,6)
#define RESERVED7_P163          APOLLO5_PINMUX(163,7)
#define RESERVED8_P163          APOLLO5_PINMUX(163,8)
#define RESERVED9_P163          APOLLO5_PINMUX(163,9)
#define RESERVED10_P163         APOLLO5_PINMUX(163,10)
#define RESERVED11_P163         APOLLO5_PINMUX(163,11)
#define RESERVED12_P163         APOLLO5_PINMUX(163,12)
#define RESERVED13_P163         APOLLO5_PINMUX(163,13)
#define RESERVED14_P163         APOLLO5_PINMUX(163,14)
#define RESERVED15_P163         APOLLO5_PINMUX(163,15)

#define RESERVED0_P164          APOLLO5_PINMUX(164,0)
#define RESERVED1_P164          APOLLO5_PINMUX(164,1)
#define RESERVED2_P164          APOLLO5_PINMUX(164,2)
#define RESERVED3_P164          APOLLO5_PINMUX(164,3)
#define RESERVED4_P164          APOLLO5_PINMUX(164,4)
#define RESERVED5_P164          APOLLO5_PINMUX(164,5)
#define RESERVED6_P164          APOLLO5_PINMUX(164,6)
#define RESERVED7_P164          APOLLO5_PINMUX(164,7)
#define RESERVED8_P164          APOLLO5_PINMUX(164,8)
#define RESERVED9_P164          APOLLO5_PINMUX(164,9)
#define RESERVED10_P164         APOLLO5_PINMUX(164,10)
#define RESERVED11_P164         APOLLO5_PINMUX(164,11)
#define RESERVED12_P164         APOLLO5_PINMUX(164,12)
#define RESERVED13_P164         APOLLO5_PINMUX(164,13)
#define RESERVED14_P164         APOLLO5_PINMUX(164,14)
#define RESERVED15_P164         APOLLO5_PINMUX(164,15)

#define RESERVED0_P165          APOLLO5_PINMUX(165,0)
#define RESERVED1_P165          APOLLO5_PINMUX(165,1)
#define RESERVED2_P165          APOLLO5_PINMUX(165,2)
#define GPIO_P165               APOLLO5_PINMUX(165,3)
#define RESERVED4_P165          APOLLO5_PINMUX(165,4)
#define RESERVED5_P165          APOLLO5_PINMUX(165,5)
#define CT165_P165              APOLLO5_PINMUX(165,6)
#define NCE165_P165             APOLLO5_PINMUX(165,7)
#define RESERVED8_P165          APOLLO5_PINMUX(165,8)
#define RESERVED9_P165          APOLLO5_PINMUX(165,9)
#define RESERVED10_P165         APOLLO5_PINMUX(165,10)
#define FPIO_P165               APOLLO5_PINMUX(165,11)
#define RESERVED12_P165         APOLLO5_PINMUX(165,12)
#define RESERVED13_P165         APOLLO5_PINMUX(165,13)
#define RESERVED14_P165         APOLLO5_PINMUX(165,14)
#define RESERVED15_P165         APOLLO5_PINMUX(165,15)

#define RESERVED0_P166          APOLLO5_PINMUX(166,0)
#define RESERVED1_P166          APOLLO5_PINMUX(166,1)
#define RESERVED2_P166          APOLLO5_PINMUX(166,2)
#define RESERVED3_P166          APOLLO5_PINMUX(166,3)
#define RESERVED4_P166          APOLLO5_PINMUX(166,4)
#define RESERVED5_P166          APOLLO5_PINMUX(166,5)
#define RESERVED6_P166          APOLLO5_PINMUX(166,6)
#define RESERVED7_P166          APOLLO5_PINMUX(166,7)
#define RESERVED8_P166          APOLLO5_PINMUX(166,8)
#define RESERVED9_P166          APOLLO5_PINMUX(166,9)
#define RESERVED10_P166         APOLLO5_PINMUX(166,10)
#define RESERVED11_P166         APOLLO5_PINMUX(166,11)
#define RESERVED12_P166         APOLLO5_PINMUX(166,12)
#define RESERVED13_P166         APOLLO5_PINMUX(166,13)
#define RESERVED14_P166         APOLLO5_PINMUX(166,14)
#define RESERVED15_P166         APOLLO5_PINMUX(166,15)

#define RESERVED0_P167          APOLLO5_PINMUX(167,0)
#define RESERVED1_P167          APOLLO5_PINMUX(167,1)
#define RESERVED2_P167          APOLLO5_PINMUX(167,2)
#define RESERVED3_P167          APOLLO5_PINMUX(167,3)
#define RESERVED4_P167          APOLLO5_PINMUX(167,4)
#define RESERVED5_P167          APOLLO5_PINMUX(167,5)
#define RESERVED6_P167          APOLLO5_PINMUX(167,6)
#define RESERVED7_P167          APOLLO5_PINMUX(167,7)
#define RESERVED8_P167          APOLLO5_PINMUX(167,8)
#define RESERVED9_P167          APOLLO5_PINMUX(167,9)
#define RESERVED10_P167         APOLLO5_PINMUX(167,10)
#define RESERVED11_P167         APOLLO5_PINMUX(167,11)
#define RESERVED12_P167         APOLLO5_PINMUX(167,12)
#define RESERVED13_P167         APOLLO5_PINMUX(167,13)
#define RESERVED14_P167         APOLLO5_PINMUX(167,14)
#define RESERVED15_P167         APOLLO5_PINMUX(167,15)

#define RESERVED0_P168          APOLLO5_PINMUX(168,0)
#define RESERVED1_P168          APOLLO5_PINMUX(168,1)
#define RESERVED2_P168          APOLLO5_PINMUX(168,2)
#define RESERVED3_P168          APOLLO5_PINMUX(168,3)
#define RESERVED4_P168          APOLLO5_PINMUX(168,4)
#define RESERVED5_P168          APOLLO5_PINMUX(168,5)
#define RESERVED6_P168          APOLLO5_PINMUX(168,6)
#define RESERVED7_P168          APOLLO5_PINMUX(168,7)
#define RESERVED8_P168          APOLLO5_PINMUX(168,8)
#define RESERVED9_P168          APOLLO5_PINMUX(168,9)
#define RESERVED10_P168         APOLLO5_PINMUX(168,10)
#define RESERVED11_P168         APOLLO5_PINMUX(168,11)
#define RESERVED12_P168         APOLLO5_PINMUX(168,12)
#define RESERVED13_P168         APOLLO5_PINMUX(168,13)
#define RESERVED14_P168         APOLLO5_PINMUX(168,14)
#define RESERVED15_P168         APOLLO5_PINMUX(168,15)

#define RESERVED0_P169          APOLLO5_PINMUX(169,0)
#define RESERVED1_P169          APOLLO5_PINMUX(169,1)
#define RESERVED2_P169          APOLLO5_PINMUX(169,2)
#define RESERVED3_P169          APOLLO5_PINMUX(169,3)
#define RESERVED4_P169          APOLLO5_PINMUX(169,4)
#define RESERVED5_P169          APOLLO5_PINMUX(169,5)
#define RESERVED6_P169          APOLLO5_PINMUX(169,6)
#define RESERVED7_P169          APOLLO5_PINMUX(169,7)
#define RESERVED8_P169          APOLLO5_PINMUX(169,8)
#define RESERVED9_P169          APOLLO5_PINMUX(169,9)
#define RESERVED10_P169         APOLLO5_PINMUX(169,10)
#define RESERVED11_P169         APOLLO5_PINMUX(169,11)
#define RESERVED12_P169         APOLLO5_PINMUX(169,12)
#define RESERVED13_P169         APOLLO5_PINMUX(169,13)
#define RESERVED14_P169         APOLLO5_PINMUX(169,14)
#define RESERVED15_P169         APOLLO5_PINMUX(169,15)

#define RESERVED0_P170          APOLLO5_PINMUX(170,0)
#define RESERVED1_P170          APOLLO5_PINMUX(170,1)
#define RESERVED2_P170          APOLLO5_PINMUX(170,2)
#define RESERVED3_P170          APOLLO5_PINMUX(170,3)
#define RESERVED4_P170          APOLLO5_PINMUX(170,4)
#define RESERVED5_P170          APOLLO5_PINMUX(170,5)
#define RESERVED6_P170          APOLLO5_PINMUX(170,6)
#define RESERVED7_P170          APOLLO5_PINMUX(170,7)
#define RESERVED8_P170          APOLLO5_PINMUX(170,8)
#define RESERVED9_P170          APOLLO5_PINMUX(170,9)
#define RESERVED10_P170         APOLLO5_PINMUX(170,10)
#define RESERVED11_P170         APOLLO5_PINMUX(170,11)
#define RESERVED12_P170         APOLLO5_PINMUX(170,12)
#define RESERVED13_P170         APOLLO5_PINMUX(170,13)
#define RESERVED14_P170         APOLLO5_PINMUX(170,14)
#define RESERVED15_P170         APOLLO5_PINMUX(170,15)

#define RESERVED0_P171          APOLLO5_PINMUX(171,0)
#define RESERVED1_P171          APOLLO5_PINMUX(171,1)
#define RESERVED2_P171          APOLLO5_PINMUX(171,2)
#define RESERVED3_P171          APOLLO5_PINMUX(171,3)
#define RESERVED4_P171          APOLLO5_PINMUX(171,4)
#define RESERVED5_P171          APOLLO5_PINMUX(171,5)
#define RESERVED6_P171          APOLLO5_PINMUX(171,6)
#define RESERVED7_P171          APOLLO5_PINMUX(171,7)
#define RESERVED8_P171          APOLLO5_PINMUX(171,8)
#define RESERVED9_P171          APOLLO5_PINMUX(171,9)
#define RESERVED10_P171         APOLLO5_PINMUX(171,10)
#define RESERVED11_P171         APOLLO5_PINMUX(171,11)
#define RESERVED12_P171         APOLLO5_PINMUX(171,12)
#define RESERVED13_P171         APOLLO5_PINMUX(171,13)
#define RESERVED14_P171         APOLLO5_PINMUX(171,14)
#define RESERVED15_P171         APOLLO5_PINMUX(171,15)

