zephyrproject-rtos/hal_ambiq/dts/apollo510/ambiq-apollo510-pinmux.h
#define RESERVED0_P172          APOLLO5_PINMUX(172,0)
#define RESERVED1_P172          APOLLO5_PINMUX(172,1)
#define RESERVED2_P172          APOLLO5_PINMUX(172,2)
#define RESERVED3_P172          APOLLO5_PINMUX(172,3)
#define RESERVED4_P172          APOLLO5_PINMUX(172,4)
#define RESERVED5_P172          APOLLO5_PINMUX(172,5)
#define RESERVED6_P172          APOLLO5_PINMUX(172,6)
#define RESERVED7_P172          APOLLO5_PINMUX(172,7)
#define RESERVED8_P172          APOLLO5_PINMUX(172,8)
#define RESERVED9_P172          APOLLO5_PINMUX(172,9)
#define RESERVED10_P172         APOLLO5_PINMUX(172,10)
#define RESERVED11_P172         APOLLO5_PINMUX(172,11)
#define RESERVED12_P172         APOLLO5_PINMUX(172,12)
#define RESERVED13_P172         APOLLO5_PINMUX(172,13)
#define RESERVED14_P172         APOLLO5_PINMUX(172,14)
#define RESERVED15_P172         APOLLO5_PINMUX(172,15)

#define SLFDINT_P173            APOLLO5_PINMUX(173,0)
#define SLFD1INT_P173           APOLLO5_PINMUX(173,1)
#define RESERVED2_P173          APOLLO5_PINMUX(173,2)
#define GPIO_P173               APOLLO5_PINMUX(173,3)
#define RESERVED4_P173          APOLLO5_PINMUX(173,4)
#define RESERVED5_P173          APOLLO5_PINMUX(173,5)
#define CT173_P173              APOLLO5_PINMUX(173,6)
#define NCE173_P173             APOLLO5_PINMUX(173,7)
#define RESERVED8_P173          APOLLO5_PINMUX(173,8)
#define RESERVED9_P173          APOLLO5_PINMUX(173,9)
#define RESERVED10_P173         APOLLO5_PINMUX(173,10)
#define FPIO_P173               APOLLO5_PINMUX(173,11)
#define RESERVED12_P173         APOLLO5_PINMUX(173,12)
#define RESERVED13_P173         APOLLO5_PINMUX(173,13)
#define RESERVED14_P173         APOLLO5_PINMUX(173,14)
#define RESERVED15_P173         APOLLO5_PINMUX(173,15)

#define RESERVED0_P174          APOLLO5_PINMUX(174,0)
#define RESERVED1_P174          APOLLO5_PINMUX(174,1)
#define RESERVED2_P174          APOLLO5_PINMUX(174,2)
#define RESERVED3_P174          APOLLO5_PINMUX(174,3)
#define RESERVED4_P174          APOLLO5_PINMUX(174,4)
#define RESERVED5_P174          APOLLO5_PINMUX(174,5)
#define RESERVED6_P174          APOLLO5_PINMUX(174,6)
#define RESERVED7_P174          APOLLO5_PINMUX(174,7)
#define RESERVED8_P174          APOLLO5_PINMUX(174,8)
#define RESERVED9_P174          APOLLO5_PINMUX(174,9)
#define RESERVED10_P174         APOLLO5_PINMUX(174,10)
#define RESERVED11_P174         APOLLO5_PINMUX(174,11)
#define RESERVED12_P174         APOLLO5_PINMUX(174,12)
#define RESERVED13_P174         APOLLO5_PINMUX(174,13)
#define RESERVED14_P174         APOLLO5_PINMUX(174,14)
#define RESERVED15_P174         APOLLO5_PINMUX(174,15)

#define RESERVED0_P175          APOLLO5_PINMUX(175,0)
#define RESERVED1_P175          APOLLO5_PINMUX(175,1)
#define RESERVED2_P175          APOLLO5_PINMUX(175,2)
#define GPIO_P175               APOLLO5_PINMUX(175,3)
#define RESERVED4_P175          APOLLO5_PINMUX(175,4)
#define RESERVED5_P175          APOLLO5_PINMUX(175,5)
#define CT175_P175              APOLLO5_PINMUX(175,6)
#define NCE175_P175             APOLLO5_PINMUX(175,7)
#define RESERVED8_P175          APOLLO5_PINMUX(175,8)
#define RESERVED9_P175          APOLLO5_PINMUX(175,9)
#define RESERVED10_P175         APOLLO5_PINMUX(175,10)
#define FPIO_P175               APOLLO5_PINMUX(175,11)
#define RESERVED12_P175         APOLLO5_PINMUX(175,12)
#define RESERVED13_P175         APOLLO5_PINMUX(175,13)
#define RESERVED14_P175         APOLLO5_PINMUX(175,14)
#define RESERVED15_P175         APOLLO5_PINMUX(175,15)

#define RESERVED0_P176          APOLLO5_PINMUX(176,0)
#define RESERVED1_P176          APOLLO5_PINMUX(176,1)
#define RESERVED2_P176          APOLLO5_PINMUX(176,2)
#define RESERVED3_P176          APOLLO5_PINMUX(176,3)
#define RESERVED4_P176          APOLLO5_PINMUX(176,4)
#define RESERVED5_P176          APOLLO5_PINMUX(176,5)
#define RESERVED6_P176          APOLLO5_PINMUX(176,6)
#define RESERVED7_P176          APOLLO5_PINMUX(176,7)
#define RESERVED8_P176          APOLLO5_PINMUX(176,8)
#define RESERVED9_P176          APOLLO5_PINMUX(176,9)
#define RESERVED10_P176         APOLLO5_PINMUX(176,10)
#define RESERVED11_P176         APOLLO5_PINMUX(176,11)
#define RESERVED12_P176         APOLLO5_PINMUX(176,12)
#define RESERVED13_P176         APOLLO5_PINMUX(176,13)
#define RESERVED14_P176         APOLLO5_PINMUX(176,14)
#define RESERVED15_P176         APOLLO5_PINMUX(176,15)

#define RESERVED0_P177          APOLLO5_PINMUX(177,0)
#define RESERVED1_P177          APOLLO5_PINMUX(177,1)
#define RESERVED2_P177          APOLLO5_PINMUX(177,2)
#define RESERVED3_P177          APOLLO5_PINMUX(177,3)
#define RESERVED4_P177          APOLLO5_PINMUX(177,4)
#define RESERVED5_P177          APOLLO5_PINMUX(177,5)
#define RESERVED6_P177          APOLLO5_PINMUX(177,6)
#define RESERVED7_P177          APOLLO5_PINMUX(177,7)
#define RESERVED8_P177          APOLLO5_PINMUX(177,8)
#define RESERVED9_P177          APOLLO5_PINMUX(177,9)
#define RESERVED10_P177         APOLLO5_PINMUX(177,10)
#define RESERVED11_P177         APOLLO5_PINMUX(177,11)
#define RESERVED12_P177         APOLLO5_PINMUX(177,12)
#define RESERVED13_P177         APOLLO5_PINMUX(177,13)
#define RESERVED14_P177         APOLLO5_PINMUX(177,14)
#define RESERVED15_P177         APOLLO5_PINMUX(177,15)

#define RESERVED0_P178          APOLLO5_PINMUX(178,0)
#define RESERVED1_P178          APOLLO5_PINMUX(178,1)
#define RESERVED2_P178          APOLLO5_PINMUX(178,2)
#define RESERVED3_P178          APOLLO5_PINMUX(178,3)
#define RESERVED4_P178          APOLLO5_PINMUX(178,4)
#define RESERVED5_P178          APOLLO5_PINMUX(178,5)
#define RESERVED6_P178          APOLLO5_PINMUX(178,6)
#define RESERVED7_P178          APOLLO5_PINMUX(178,7)
#define RESERVED8_P178          APOLLO5_PINMUX(178,8)
#define RESERVED9_P178          APOLLO5_PINMUX(178,9)
#define RESERVED10_P178         APOLLO5_PINMUX(178,10)
#define RESERVED11_P178         APOLLO5_PINMUX(178,11)
#define RESERVED12_P178         APOLLO5_PINMUX(178,12)
#define RESERVED13_P178         APOLLO5_PINMUX(178,13)
#define RESERVED14_P178         APOLLO5_PINMUX(178,14)
#define RESERVED15_P178         APOLLO5_PINMUX(178,15)

#define RESERVED0_P179          APOLLO5_PINMUX(179,0)
#define RESERVED1_P179          APOLLO5_PINMUX(179,1)
#define RESERVED2_P179          APOLLO5_PINMUX(179,2)
#define RESERVED3_P179          APOLLO5_PINMUX(179,3)
#define RESERVED4_P179          APOLLO5_PINMUX(179,4)
#define RESERVED5_P179          APOLLO5_PINMUX(179,5)
#define RESERVED6_P179          APOLLO5_PINMUX(179,6)
#define RESERVED7_P179          APOLLO5_PINMUX(179,7)
#define RESERVED8_P179          APOLLO5_PINMUX(179,8)
#define RESERVED9_P179          APOLLO5_PINMUX(179,9)
#define RESERVED10_P179         APOLLO5_PINMUX(179,10)
#define RESERVED11_P179         APOLLO5_PINMUX(179,11)
#define RESERVED12_P179         APOLLO5_PINMUX(179,12)
#define RESERVED13_P179         APOLLO5_PINMUX(179,13)
#define RESERVED14_P179         APOLLO5_PINMUX(179,14)
#define RESERVED15_P179         APOLLO5_PINMUX(179,15)

#define RESERVED0_P180          APOLLO5_PINMUX(180,0)
#define RESERVED1_P180          APOLLO5_PINMUX(180,1)
#define RESERVED2_P180          APOLLO5_PINMUX(180,2)
#define RESERVED3_P180          APOLLO5_PINMUX(180,3)
#define RESERVED4_P180          APOLLO5_PINMUX(180,4)
#define RESERVED5_P180          APOLLO5_PINMUX(180,5)
#define RESERVED6_P180          APOLLO5_PINMUX(180,6)
#define RESERVED7_P180          APOLLO5_PINMUX(180,7)
#define RESERVED8_P180          APOLLO5_PINMUX(180,8)
#define RESERVED9_P180          APOLLO5_PINMUX(180,9)
#define RESERVED10_P180         APOLLO5_PINMUX(180,10)
#define RESERVED11_P180         APOLLO5_PINMUX(180,11)
#define RESERVED12_P180         APOLLO5_PINMUX(180,12)
#define RESERVED13_P180         APOLLO5_PINMUX(180,13)
#define RESERVED14_P180         APOLLO5_PINMUX(180,14)
#define RESERVED15_P180         APOLLO5_PINMUX(180,15)

