zephyrproject-rtos/hal_ambiq/dts/apollo510/ambiq-apollo510-pinmux.h
#define RESERVED0_P181          APOLLO5_PINMUX(181,0)
#define RESERVED1_P181          APOLLO5_PINMUX(181,1)
#define RESERVED2_P181          APOLLO5_PINMUX(181,2)
#define RESERVED3_P181          APOLLO5_PINMUX(181,3)
#define RESERVED4_P181          APOLLO5_PINMUX(181,4)
#define RESERVED5_P181          APOLLO5_PINMUX(181,5)
#define RESERVED6_P181          APOLLO5_PINMUX(181,6)
#define RESERVED7_P181          APOLLO5_PINMUX(181,7)
#define RESERVED8_P181          APOLLO5_PINMUX(181,8)
#define RESERVED9_P181          APOLLO5_PINMUX(181,9)
#define RESERVED10_P181         APOLLO5_PINMUX(181,10)
#define RESERVED11_P181         APOLLO5_PINMUX(181,11)
#define RESERVED12_P181         APOLLO5_PINMUX(181,12)
#define RESERVED13_P181         APOLLO5_PINMUX(181,13)
#define RESERVED14_P181         APOLLO5_PINMUX(181,14)
#define RESERVED15_P181         APOLLO5_PINMUX(181,15)

#define RESERVED0_P182          APOLLO5_PINMUX(182,0)
#define RESERVED1_P182          APOLLO5_PINMUX(182,1)
#define RESERVED2_P182          APOLLO5_PINMUX(182,2)
#define RESERVED3_P182          APOLLO5_PINMUX(182,3)
#define RESERVED4_P182          APOLLO5_PINMUX(182,4)
#define RESERVED5_P182          APOLLO5_PINMUX(182,5)
#define RESERVED6_P182          APOLLO5_PINMUX(182,6)
#define RESERVED7_P182          APOLLO5_PINMUX(182,7)
#define RESERVED8_P182          APOLLO5_PINMUX(182,8)
#define RESERVED9_P182          APOLLO5_PINMUX(182,9)
#define RESERVED10_P182         APOLLO5_PINMUX(182,10)
#define RESERVED11_P182         APOLLO5_PINMUX(182,11)
#define RESERVED12_P182         APOLLO5_PINMUX(182,12)
#define RESERVED13_P182         APOLLO5_PINMUX(182,13)
#define RESERVED14_P182         APOLLO5_PINMUX(182,14)
#define RESERVED15_P182         APOLLO5_PINMUX(182,15)

#define RESERVED0_P183          APOLLO5_PINMUX(183,0)
#define RESERVED1_P183          APOLLO5_PINMUX(183,1)
#define RESERVED2_P183          APOLLO5_PINMUX(183,2)
#define RESERVED3_P183          APOLLO5_PINMUX(183,3)
#define RESERVED4_P183          APOLLO5_PINMUX(183,4)
#define RESERVED5_P183          APOLLO5_PINMUX(183,5)
#define RESERVED6_P183          APOLLO5_PINMUX(183,6)
#define RESERVED7_P183          APOLLO5_PINMUX(183,7)
#define RESERVED8_P183          APOLLO5_PINMUX(183,8)
#define RESERVED9_P183          APOLLO5_PINMUX(183,9)
#define RESERVED10_P183         APOLLO5_PINMUX(183,10)
#define RESERVED11_P183         APOLLO5_PINMUX(183,11)
#define RESERVED12_P183         APOLLO5_PINMUX(183,12)
#define RESERVED13_P183         APOLLO5_PINMUX(183,13)
#define RESERVED14_P183         APOLLO5_PINMUX(183,14)
#define RESERVED15_P183         APOLLO5_PINMUX(183,15)

#define RESERVED0_P184          APOLLO5_PINMUX(184,0)
#define RESERVED1_P184          APOLLO5_PINMUX(184,1)
#define RESERVED2_P184          APOLLO5_PINMUX(184,2)
#define RESERVED3_P184          APOLLO5_PINMUX(184,3)
#define RESERVED4_P184          APOLLO5_PINMUX(184,4)
#define RESERVED5_P184          APOLLO5_PINMUX(184,5)
#define RESERVED6_P184          APOLLO5_PINMUX(184,6)
#define RESERVED7_P184          APOLLO5_PINMUX(184,7)
#define RESERVED8_P184          APOLLO5_PINMUX(184,8)
#define RESERVED9_P184          APOLLO5_PINMUX(184,9)
#define RESERVED10_P184         APOLLO5_PINMUX(184,10)
#define RESERVED11_P184         APOLLO5_PINMUX(184,11)
#define RESERVED12_P184         APOLLO5_PINMUX(184,12)
#define RESERVED13_P184         APOLLO5_PINMUX(184,13)
#define RESERVED14_P184         APOLLO5_PINMUX(184,14)
#define RESERVED15_P184         APOLLO5_PINMUX(184,15)

#define RESERVED0_P185          APOLLO5_PINMUX(185,0)
#define RESERVED1_P185          APOLLO5_PINMUX(185,1)
#define RESERVED2_P185          APOLLO5_PINMUX(185,2)
#define RESERVED3_P185          APOLLO5_PINMUX(185,3)
#define RESERVED4_P185          APOLLO5_PINMUX(185,4)
#define RESERVED5_P185          APOLLO5_PINMUX(185,5)
#define RESERVED6_P185          APOLLO5_PINMUX(185,6)
#define RESERVED7_P185          APOLLO5_PINMUX(185,7)
#define RESERVED8_P185          APOLLO5_PINMUX(185,8)
#define RESERVED9_P185          APOLLO5_PINMUX(185,9)
#define RESERVED10_P185         APOLLO5_PINMUX(185,10)
#define RESERVED11_P185         APOLLO5_PINMUX(185,11)
#define RESERVED12_P185         APOLLO5_PINMUX(185,12)
#define RESERVED13_P185         APOLLO5_PINMUX(185,13)
#define RESERVED14_P185         APOLLO5_PINMUX(185,14)
#define RESERVED15_P185         APOLLO5_PINMUX(185,15)

#define RESERVED0_P186          APOLLO5_PINMUX(186,0)
#define DISP_SD_P186            APOLLO5_PINMUX(186,1)
#define RESERVED2_P186          APOLLO5_PINMUX(186,2)
#define GPIO_P186               APOLLO5_PINMUX(186,3)
#define RESERVED4_P186          APOLLO5_PINMUX(186,4)
#define RESERVED5_P186          APOLLO5_PINMUX(186,5)
#define CT186_P186              APOLLO5_PINMUX(186,6)
#define NCE186_P186             APOLLO5_PINMUX(186,7)
#define RESERVED8_P186          APOLLO5_PINMUX(186,8)
#define RESERVED9_P186          APOLLO5_PINMUX(186,9)
#define RESERVED10_P186         APOLLO5_PINMUX(186,10)
#define FPIO_P186               APOLLO5_PINMUX(186,11)
#define RESERVED12_P186         APOLLO5_PINMUX(186,12)
#define RESERVED13_P186         APOLLO5_PINMUX(186,13)
#define RESERVED14_P186         APOLLO5_PINMUX(186,14)
#define RESERVED15_P186         APOLLO5_PINMUX(186,15)

#define RESERVED0_P187          APOLLO5_PINMUX(187,0)
#define DISP_DE_P187            APOLLO5_PINMUX(187,1)
#define RESERVED2_P187          APOLLO5_PINMUX(187,2)
#define GPIO_P187               APOLLO5_PINMUX(187,3)
#define RESERVED4_P187          APOLLO5_PINMUX(187,4)
#define RESERVED5_P187          APOLLO5_PINMUX(187,5)
#define CT187_P187              APOLLO5_PINMUX(187,6)
#define NCE187_P187             APOLLO5_PINMUX(187,7)
#define RESERVED8_P187          APOLLO5_PINMUX(187,8)
#define RESERVED9_P187          APOLLO5_PINMUX(187,9)
#define RESERVED10_P187         APOLLO5_PINMUX(187,10)
#define FPIO_P187               APOLLO5_PINMUX(187,11)
#define RESERVED12_P187         APOLLO5_PINMUX(187,12)
#define RESERVED13_P187         APOLLO5_PINMUX(187,13)
#define RESERVED14_P187         APOLLO5_PINMUX(187,14)
#define RESERVED15_P187         APOLLO5_PINMUX(187,15)

