zephyrproject-rtos/hal_ambiq/dts/apollo510/ambiq-apollo510-pinmux.h
#define RESERVED0_P188          APOLLO5_PINMUX(188,0)
#define DISP_CM_P188            APOLLO5_PINMUX(188,1)
#define RESERVED2_P188          APOLLO5_PINMUX(188,2)
#define GPIO_P188               APOLLO5_PINMUX(188,3)
#define RESERVED4_P188          APOLLO5_PINMUX(188,4)
#define RESERVED5_P188          APOLLO5_PINMUX(188,5)
#define CT188_P188              APOLLO5_PINMUX(188,6)
#define NCE188_P188             APOLLO5_PINMUX(188,7)
#define RESERVED8_P188          APOLLO5_PINMUX(188,8)
#define RESERVED9_P188          APOLLO5_PINMUX(188,9)
#define RESERVED10_P188         APOLLO5_PINMUX(188,10)
#define FPIO_P188               APOLLO5_PINMUX(188,11)
#define RESERVED12_P188         APOLLO5_PINMUX(188,12)
#define RESERVED13_P188         APOLLO5_PINMUX(188,13)
#define RESERVED14_P188         APOLLO5_PINMUX(188,14)
#define RESERVED15_P188         APOLLO5_PINMUX(188,15)

#define RESERVED0_P189          APOLLO5_PINMUX(189,0)
#define DISP_PCLK_P189          APOLLO5_PINMUX(189,1)
#define RESERVED2_P189          APOLLO5_PINMUX(189,2)
#define GPIO_P189               APOLLO5_PINMUX(189,3)
#define RESERVED4_P189          APOLLO5_PINMUX(189,4)
#define RESERVED5_P189          APOLLO5_PINMUX(189,5)
#define CT189_P189              APOLLO5_PINMUX(189,6)
#define NCE189_P189             APOLLO5_PINMUX(189,7)
#define RESERVED8_P189          APOLLO5_PINMUX(189,8)
#define RESERVED9_P189          APOLLO5_PINMUX(189,9)
#define RESERVED10_P189         APOLLO5_PINMUX(189,10)
#define FPIO_P189               APOLLO5_PINMUX(189,11)
#define RESERVED12_P189         APOLLO5_PINMUX(189,12)
#define RESERVED13_P189         APOLLO5_PINMUX(189,13)
#define RESERVED14_P189         APOLLO5_PINMUX(189,14)
#define RESERVED15_P189         APOLLO5_PINMUX(189,15)

#define RESERVED0_P190          APOLLO5_PINMUX(190,0)
#define RESERVED1_P190          APOLLO5_PINMUX(190,1)
#define RESERVED2_P190          APOLLO5_PINMUX(190,2)
#define RESERVED3_P190          APOLLO5_PINMUX(190,3)
#define RESERVED4_P190          APOLLO5_PINMUX(190,4)
#define RESERVED5_P190          APOLLO5_PINMUX(190,5)
#define RESERVED6_P190          APOLLO5_PINMUX(190,6)
#define RESERVED7_P190          APOLLO5_PINMUX(190,7)
#define RESERVED8_P190          APOLLO5_PINMUX(190,8)
#define RESERVED9_P190          APOLLO5_PINMUX(190,9)
#define RESERVED10_P190         APOLLO5_PINMUX(190,10)
#define RESERVED11_P190         APOLLO5_PINMUX(190,11)
#define RESERVED12_P190         APOLLO5_PINMUX(190,12)
#define RESERVED13_P190         APOLLO5_PINMUX(190,13)
#define RESERVED14_P190         APOLLO5_PINMUX(190,14)
#define RESERVED15_P190         APOLLO5_PINMUX(190,15)

#define RESERVED0_P191          APOLLO5_PINMUX(191,0)
#define RESERVED1_P191          APOLLO5_PINMUX(191,1)
#define RESERVED2_P191          APOLLO5_PINMUX(191,2)
#define GPIO_P191               APOLLO5_PINMUX(191,3)
#define RESERVED4_P191          APOLLO5_PINMUX(191,4)
#define RESERVED5_P191          APOLLO5_PINMUX(191,5)
#define CT191_P191              APOLLO5_PINMUX(191,6)
#define NCE191_P191             APOLLO5_PINMUX(191,7)
#define RESERVED8_P191          APOLLO5_PINMUX(191,8)
#define RESERVED9_P191          APOLLO5_PINMUX(191,9)
#define RESERVED10_P191         APOLLO5_PINMUX(191,10)
#define FPIO_P191               APOLLO5_PINMUX(191,11)
#define RESERVED12_P191         APOLLO5_PINMUX(191,12)
#define RESERVED13_P191         APOLLO5_PINMUX(191,13)
#define RESERVED14_P191         APOLLO5_PINMUX(191,14)
#define RESERVED15_P191         APOLLO5_PINMUX(191,15)

#define RESERVED0_P192          APOLLO5_PINMUX(192,0)
#define MNCE2_0_P192            APOLLO5_PINMUX(192,1)
#define RESERVED2_P192          APOLLO5_PINMUX(192,2)
#define GPIO_P192               APOLLO5_PINMUX(192,3)
#define RESERVED4_P192          APOLLO5_PINMUX(192,4)
#define RESERVED5_P192          APOLLO5_PINMUX(192,5)
#define CT192_P192              APOLLO5_PINMUX(192,6)
#define NCE192_P192             APOLLO5_PINMUX(192,7)
#define RESERVED8_P192          APOLLO5_PINMUX(192,8)
#define RESERVED9_P192          APOLLO5_PINMUX(192,9)
#define RESERVED10_P192         APOLLO5_PINMUX(192,10)
#define FPIO_P192               APOLLO5_PINMUX(192,11)
#define RESERVED12_P192         APOLLO5_PINMUX(192,12)
#define RESERVED13_P192         APOLLO5_PINMUX(192,13)
#define RESERVED14_P192         APOLLO5_PINMUX(192,14)
#define RESERVED15_P192         APOLLO5_PINMUX(192,15)

#define RESERVED0_P193          APOLLO5_PINMUX(193,0)
#define RESERVED1_P193          APOLLO5_PINMUX(193,1)
#define RESERVED2_P193          APOLLO5_PINMUX(193,2)
#define RESERVED3_P193          APOLLO5_PINMUX(193,3)
#define RESERVED4_P193          APOLLO5_PINMUX(193,4)
#define RESERVED5_P193          APOLLO5_PINMUX(193,5)
#define RESERVED6_P193          APOLLO5_PINMUX(193,6)
#define RESERVED7_P193          APOLLO5_PINMUX(193,7)
#define RESERVED8_P193          APOLLO5_PINMUX(193,8)
#define RESERVED9_P193          APOLLO5_PINMUX(193,9)
#define RESERVED10_P193         APOLLO5_PINMUX(193,10)
#define RESERVED11_P193         APOLLO5_PINMUX(193,11)
#define RESERVED12_P193         APOLLO5_PINMUX(193,12)
#define RESERVED13_P193         APOLLO5_PINMUX(193,13)
#define RESERVED14_P193         APOLLO5_PINMUX(193,14)
#define RESERVED15_P193         APOLLO5_PINMUX(193,15)

#define RESERVED0_P194          APOLLO5_PINMUX(194,0)
#define RESERVED1_P194          APOLLO5_PINMUX(194,1)
#define RESERVED2_P194          APOLLO5_PINMUX(194,2)
#define RESERVED3_P194          APOLLO5_PINMUX(194,3)
#define RESERVED4_P194          APOLLO5_PINMUX(194,4)
#define RESERVED5_P194          APOLLO5_PINMUX(194,5)
#define RESERVED6_P194          APOLLO5_PINMUX(194,6)
#define RESERVED7_P194          APOLLO5_PINMUX(194,7)
#define RESERVED8_P194          APOLLO5_PINMUX(194,8)
#define RESERVED9_P194          APOLLO5_PINMUX(194,9)
#define RESERVED10_P194         APOLLO5_PINMUX(194,10)
#define RESERVED11_P194         APOLLO5_PINMUX(194,11)
#define RESERVED12_P194         APOLLO5_PINMUX(194,12)
#define RESERVED13_P194         APOLLO5_PINMUX(194,13)
#define RESERVED14_P194         APOLLO5_PINMUX(194,14)
#define RESERVED15_P194         APOLLO5_PINMUX(194,15)

#define RESERVED0_P195          APOLLO5_PINMUX(195,0)
#define MNCE3_1_P195            APOLLO5_PINMUX(195,1)
#define MNCE3_0_P195            APOLLO5_PINMUX(195,2)
#define GPIO_P195               APOLLO5_PINMUX(195,3)
#define RESERVED4_P195          APOLLO5_PINMUX(195,4)
#define RESERVED5_P195          APOLLO5_PINMUX(195,5)
#define CT195_P195              APOLLO5_PINMUX(195,6)
#define NCE195_P195             APOLLO5_PINMUX(195,7)
#define RESERVED8_P195          APOLLO5_PINMUX(195,8)
#define RESERVED9_P195          APOLLO5_PINMUX(195,9)
#define RESERVED10_P195         APOLLO5_PINMUX(195,10)
#define FPIO_P195               APOLLO5_PINMUX(195,11)
#define RESERVED12_P195         APOLLO5_PINMUX(195,12)
#define RESERVED13_P195         APOLLO5_PINMUX(195,13)
#define RESERVED14_P195         APOLLO5_PINMUX(195,14)
#define RESERVED15_P195         APOLLO5_PINMUX(195,15)

#define RESERVED0_P196          APOLLO5_PINMUX(196,0)
#define RESERVED1_P196          APOLLO5_PINMUX(196,1)
#define RESERVED2_P196          APOLLO5_PINMUX(196,2)
#define RESERVED3_P196          APOLLO5_PINMUX(196,3)
#define RESERVED4_P196          APOLLO5_PINMUX(196,4)
#define RESERVED5_P196          APOLLO5_PINMUX(196,5)
#define RESERVED6_P196          APOLLO5_PINMUX(196,6)
#define RESERVED7_P196          APOLLO5_PINMUX(196,7)
#define RESERVED8_P196          APOLLO5_PINMUX(196,8)
#define RESERVED9_P196          APOLLO5_PINMUX(196,9)
#define RESERVED10_P196         APOLLO5_PINMUX(196,10)
#define RESERVED11_P196         APOLLO5_PINMUX(196,11)
#define RESERVED12_P196         APOLLO5_PINMUX(196,12)
#define RESERVED13_P196         APOLLO5_PINMUX(196,13)
#define RESERVED14_P196         APOLLO5_PINMUX(196,14)
#define RESERVED15_P196         APOLLO5_PINMUX(196,15)

