zephyrproject-rtos/hal_ambiq/dts/apollo510/ambiq-apollo510-pinmux.h
#define RESERVED0_P197          APOLLO5_PINMUX(197,0)
#define RESERVED1_P197          APOLLO5_PINMUX(197,1)
#define RESERVED2_P197          APOLLO5_PINMUX(197,2)
#define RESERVED3_P197          APOLLO5_PINMUX(197,3)
#define RESERVED4_P197          APOLLO5_PINMUX(197,4)
#define RESERVED5_P197          APOLLO5_PINMUX(197,5)
#define RESERVED6_P197          APOLLO5_PINMUX(197,6)
#define RESERVED7_P197          APOLLO5_PINMUX(197,7)
#define RESERVED8_P197          APOLLO5_PINMUX(197,8)
#define RESERVED9_P197          APOLLO5_PINMUX(197,9)
#define RESERVED10_P197         APOLLO5_PINMUX(197,10)
#define RESERVED11_P197         APOLLO5_PINMUX(197,11)
#define RESERVED12_P197         APOLLO5_PINMUX(197,12)
#define RESERVED13_P197         APOLLO5_PINMUX(197,13)
#define RESERVED14_P197         APOLLO5_PINMUX(197,14)
#define RESERVED15_P197         APOLLO5_PINMUX(197,15)

#define RESERVED0_P198          APOLLO5_PINMUX(198,0)
#define RESERVED1_P198          APOLLO5_PINMUX(198,1)
#define RESERVED2_P198          APOLLO5_PINMUX(198,2)
#define RESERVED3_P198          APOLLO5_PINMUX(198,3)
#define RESERVED4_P198          APOLLO5_PINMUX(198,4)
#define RESERVED5_P198          APOLLO5_PINMUX(198,5)
#define RESERVED6_P198          APOLLO5_PINMUX(198,6)
#define RESERVED7_P198          APOLLO5_PINMUX(198,7)
#define RESERVED8_P198          APOLLO5_PINMUX(198,8)
#define RESERVED9_P198          APOLLO5_PINMUX(198,9)
#define RESERVED10_P198         APOLLO5_PINMUX(198,10)
#define RESERVED11_P198         APOLLO5_PINMUX(198,11)
#define RESERVED12_P198         APOLLO5_PINMUX(198,12)
#define RESERVED13_P198         APOLLO5_PINMUX(198,13)
#define RESERVED14_P198         APOLLO5_PINMUX(198,14)
#define RESERVED15_P198         APOLLO5_PINMUX(198,15)

#define RESERVED0_P199          APOLLO5_PINMUX(199,0)
#define MNCE0_0_P199            APOLLO5_PINMUX(199,1)
#define RESERVED2_P199          APOLLO5_PINMUX(199,2)
#define GPIO_P199               APOLLO5_PINMUX(199,3)
#define RESERVED4_P199          APOLLO5_PINMUX(199,4)
#define RESERVED5_P199          APOLLO5_PINMUX(199,5)
#define CT199_P199              APOLLO5_PINMUX(199,6)
#define NCE199_P199             APOLLO5_PINMUX(199,7)
#define RESERVED8_P199          APOLLO5_PINMUX(199,8)
#define RESERVED9_P199          APOLLO5_PINMUX(199,9)
#define RESERVED10_P199         APOLLO5_PINMUX(199,10)
#define FPIO_P199               APOLLO5_PINMUX(199,11)
#define RESERVED12_P199         APOLLO5_PINMUX(199,12)
#define RESERVED13_P199         APOLLO5_PINMUX(199,13)
#define RESERVED14_P199         APOLLO5_PINMUX(199,14)
#define RESERVED15_P199         APOLLO5_PINMUX(199,15)

#define RESERVED0_P200          APOLLO5_PINMUX(200,0)
#define MNCE0_1_P200            APOLLO5_PINMUX(200,1)
#define MNCE0_0_P200            APOLLO5_PINMUX(200,2)
#define GPIO_P200               APOLLO5_PINMUX(200,3)
#define RESERVED4_P200          APOLLO5_PINMUX(200,4)
#define RESERVED5_P200          APOLLO5_PINMUX(200,5)
#define CT200_P200              APOLLO5_PINMUX(200,6)
#define NCE200_P200             APOLLO5_PINMUX(200,7)
#define RESERVED8_P200          APOLLO5_PINMUX(200,8)
#define RESERVED9_P200          APOLLO5_PINMUX(200,9)
#define RESERVED10_P200         APOLLO5_PINMUX(200,10)
#define FPIO_P200               APOLLO5_PINMUX(200,11)
#define RESERVED12_P200         APOLLO5_PINMUX(200,12)
#define RESERVED13_P200         APOLLO5_PINMUX(200,13)
#define RESERVED14_P200         APOLLO5_PINMUX(200,14)
#define RESERVED15_P200         APOLLO5_PINMUX(200,15)

#define RESERVED0_P201          APOLLO5_PINMUX(201,0)
#define RESERVED1_P201          APOLLO5_PINMUX(201,1)
#define RESERVED2_P201          APOLLO5_PINMUX(201,2)
#define GPIO_P201               APOLLO5_PINMUX(201,3)
#define RESERVED4_P201          APOLLO5_PINMUX(201,4)
#define RESERVED5_P201          APOLLO5_PINMUX(201,5)
#define CT201_P201              APOLLO5_PINMUX(201,6)
#define NCE201_P201             APOLLO5_PINMUX(201,7)
#define RESERVED8_P201          APOLLO5_PINMUX(201,8)
#define RESERVED9_P201          APOLLO5_PINMUX(201,9)
#define RESERVED10_P201         APOLLO5_PINMUX(201,10)
#define FPIO_P201               APOLLO5_PINMUX(201,11)
#define RESERVED12_P201         APOLLO5_PINMUX(201,12)
#define RESERVED13_P201         APOLLO5_PINMUX(201,13)
#define RESERVED14_P201         APOLLO5_PINMUX(201,14)
#define RESERVED15_P201         APOLLO5_PINMUX(201,15)

#define RESERVED0_P202          APOLLO5_PINMUX(202,0)
#define RESERVED1_P202          APOLLO5_PINMUX(202,1)
#define RESERVED2_P202          APOLLO5_PINMUX(202,2)
#define RESERVED3_P202          APOLLO5_PINMUX(202,3)
#define RESERVED4_P202          APOLLO5_PINMUX(202,4)
#define RESERVED5_P202          APOLLO5_PINMUX(202,5)
#define RESERVED6_P202          APOLLO5_PINMUX(202,6)
#define RESERVED7_P202          APOLLO5_PINMUX(202,7)
#define RESERVED8_P202          APOLLO5_PINMUX(202,8)
#define RESERVED9_P202          APOLLO5_PINMUX(202,9)
#define RESERVED10_P202         APOLLO5_PINMUX(202,10)
#define RESERVED11_P202         APOLLO5_PINMUX(202,11)
#define RESERVED12_P202         APOLLO5_PINMUX(202,12)
#define RESERVED13_P202         APOLLO5_PINMUX(202,13)
#define RESERVED14_P202         APOLLO5_PINMUX(202,14)
#define RESERVED15_P202         APOLLO5_PINMUX(202,15)

#define RESERVED0_P203          APOLLO5_PINMUX(203,0)
#define RESERVED1_P203          APOLLO5_PINMUX(203,1)
#define RESERVED2_P203          APOLLO5_PINMUX(203,2)
#define RESERVED3_P203          APOLLO5_PINMUX(203,3)
#define RESERVED4_P203          APOLLO5_PINMUX(203,4)
#define RESERVED5_P203          APOLLO5_PINMUX(203,5)
#define RESERVED6_P203          APOLLO5_PINMUX(203,6)
#define RESERVED7_P203          APOLLO5_PINMUX(203,7)
#define RESERVED8_P203          APOLLO5_PINMUX(203,8)
#define RESERVED9_P203          APOLLO5_PINMUX(203,9)
#define RESERVED10_P203         APOLLO5_PINMUX(203,10)
#define RESERVED11_P203         APOLLO5_PINMUX(203,11)
#define RESERVED12_P203         APOLLO5_PINMUX(203,12)
#define RESERVED13_P203         APOLLO5_PINMUX(203,13)
#define RESERVED14_P203         APOLLO5_PINMUX(203,14)
#define RESERVED15_P203         APOLLO5_PINMUX(203,15)

#define RESERVED0_P204          APOLLO5_PINMUX(204,0)
#define RESERVED1_P204          APOLLO5_PINMUX(204,1)
#define RESERVED2_P204          APOLLO5_PINMUX(204,2)
#define RESERVED3_P204          APOLLO5_PINMUX(204,3)
#define RESERVED4_P204          APOLLO5_PINMUX(204,4)
#define RESERVED5_P204          APOLLO5_PINMUX(204,5)
#define RESERVED6_P204          APOLLO5_PINMUX(204,6)
#define RESERVED7_P204          APOLLO5_PINMUX(204,7)
#define RESERVED8_P204          APOLLO5_PINMUX(204,8)
#define RESERVED9_P204          APOLLO5_PINMUX(204,9)
#define RESERVED10_P204         APOLLO5_PINMUX(204,10)
#define RESERVED11_P204         APOLLO5_PINMUX(204,11)
#define RESERVED12_P204         APOLLO5_PINMUX(204,12)
#define RESERVED13_P204         APOLLO5_PINMUX(204,13)
#define RESERVED14_P204         APOLLO5_PINMUX(204,14)
#define RESERVED15_P204         APOLLO5_PINMUX(204,15)

#define RESERVED0_P205          APOLLO5_PINMUX(205,0)
#define RESERVED1_P205          APOLLO5_PINMUX(205,1)
#define RESERVED2_P205          APOLLO5_PINMUX(205,2)
#define RESERVED3_P205          APOLLO5_PINMUX(205,3)
#define RESERVED4_P205          APOLLO5_PINMUX(205,4)
#define RESERVED5_P205          APOLLO5_PINMUX(205,5)
#define RESERVED6_P205          APOLLO5_PINMUX(205,6)
#define RESERVED7_P205          APOLLO5_PINMUX(205,7)
#define RESERVED8_P205          APOLLO5_PINMUX(205,8)
#define RESERVED9_P205          APOLLO5_PINMUX(205,9)
#define RESERVED10_P205         APOLLO5_PINMUX(205,10)
#define RESERVED11_P205         APOLLO5_PINMUX(205,11)
#define RESERVED12_P205         APOLLO5_PINMUX(205,12)
#define RESERVED13_P205         APOLLO5_PINMUX(205,13)
#define RESERVED14_P205         APOLLO5_PINMUX(205,14)
#define RESERVED15_P205         APOLLO5_PINMUX(205,15)

