zephyrproject-rtos/hal_ambiq/dts/apollo510/ambiq-apollo510-pinmux.h
#define RESERVED0_P206          APOLLO5_PINMUX(206,0)
#define RESERVED1_P206          APOLLO5_PINMUX(206,1)
#define RESERVED2_P206          APOLLO5_PINMUX(206,2)
#define RESERVED3_P206          APOLLO5_PINMUX(206,3)
#define RESERVED4_P206          APOLLO5_PINMUX(206,4)
#define RESERVED5_P206          APOLLO5_PINMUX(206,5)
#define RESERVED6_P206          APOLLO5_PINMUX(206,6)
#define RESERVED7_P206          APOLLO5_PINMUX(206,7)
#define RESERVED8_P206          APOLLO5_PINMUX(206,8)
#define RESERVED9_P206          APOLLO5_PINMUX(206,9)
#define RESERVED10_P206         APOLLO5_PINMUX(206,10)
#define RESERVED11_P206         APOLLO5_PINMUX(206,11)
#define RESERVED12_P206         APOLLO5_PINMUX(206,12)
#define RESERVED13_P206         APOLLO5_PINMUX(206,13)
#define RESERVED14_P206         APOLLO5_PINMUX(206,14)
#define RESERVED15_P206         APOLLO5_PINMUX(206,15)

#define RESERVED0_P207          APOLLO5_PINMUX(207,0)
#define RESERVED1_P207          APOLLO5_PINMUX(207,1)
#define RESERVED2_P207          APOLLO5_PINMUX(207,2)
#define RESERVED3_P207          APOLLO5_PINMUX(207,3)
#define RESERVED4_P207          APOLLO5_PINMUX(207,4)
#define RESERVED5_P207          APOLLO5_PINMUX(207,5)
#define RESERVED6_P207          APOLLO5_PINMUX(207,6)
#define RESERVED7_P207          APOLLO5_PINMUX(207,7)
#define RESERVED8_P207          APOLLO5_PINMUX(207,8)
#define RESERVED9_P207          APOLLO5_PINMUX(207,9)
#define RESERVED10_P207         APOLLO5_PINMUX(207,10)
#define RESERVED11_P207         APOLLO5_PINMUX(207,11)
#define RESERVED12_P207         APOLLO5_PINMUX(207,12)
#define RESERVED13_P207         APOLLO5_PINMUX(207,13)
#define RESERVED14_P207         APOLLO5_PINMUX(207,14)
#define RESERVED15_P207         APOLLO5_PINMUX(207,15)

#define RESERVED0_P208          APOLLO5_PINMUX(208,0)
#define XT32KHz_P208            APOLLO5_PINMUX(208,1)
#define RESERVED2_P208          APOLLO5_PINMUX(208,2)
#define GPIO_P208               APOLLO5_PINMUX(208,3)
#define RESERVED4_P208          APOLLO5_PINMUX(208,4)
#define RESERVED5_P208          APOLLO5_PINMUX(208,5)
#define CT208_P208              APOLLO5_PINMUX(208,6)
#define NCE208_P208             APOLLO5_PINMUX(208,7)
#define RESERVED8_P208          APOLLO5_PINMUX(208,8)
#define RESERVED9_P208          APOLLO5_PINMUX(208,9)
#define RESERVED10_P208         APOLLO5_PINMUX(208,10)
#define FPIO_P208               APOLLO5_PINMUX(208,11)
#define RESERVED12_P208         APOLLO5_PINMUX(208,12)
#define RESERVED13_P208         APOLLO5_PINMUX(208,13)
#define RESERVED14_P208         APOLLO5_PINMUX(208,14)
#define RESERVED15_P208         APOLLO5_PINMUX(208,15)

#define DISP_ENB_P209           APOLLO5_PINMUX(209,0)
#define DISP_D1_P209            APOLLO5_PINMUX(209,1)
#define DBIB_CSX_P209           APOLLO5_PINMUX(209,2)
#define GPIO_P209               APOLLO5_PINMUX(209,3)
#define RESERVED4_P209          APOLLO5_PINMUX(209,4)
#define RESERVED5_P209          APOLLO5_PINMUX(209,5)
#define CT209_P209              APOLLO5_PINMUX(209,6)
#define NCE209_P209             APOLLO5_PINMUX(209,7)
#define RESERVED8_P209          APOLLO5_PINMUX(209,8)
#define RESERVED9_P209          APOLLO5_PINMUX(209,9)
#define RESERVED10_P209         APOLLO5_PINMUX(209,10)
#define FPIO_P209               APOLLO5_PINMUX(209,11)
#define RESERVED12_P209         APOLLO5_PINMUX(209,12)
#define RESERVED13_P209         APOLLO5_PINMUX(209,13)
#define RESERVED14_P209         APOLLO5_PINMUX(209,14)
#define RESERVED15_P209         APOLLO5_PINMUX(209,15)

#define DISP_XRST_P210          APOLLO5_PINMUX(210,0)
#define DISP_D4_P210            APOLLO5_PINMUX(210,1)
#define DBIB_DCX_P210           APOLLO5_PINMUX(210,2)
#define GPIO_P210               APOLLO5_PINMUX(210,3)
#define RESERVED4_P210          APOLLO5_PINMUX(210,4)
#define RESERVED5_P210          APOLLO5_PINMUX(210,5)
#define CT210_P210              APOLLO5_PINMUX(210,6)
#define NCE210_P210             APOLLO5_PINMUX(210,7)
#define RESERVED8_P210          APOLLO5_PINMUX(210,8)
#define RESERVED9_P210          APOLLO5_PINMUX(210,9)
#define RESERVED10_P210         APOLLO5_PINMUX(210,10)
#define FPIO_P210               APOLLO5_PINMUX(210,11)
#define RESERVED12_P210         APOLLO5_PINMUX(210,12)
#define RESERVED13_P210         APOLLO5_PINMUX(210,13)
#define RESERVED14_P210         APOLLO5_PINMUX(210,14)
#define RESERVED15_P210         APOLLO5_PINMUX(210,15)

#define DISP_R1_P211            APOLLO5_PINMUX(211,0)
#define DISP_D23_P211           APOLLO5_PINMUX(211,1)
#define DBIB_WRX_P211           APOLLO5_PINMUX(211,2)
#define GPIO_P211               APOLLO5_PINMUX(211,3)
#define RESERVED4_P211          APOLLO5_PINMUX(211,4)
#define RESERVED5_P211          APOLLO5_PINMUX(211,5)
#define CT211_P211              APOLLO5_PINMUX(211,6)
#define NCE211_P211             APOLLO5_PINMUX(211,7)
#define RESERVED8_P211          APOLLO5_PINMUX(211,8)
#define RESERVED9_P211          APOLLO5_PINMUX(211,9)
#define RESERVED10_P211         APOLLO5_PINMUX(211,10)
#define FPIO_P211               APOLLO5_PINMUX(211,11)
#define RESERVED12_P211         APOLLO5_PINMUX(211,12)
#define RESERVED13_P211         APOLLO5_PINMUX(211,13)
#define RESERVED14_P211         APOLLO5_PINMUX(211,14)
#define RESERVED15_P211         APOLLO5_PINMUX(211,15)

#define DISP_R2_P212            APOLLO5_PINMUX(212,0)
#define DISP_D22_P212           APOLLO5_PINMUX(212,1)
#define DBIB_RDX_P212           APOLLO5_PINMUX(212,2)
#define GPIO_P212               APOLLO5_PINMUX(212,3)
#define RESERVED4_P212          APOLLO5_PINMUX(212,4)
#define RESERVED5_P212          APOLLO5_PINMUX(212,5)
#define CT212_P212              APOLLO5_PINMUX(212,6)
#define NCE212_P212             APOLLO5_PINMUX(212,7)
#define RESERVED8_P212          APOLLO5_PINMUX(212,8)
#define RESERVED9_P212          APOLLO5_PINMUX(212,9)
#define RESERVED10_P212         APOLLO5_PINMUX(212,10)
#define FPIO_P212               APOLLO5_PINMUX(212,11)
#define RESERVED12_P212         APOLLO5_PINMUX(212,12)
#define RESERVED13_P212         APOLLO5_PINMUX(212,13)
#define RESERVED14_P212         APOLLO5_PINMUX(212,14)
#define RESERVED15_P212         APOLLO5_PINMUX(212,15)

