zephyrproject-rtos/hal_ambiq/dts/apollo510/ambiq-apollo510-pinmux.h
#define DISP_G1_P213            APOLLO5_PINMUX(213,0)
#define DISP_D21_P213           APOLLO5_PINMUX(213,1)
#define DBIB_D0_P213            APOLLO5_PINMUX(213,2)
#define GPIO_P213               APOLLO5_PINMUX(213,3)
#define RESERVED4_P213          APOLLO5_PINMUX(213,4)
#define RESERVED5_P213          APOLLO5_PINMUX(213,5)
#define CT213_P213              APOLLO5_PINMUX(213,6)
#define NCE213_P213             APOLLO5_PINMUX(213,7)
#define RESERVED8_P213          APOLLO5_PINMUX(213,8)
#define RESERVED9_P213          APOLLO5_PINMUX(213,9)
#define RESERVED10_P213         APOLLO5_PINMUX(213,10)
#define FPIO_P213               APOLLO5_PINMUX(213,11)
#define RESERVED12_P213         APOLLO5_PINMUX(213,12)
#define RESERVED13_P213         APOLLO5_PINMUX(213,13)
#define RESERVED14_P213         APOLLO5_PINMUX(213,14)
#define RESERVED15_P213         APOLLO5_PINMUX(213,15)

#define DISP_G2_P214            APOLLO5_PINMUX(214,0)
#define DISP_D20_P214           APOLLO5_PINMUX(214,1)
#define DBIB_D1_P214            APOLLO5_PINMUX(214,2)
#define GPIO_P214               APOLLO5_PINMUX(214,3)
#define RESERVED4_P214          APOLLO5_PINMUX(214,4)
#define RESERVED5_P214          APOLLO5_PINMUX(214,5)
#define CT214_P214              APOLLO5_PINMUX(214,6)
#define NCE214_P214             APOLLO5_PINMUX(214,7)
#define RESERVED8_P214          APOLLO5_PINMUX(214,8)
#define RESERVED9_P214          APOLLO5_PINMUX(214,9)
#define RESERVED10_P214         APOLLO5_PINMUX(214,10)
#define FPIO_P214               APOLLO5_PINMUX(214,11)
#define RESERVED12_P214         APOLLO5_PINMUX(214,12)
#define RESERVED13_P214         APOLLO5_PINMUX(214,13)
#define RESERVED14_P214         APOLLO5_PINMUX(214,14)
#define RESERVED15_P214         APOLLO5_PINMUX(214,15)

#define DISP_B1_P215            APOLLO5_PINMUX(215,0)
#define DISP_D19_P215           APOLLO5_PINMUX(215,1)
#define DBIB_D2_P215            APOLLO5_PINMUX(215,2)
#define GPIO_P215               APOLLO5_PINMUX(215,3)
#define RESERVED4_P215          APOLLO5_PINMUX(215,4)
#define RESERVED5_P215          APOLLO5_PINMUX(215,5)
#define CT215_P215              APOLLO5_PINMUX(215,6)
#define NCE215_P215             APOLLO5_PINMUX(215,7)
#define RESERVED8_P215          APOLLO5_PINMUX(215,8)
#define RESERVED9_P215          APOLLO5_PINMUX(215,9)
#define RESERVED10_P215         APOLLO5_PINMUX(215,10)
#define FPIO_P215               APOLLO5_PINMUX(215,11)
#define RESERVED12_P215         APOLLO5_PINMUX(215,12)
#define RESERVED13_P215         APOLLO5_PINMUX(215,13)
#define RESERVED14_P215         APOLLO5_PINMUX(215,14)
#define RESERVED15_P215         APOLLO5_PINMUX(215,15)

#define DISP_B2_P216            APOLLO5_PINMUX(216,0)
#define DISP_D18_P216           APOLLO5_PINMUX(216,1)
#define DBIB_D3_P216            APOLLO5_PINMUX(216,2)
#define GPIO_P216               APOLLO5_PINMUX(216,3)
#define RESERVED4_P216          APOLLO5_PINMUX(216,4)
#define RESERVED5_P216          APOLLO5_PINMUX(216,5)
#define CT216_P216              APOLLO5_PINMUX(216,6)
#define NCE216_P216             APOLLO5_PINMUX(216,7)
#define RESERVED8_P216          APOLLO5_PINMUX(216,8)
#define RESERVED9_P216          APOLLO5_PINMUX(216,9)
#define RESERVED10_P216         APOLLO5_PINMUX(216,10)
#define FPIO_P216               APOLLO5_PINMUX(216,11)
#define RESERVED12_P216         APOLLO5_PINMUX(216,12)
#define RESERVED13_P216         APOLLO5_PINMUX(216,13)
#define RESERVED14_P216         APOLLO5_PINMUX(216,14)
#define RESERVED15_P216         APOLLO5_PINMUX(216,15)

#define DISP_HST_P217           APOLLO5_PINMUX(217,0)
#define DISP_HS_P217            APOLLO5_PINMUX(217,1)
#define DBIB_D4_P217            APOLLO5_PINMUX(217,2)
#define GPIO_P217               APOLLO5_PINMUX(217,3)
#define RESERVED4_P217          APOLLO5_PINMUX(217,4)
#define RESERVED5_P217          APOLLO5_PINMUX(217,5)
#define CT217_P217              APOLLO5_PINMUX(217,6)
#define NCE217_P217             APOLLO5_PINMUX(217,7)
#define RESERVED8_P217          APOLLO5_PINMUX(217,8)
#define RESERVED9_P217          APOLLO5_PINMUX(217,9)
#define RESERVED10_P217         APOLLO5_PINMUX(217,10)
#define FPIO_P217               APOLLO5_PINMUX(217,11)
#define RESERVED12_P217         APOLLO5_PINMUX(217,12)
#define RESERVED13_P217         APOLLO5_PINMUX(217,13)
#define RESERVED14_P217         APOLLO5_PINMUX(217,14)
#define RESERVED15_P217         APOLLO5_PINMUX(217,15)

#define DISP_VST_P218           APOLLO5_PINMUX(218,0)
#define DISP_VS_P218            APOLLO5_PINMUX(218,1)
#define DBIB_D5_P218            APOLLO5_PINMUX(218,2)
#define GPIO_P218               APOLLO5_PINMUX(218,3)
#define RESERVED4_P218          APOLLO5_PINMUX(218,4)
#define RESERVED5_P218          APOLLO5_PINMUX(218,5)
#define CT218_P218              APOLLO5_PINMUX(218,6)
#define NCE218_P218             APOLLO5_PINMUX(218,7)
#define RESERVED8_P218          APOLLO5_PINMUX(218,8)
#define RESERVED9_P218          APOLLO5_PINMUX(218,9)
#define RESERVED10_P218         APOLLO5_PINMUX(218,10)
#define FPIO_P218               APOLLO5_PINMUX(218,11)
#define RESERVED12_P218         APOLLO5_PINMUX(218,12)
#define RESERVED13_P218         APOLLO5_PINMUX(218,13)
#define RESERVED14_P218         APOLLO5_PINMUX(218,14)
#define RESERVED15_P218         APOLLO5_PINMUX(218,15)

#define DISP_HCK_P219           APOLLO5_PINMUX(219,0)
#define DISP_D3_P219            APOLLO5_PINMUX(219,1)
#define DBIB_D6_P219            APOLLO5_PINMUX(219,2)
#define GPIO_P219               APOLLO5_PINMUX(219,3)
#define RESERVED4_P219          APOLLO5_PINMUX(219,4)
#define RESERVED5_P219          APOLLO5_PINMUX(219,5)
#define CT219_P219              APOLLO5_PINMUX(219,6)
#define NCE219_P219             APOLLO5_PINMUX(219,7)
#define RESERVED8_P219          APOLLO5_PINMUX(219,8)
#define RESERVED9_P219          APOLLO5_PINMUX(219,9)
#define RESERVED10_P219         APOLLO5_PINMUX(219,10)
#define FPIO_P219               APOLLO5_PINMUX(219,11)
#define RESERVED12_P219         APOLLO5_PINMUX(219,12)
#define RESERVED13_P219         APOLLO5_PINMUX(219,13)
#define RESERVED14_P219         APOLLO5_PINMUX(219,14)
#define RESERVED15_P219         APOLLO5_PINMUX(219,15)

#define DISP_VCK_P220           APOLLO5_PINMUX(220,0)
#define DISP_D0_P220            APOLLO5_PINMUX(220,1)
#define DBIB_D7_P220            APOLLO5_PINMUX(220,2)
#define GPIO_P220               APOLLO5_PINMUX(220,3)
#define RESERVED4_P220          APOLLO5_PINMUX(220,4)
#define RESERVED5_P220          APOLLO5_PINMUX(220,5)
#define CT220_P220              APOLLO5_PINMUX(220,6)
#define NCE220_P220             APOLLO5_PINMUX(220,7)
#define RESERVED8_P220          APOLLO5_PINMUX(220,8)
#define RESERVED9_P220          APOLLO5_PINMUX(220,9)
#define RESERVED10_P220         APOLLO5_PINMUX(220,10)
#define FPIO_P220               APOLLO5_PINMUX(220,11)
#define RESERVED12_P220         APOLLO5_PINMUX(220,12)
#define RESERVED13_P220         APOLLO5_PINMUX(220,13)
#define RESERVED14_P220         APOLLO5_PINMUX(220,14)
#define RESERVED15_P220         APOLLO5_PINMUX(220,15)

#define RESERVED0_P221          APOLLO5_PINMUX(221,0)
#define DISP_D2_P221            APOLLO5_PINMUX(221,1)
#define RESERVED2_P221          APOLLO5_PINMUX(221,2)
#define GPIO_P221               APOLLO5_PINMUX(221,3)
#define RESERVED4_P221          APOLLO5_PINMUX(221,4)
#define RESERVED5_P221          APOLLO5_PINMUX(221,5)
#define CT221_P221              APOLLO5_PINMUX(221,6)
#define NCE221_P221             APOLLO5_PINMUX(221,7)
#define RESERVED8_P221          APOLLO5_PINMUX(221,8)
#define RESERVED9_P221          APOLLO5_PINMUX(221,9)
#define RESERVED10_P221         APOLLO5_PINMUX(221,10)
#define FPIO_P221               APOLLO5_PINMUX(221,11)
#define RESERVED12_P221         APOLLO5_PINMUX(221,12)
#define RESERVED13_P221         APOLLO5_PINMUX(221,13)
#define RESERVED14_P221         APOLLO5_PINMUX(221,14)
#define RESERVED15_P221         APOLLO5_PINMUX(221,15)

#define RESERVED0_P222          APOLLO5_PINMUX(222,0)
#define DISP_D13_P222           APOLLO5_PINMUX(222,1)
#define RESERVED2_P222          APOLLO5_PINMUX(222,2)
#define GPIO_P222               APOLLO5_PINMUX(222,3)
#define RESERVED4_P222          APOLLO5_PINMUX(222,4)
#define RESERVED5_P222          APOLLO5_PINMUX(222,5)
#define CT222_P222              APOLLO5_PINMUX(222,6)
#define NCE222_P222             APOLLO5_PINMUX(222,7)
#define RESERVED8_P222          APOLLO5_PINMUX(222,8)
#define MNCE0_0_P222            APOLLO5_PINMUX(222,9)
#define RESERVED10_P222         APOLLO5_PINMUX(222,10)
#define FPIO_P222               APOLLO5_PINMUX(222,11)
#define RESERVED12_P222         APOLLO5_PINMUX(222,12)
#define RESERVED13_P222         APOLLO5_PINMUX(222,13)
#define RESERVED14_P222         APOLLO5_PINMUX(222,14)
#define RESERVED15_P222         APOLLO5_PINMUX(222,15)

#define RESERVED0_P223          APOLLO5_PINMUX(223,0)
#define DISP_D14_P223           APOLLO5_PINMUX(223,1)
#define RESERVED2_P223          APOLLO5_PINMUX(223,2)
#define GPIO_P223               APOLLO5_PINMUX(223,3)
#define RESERVED4_P223          APOLLO5_PINMUX(223,4)
#define RESERVED5_P223          APOLLO5_PINMUX(223,5)
#define CT223_P223              APOLLO5_PINMUX(223,6)
#define NCE223_P223             APOLLO5_PINMUX(223,7)
#define RESERVED8_P223          APOLLO5_PINMUX(223,8)
#define MNCE3_0_P223            APOLLO5_PINMUX(223,9)
#define RESERVED10_P223         APOLLO5_PINMUX(223,10)
#define FPIO_P223               APOLLO5_PINMUX(223,11)
#define RESERVED12_P223         APOLLO5_PINMUX(223,12)
#define RESERVED13_P223         APOLLO5_PINMUX(223,13)
#define RESERVED14_P223         APOLLO5_PINMUX(223,14)
#define RESERVED15_P223         APOLLO5_PINMUX(223,15)


#endif /* __APOLLO510_PINMUX_H__ */
